
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Источник = ПараметрыВыполненияКоманды.Источник;
	
	Если ТипЗнч(Источник) = ЭСФКлиентПереопределяемый.ПолучитьТипФормаКлиентскогоПриложения() Тогда
			
		Если Источник.ИмяФормы = "Документ.ЭлектронныйАктВыполненныхРабот.Форма.ФормаДокумента" Тогда
			
			АВРКлиент.ОтправитьИсходящиеАВР(ПараметрКоманды, Новый Структура("ЗапускатьФоновоеЗадание", Ложь));
			
		Иначе
			
			ИспользоватьФоновуюОтправкуАВР = АВРКлиентСервер.ИспользоватьФоновуюОтправкуАВР();
			
			ДополнительныеПараметры = Новый Структура("ЗапускатьФоновоеЗадание, КлючФормы", ИспользоватьФоновуюОтправкуАВР, Источник.КлючУникальности);
			
			АВРКлиент.ОтправитьИсходящиеАВР(ПараметрКоманды, ДополнительныеПараметры);
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры
