
#Область СлужебныеПроцедурыИФункции

// Структура для заполнения данными, по которым будет производится резервирование и печать кодов
// маркировки товаров.
// 
// Возвращаемое значение:
// 	Структура - Описание:
// * Организация              - ОпределяемыйТип.Организации - Организация. 
// * ВидПродукции             - ПеречислениеСсылка.ВидыПродукциИСМПТК - Вид продукции.
// * СпособВводаВОборот       - ПеречислениеСсылка.СпособыВводаВОборотСУЗИСМПТК - Способ ввода 
// * Шаблон                   - ПеречислениеСсылка.ШаблоныКодовМаркировкиСУЗИСМПТК - Шаблон кода маркировки
// * ЭтоКодМаркировки         - Булево - Признак принадлежности структуры к маркируемой продукции,
//                              так же, могут печататься логистические упаковки.
// * СодержимоеКоличество     - Число - Количество элементов внутри (для логистической упаковки)
// * НомерВГруппе             - Число - Номер по порядку (для логистической упаковки)
// * Количество               - Число - Количество этикеток для печати
// * ШаблонЭтикетки           - СправочникСсылка.ШаблоныЭтикетокИСМПТК - Шаблон для печати
// * ТипШтрихкода             - ПеречислениеСсылка.ТипыШтрихкодов - Тип штрихкода для печати
// * Штрихкод                 - Строка - Значение штрихкода (используется дла печати и отметки о печати известного кода)
// * Серия                    - СправочникСсылка.СерииНоменклатуры - Серия, устанавливается в новый элемент 
//                              ШтрикодУпаковкиТоваров
// * Номенклатура             - СправочникСсылка.Номенклатура - Номенклатура для заполнения шаблона
// * Характеристика           - СправочникСсылка.ХарактеристикиНоменклатуры - Характеристика для заполнения шаблона
Функция СтруктураПечатиЭтикетки() Экспорт
	
	ПараметрыШтрихкода = Новый Структура;
	ПараметрыШтрихкода.Вставить("Организация");
	ПараметрыШтрихкода.Вставить("ВидПродукции");
	ПараметрыШтрихкода.Вставить("Номенклатура");
	ПараметрыШтрихкода.Вставить("Характеристика");
	ПараметрыШтрихкода.Вставить("Серия");
	ПараметрыШтрихкода.Вставить("Штрихкод");
	ПараметрыШтрихкода.Вставить("ТипШтрихкода");
	ПараметрыШтрихкода.Вставить("ШаблонЭтикетки");
	ПараметрыШтрихкода.Вставить("Количество", 0);
	ПараметрыШтрихкода.Вставить("НомерВГруппе", 0);
	ПараметрыШтрихкода.Вставить("СодержимоеКоличество", 0);
	ПараметрыШтрихкода.Вставить("ЭтоКодМаркировки", Истина);
	ПараметрыШтрихкода.Вставить("Шаблон");
	ПараметрыШтрихкода.Вставить("СпособВводаВОборот");
	ПараметрыШтрихкода.Вставить("КодИдентификации");
	ПараметрыШтрихкода.Вставить("КодМаркировки");
	ПараметрыШтрихкода.Вставить("ХешСуммаКодаИдентификации");
	ПараметрыШтрихкода.Вставить("МаркировкаОстатков");
	ПараметрыШтрихкода.Вставить("GTIN");
	ПараметрыШтрихкода.Вставить("ЗаказКМ");
	
	Возврат ПараметрыШтрихкода;
	
КонецФункции

Функция СтруктураПечатиЭтикеткиSSCC() Экспорт
	
	ПараметрыШтрихкода = Новый Структура;
	ПараметрыШтрихкода.Вставить("Организация");
	ПараметрыШтрихкода.Вставить("ЦифраРасширения");
	ПараметрыШтрихкода.Вставить("ПрефиксКомпанииGS1");
	ПараметрыШтрихкода.Вставить("СерийныйНомерSSCC");
	ПараметрыШтрихкода.Вставить("Штрихкод");
	ПараметрыШтрихкода.Вставить("ТипШтрихкода");
	ПараметрыШтрихкода.Вставить("ШаблонЭтикетки");
	ПараметрыШтрихкода.Вставить("Количество", 0);
	
	Возврат ПараметрыШтрихкода;
	
КонецФункции

Функция ПолучитьШаблонЭтикеткиSSCC() Экспорт
	
	Возврат ПечатьКодовМаркировкиИСМПТКВызовСервера.ПолучитьШаблонЭтикеткиSSCC();
	
КонецФункции

Функция ПроверитьПризнакGS1УШаблона(ШаблонПечати) Экспорт
	
	Возврат ПечатьКодовМаркировкиИСМПТКВызовСервера.ПроверитьПризнакGS1УШаблона(ШаблонПечати);
	
КонецФункции

#КонецОбласти