
#Область СлужебныеПроцедурыИФункции

Функция ОборудованиеПоПараметрам(ТипыПО = Неопределено, Идентификатор = Неопределено, РабочееМесто = Неопределено, ТолькоАвтоматическаяФискализация = Ложь) Экспорт
	
	Возврат МенеджерОборудованияВызовСервера.ОборудованиеПоПараметрам(ТипыПО, Идентификатор, РабочееМесто);
	
КонецФункции

Функция ОпределитьТипШтрихкода(Штрихкод) Экспорт
	
	Возврат МенеджерОборудованияВызовСервера.ОпределитьТипШтрихкода(Штрихкод);
	
КонецФункции

Функция ПолучитьПредставлениеРазделАдминистрирование() Экспорт
	
	//Представление главной подсистемы администрирования, в которой находится ссылка на форму настроек сервиса маркировки. 
	Возврат Метаданные.Подсистемы.Администрирование.Представление();
	
КонецФункции

Функция ПараметрыВыполненияВФоне(Знач ИдентификаторФормы = Неопределено) Экспорт
	
	Возврат ДлительныеОперации.ПараметрыВыполненияВФоне(ИдентификаторФормы);
	
КонецФункции

Функция ВыполнитьВФоне(Знач ИмяПроцедуры, Знач ПараметрыПроцедуры, Знач ПараметрыВыполнения) Экспорт

	Возврат ДлительныеОперации.ВыполнитьВФоне(ИмяПроцедуры, ПараметрыПроцедуры, ПараметрыВыполнения)
	
КонецФункции

#КонецОбласти