
#Область СлужебныеПроцедурыИФункции

Процедура си_ОбработкаУдаленияПроведенияДокументовОбработкаУдаленияПроведения(Источник, Отказ) Экспорт
	ПроведениеСервер.ОбработкаУдаленияПроведенияДокумента(Источник, Отказ);
КонецПроцедуры

Процедура си_ПередЗаписьюДокументаОчисткаРеквизитаРучнаяКорректировкаПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	ОбщегоНазначенияБК.ПередЗаписьюДокументаОчисткаРеквизитаРучнаяКорректировка(Источник, Отказ, РежимЗаписи, РежимПроведения);
КонецПроцедуры

Процедура си_ПередЗаписьюДокументаУстановкаАвтораПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	ЗаполнениеДокументов.ПередЗаписьюДокументаУстановкаАвтораПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения);
КонецПроцедуры

Процедура си_ПолныйЗарегистрироватьИзменениеПередЗаписью(Источник, Отказ) Экспорт
	ОбменДаннымиРИБСобытия.ПолныйЗарегистрироватьИзменениеПередЗаписью(Источник, Отказ);
КонецПроцедуры

Процедура си_ПолныйЗарегистрироватьИзменениеДокументаПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	ОбменДаннымиРИБСобытия.ПолныйЗарегистрироватьИзменениеДокументаПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения);
КонецПроцедуры

Процедура си_ПолныйЗарегистрироватьИзменениеКонстантыПередЗаписью(Источник, Отказ) Экспорт
	ОбменДаннымиРИБСобытия.ПолныйЗарегистрироватьИзменениеКонстантыПередЗаписью(Источник, Отказ);
КонецПроцедуры

Процедура си_ПолныйЗарегистрироватьИзменениеНабораЗаписейПередЗаписью(Источник, Отказ, Замещение) Экспорт
	ОбменДаннымиРИБСобытия.ПолныйЗарегистрироватьИзменениеНабораЗаписейПередЗаписью(Источник, Отказ, Замещение);
КонецПроцедуры

Процедура си_ПолныйЗарегистрироватьУдалениеПередУдалением(Источник, Отказ) Экспорт
	ОбменДаннымиРИБСобытия.ПолныйЗарегистрироватьУдалениеПередУдалением(Источник, Отказ);
КонецПроцедуры

Процедура си_ПоОрганизацииЗарегистрироватьИзменениеПередЗаписью(Источник, Отказ) Экспорт
	ОбменДаннымиРИБСобытия.ПоОрганизацииЗарегистрироватьИзменениеПередЗаписью(Источник, Отказ);
КонецПроцедуры

Процедура си_ПоОрганизацииЗарегистрироватьИзменениеДокументаПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	ОбменДаннымиРИБСобытия.ПоОрганизацииЗарегистрироватьИзменениеДокументаПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения);
КонецПроцедуры

Процедура си_ПоОрганизацииЗарегистрироватьИзменениеКонстантыПередЗаписью(Источник, Отказ) Экспорт
	ОбменДаннымиРИБСобытия.ПоОрганизацииЗарегистрироватьИзменениеКонстантыПередЗаписью(Источник, Отказ);
КонецПроцедуры

Процедура си_ПоОрганизацииЗарегистрироватьИзменениеНабораЗаписейПередЗаписью(Источник, Отказ, Замещение) Экспорт
	ОбменДаннымиРИБСобытия.ПоОрганизацииЗарегистрироватьИзменениеНабораЗаписейПередЗаписью(Источник, Отказ, Замещение);
КонецПроцедуры

Процедура си_ПоОрганизацииЗарегистрироватьУдалениеПередУдалением(Источник, Отказ) Экспорт
	ОбменДаннымиРИБСобытия.ПоОрганизацииЗарегистрироватьУдалениеПередУдалением(Источник, Отказ);
КонецПроцедуры

Процедура си_ПриКопированииДокументаОчисткаОбщихРеквизитовПриКопировании(Источник, ОбъектКопирования) Экспорт
	//ОбщегоНазначения.ПриКопированиеДокументаОчисткаОбщихРеквизитов(Источник, ОбъектКопирования);
	ОбщегоНазначенияБК.ПриКопированиеДокументаОчисткаОбщихРеквизитов(Источник, ОбъектКопирования);
КонецПроцедуры

Процедура си_ПриУстановкеНовогоКодаСправочникаПриУстановкеНовогоКода(Источник, СтандартнаяОбработка, Префикс) Экспорт
	//фин_ПрефиксацияОбъектовБКСобытия.УстановитьПрефиксИнформационнойБазы(Источник, СтандартнаяОбработка, Префикс);
	ПрефиксацияОбъектовБКСобытия.УстановитьПрефиксИнформационнойБазы(Источник, СтандартнаяОбработка, Префикс);
КонецПроцедуры

Процедура си_ПриУстановкеНовогоНомераДокументаПриУстановкеНовогоНомера(Источник, СтандартнаяОбработка, Префикс) Экспорт
	//фин_ПрефиксацияОбъектовБКСобытия.УстановитьПрефиксИнформационнойБазыИОрганизации(Источник, СтандартнаяОбработка, Префикс);
	ПрефиксацияОбъектовБКСобытия.УстановитьПрефиксИнформационнойБазыИОрганизации(Источник, СтандартнаяОбработка, Префикс);
КонецПроцедуры

Процедура си_ПроверитьДатуЗапретаИзмененияПередЗаписьюНабораЗаписейПередЗаписью(Источник, Отказ, Замещение) Экспорт
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюНабораЗаписей(Источник, Отказ, Замещение);
КонецПроцедуры

Процедура си_ПроверитьДатуЗапретаИзмененияПередЗаписьюНабораЗаписейРегистраНакопленияПередЗаписью(Источник, Отказ, Замещение) Экспорт
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюНабораЗаписей(Источник, Отказ, Замещение);
КонецПроцедуры

Процедура си_ПроверитьДатуЗапретаПередЗаписьюДокументаПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(Источник, Отказ, РежимЗаписи, РежимПроведения);
КонецПроцедуры

Процедура си_ПроверитьНомерДокументаПоДатеИОрганизацииПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	//фин_ПрефиксацияОбъектовБКСобытия.ПроверитьНомерДокументаПоДатеИОрганизации(Источник, Отказ, РежимЗаписи, РежимПроведения);
	ПрефиксацияОбъектовБКСобытия.ПроверитьНомерДокументаПоДатеИОрганизации(Источник, Отказ, РежимЗаписи, РежимПроведения);
КонецПроцедуры

#КонецОбласти


