#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// Интерфейс для работы с подсистемой Печать.

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Производственная справка
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПроизводственнаяСправка";
	КомандаПечати.Представление = НСтр("ru = 'Производственная справка'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.ПроверкаПроведенияПередПечатью = НЕ ПользователиБКВызовСервераПовтИсп.РазрешитьПечатьНепроведенныхДокументов();
	КомандаПечати.Порядок = 50;
	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	// Печать Производственная справка
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПроизводственнаяСправка") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ПроизводственнаяСправка",
			НСтр("ru = 'Производственная справка'"),
			ПечатьДокумента(МассивОбъектов, ОбъектыПечати),
			,
			"Документ.ПроизводственнаяСправка.ПроизводственнаяСправка");
	КонецЕсли;
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// Подготовка табличных печатных документов.

Функция ПечатьДокумента(МассивОбъектов, ОбъектыПечати) Экспорт
	
	ТабДок = Новый ТабличныйДокумент;
	Макет  = УправлениеПечатью.МакетПечатнойФормы("Документ.ПроизводственнаяСправка.ПроизводственнаяСправка");
	
	// Заголовок
	Область = Макет.ПолучитьОбласть("Заголовок");
	Область.Параметры.ОписательПериода = МассивОбъектов[0].Дата;
	ТабДок.Вывести(Область);
	
	// ИнформацияПоПродукции
	Область = Макет.ПолучитьОбласть("ИнформацияПоСкважинамШапка");
	ТабДок.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть("ИнформацияПоСкважинам");
	Для Каждого ТекСтрокаИнформацияПоПродукции Из МассивОбъектов[0].ИнформацияПоПродукции Цикл
		Область.Параметры.Заполнить(ТекСтрокаИнформацияПоПродукции);
		
		Если ТекСтрокаИнформацияПоПродукции.ПризнакЗавершонности = Истина тогда
			Область.Параметры.ПризнакЗавершонности = "Завершена";
		Иначе
			Область.Параметры.ПризнакЗавершонности = "";
		КонецЕсли;
		
		Если  ТекСтрокаИнформацияПоПродукции.Принята = Истина тогда
			Область.Параметры.Принята = "Принята";
		Иначе
			Область.Параметры.Принята = "";
		КонецЕсли;
		 
		ТабДок.Вывести(Область);
	КонецЦикла;

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита          = Ложь;
	ТабДок.ТолькоПросмотр  = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;

	Возврат ТабДок;
	
КонецФункции // ПечатьДокумента()

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

#КонецЕсли
