#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	

	Если ВидРезерва = Перечисления.ВидыРезервов.ПоВознаграждениямРаботникам Тогда
		// проверим, чтобы не было в табличной части двух одинаковых видов расчета
		ТаблицаДляПроверки = БазовыеВидыРасчета.Выгрузить();
		
		ТаблицаДляПроверки.Колонки.Добавить("КоличествоВР");
		ТаблицаДляПроверки.ЗаполнитьЗначения(1, "КоличествоВР");
		ТаблицаДляПроверки.Свернуть("ВидРасчета", "КоличествоВР");
		
		Для Каждого СтрокаТЗ Из ТаблицаДляПроверки Цикл
			
			Если СтрокаТЗ.КоличествоВР > 1 Тогда
				ТекстСообщения = НСтр("ru='Вид расчета ""%1"" указан в качестве базового вида расчета %2 раз(а)'");
				
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, 
					СтрокаТЗ.ВидРасчета, СтрокаТЗ.КоличествоВР);
					
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,, "Объект", Отказ);
			
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры 

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

#КонецЕсли