#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

Процедура ВСПеренестиИзКодаВИдентификаторСклада() Экспорт
	
	Запрос 			= Новый Запрос;
	Запрос.Текст 	= 
	"ВЫБРАТЬ
	|	ВиртуальныеСклады.Ссылка КАК ВиртуальныйСклад,
	|	ВиртуальныеСклады.Код КАК Код
	|ИЗ
	|	Справочник.ВиртуальныеСклады КАК ВиртуальныеСклады
	|ГДЕ
	|	ВиртуальныеСклады.ЭтоГруппа = ЛОЖЬ
	|			И (ВиртуальныеСклады.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыВиртуальныхСкладов.НеСозданВС)
	|				ИЛИ ВиртуальныеСклады.ИдентификаторСклада ЕСТЬ NULL )";
	
	СправочникВиртуальныйСклад = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Склад Из СправочникВиртуальныйСклад Цикл
		
		ПолученныйВиртуальныйСклад = Склад.ВиртуальныйСклад.ПолучитьОбъект();
		ПолученныйВиртуальныйСклад.ИдентификаторСклада = Склад.Код;
		
		Попытка
			ПолученныйВиртуальныйСклад.Записать();
		Исключение
			ТекстСообщения = НСтр("ru='При записи справочника %1 произошла ошибка: %2'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ПолученныйВиртуальныйСклад, ОписаниеОшибки());
			ЗаписьЖурналаРегистрации(ТекстСообщения, УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
