#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	Если НЕ ЭтоГруппа И ПризнакОприходования Тогда
		СкладСПризнаком = СкладСПризнакомОприходования();
		Если СкладСПризнаком <> Неопределено Тогда
			Попытка
				ОбъектСклад = СкладСПризнаком.ПолучитьОбъект();
				ОбъектСклад.ПризнакОприходования = Ложь;
				ОбъектСклад.Записать();
				ТекстСообщения =  НСтр("ru = 'У склада %Склад1% снят ""Признак  оприходования товаров по ДТ"". Признак установлен у склада %Склад2%.'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Склад1%", СокрЛП(ОбъектСклад.Ссылка));
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Склад2%", СокрЛП(Ссылка));
				ЭСФКлиентСерверПереопределяемый.СообщитьПользователю(ТекстСообщения);

			Исключение
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Не удалось записать элемент справочника ""Виртуальные склады"".'"), 
				УровеньЖурналаРегистрации.Ошибка,,,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));				
			КонецПопытки;
			
			
			//Отказ = истина;
			//ТекстСообщения = НСтр("ru = 'Не удалось записать %1.
			//|В системе уже присутствует склад %2 с признаком оприходования.'");
			//ТекстСообщения = ЭСФКлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(ТекстСообщения,  Наименование, СкладСПризнаком);
			
			//ЭСФКлиентСерверПереопределяемый.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;		
	КонецЕсли;
	
	Если НЕ ЭтоГруппа И ЯвляетсяСкладомПоУмолчанию Тогда
		СкладСПризнакомПоУмолчанию = СкладСПризнакомЯвляетсяСкладомПоУмолчанию();
		
		Если СкладСПризнакомПоУмолчанию <> Неопределено Тогда
			Попытка
				ОбъектСклад = СкладСПризнакомПоУмолчанию.ПолучитьОбъект();
				ОбъектСклад.ЯвляетсяСкладомПоУмолчанию = Ложь;
				ОбъектСклад.Записать();	
				ТекстСообщения =  НСтр("ru = 'У склада %Склад1 снят признак ""Приоритетный склад"". Признак ""Приоритетный склад"" установлен у склада %Склад2.'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Склад1", СокрЛП(ОбъектСклад.Ссылка));
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Склад2", СокрЛП(Ссылка));
				ЭСФКлиентСерверПереопределяемый.СообщитьПользователю(ТекстСообщения);

			Исключение
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Не удалось записать элемент справочника ""Виртуальные склады"".'"), 
				УровеньЖурналаРегистрации.Ошибка,,,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));				
			КонецПопытки;

			//Отказ = истина;
			//ТекстСообщения = НСтр("ru = 'Не удалось записать %1.
			//|В системе уже присутствует склад %2 с признаком ""Является складом по умолчанию"".'");
			//ТекстСообщения = ЭСФКлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(ТекстСообщения,  Наименование, СкладСПризнакомПоУмолчанию);
			//
			//ЭСФКлиентСерверПереопределяемый.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СкладСПризнакомЯвляетсяСкладомПоУмолчанию()
	
	СкладСПризнакомПоУмолчанию = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВиртуальныеСклады.Ссылка
		|ИЗ
		|	Справочник.ВиртуальныеСклады КАК ВиртуальныеСклады
		|ГДЕ
		|	ВиртуальныеСклады.Организация = &Организация
		|	И НЕ ВиртуальныеСклады.Ссылка = &Ссылка
		|	И ВиртуальныеСклады.ЯвляетсяСкладомПоУмолчанию";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		 СкладСПризнакомПоУмолчанию = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат СкладСПризнакомПоУмолчанию;
	
КонецФункции

Функция СкладСПризнакомОприходования()
	СкладСПризнаком = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВиртуальныеСклады.Ссылка
		|ИЗ
		|	Справочник.ВиртуальныеСклады КАК ВиртуальныеСклады
		|ГДЕ
		|	ВиртуальныеСклады.Организация = &Организация
		|	И НЕ ВиртуальныеСклады.Ссылка = &Ссылка
		|	И ВиртуальныеСклады.ПризнакОприходования = ИСТИНА";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		 СкладСПризнаком = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат СкладСПризнаком 
КонецФункции

Процедура ПриКопировании(ОбъектКопирования)
	
	Если ЗначениеЗаполнено(ОбъектКопирования.ИдентификаторСклада) Тогда
		ИдентификаторСклада = Неопределено;
	КонецЕсли;

	Если ЗначениеЗаполнено(ОбъектКопирования.Статус) Тогда
		Статус = Перечисления.СтатусыВиртуальныхСкладов.НеСозданВС // по умолчанию новый документ имеет не создан
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли