
&НаКлиенте
Процедура ПодразделенияЦФОАгрегатПриИзменении(Элемент)
	Строка			= Элементы.ПодразделенияЦФО.ТекущиеДанные;
	Строка.Участок  = ЗначенияРеквизитовОбъекта(Строка.Агрегат, "Родитель").Родитель;
КонецПроцедуры

// Возвращает структуру, содержащую значения реквизитов прочитанные из информационной базы
// по ссылке на объект.
&НаСервере
Функция ЗначенияРеквизитовОбъекта(Ссылка, Знач Реквизиты) 
	
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, Реквизиты);
	
КонецФункции
