
#Область ПрограммныйИнтерфейс

Функция ОсновнойБанковскийСчетОрганизацииЗаполнен(Организация) Экспорт
	
	ОсновнойБанковскийСчет = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ОсновнойБанковскийСчет");
	
	Возврат ЗначениеЗаполнено(ОсновнойБанковскийСчет);
	
КонецФункции

Функция ОсновнаяКассаОрганизацииЗаполнена(Организация) Экспорт
	
	ОсновнаяКасса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ОсновнаяКасса");
	
	Возврат ЗначениеЗаполнено(ОсновнаяКасса);
	
КонецФункции

Функция СтрокаСообщенияНеЗаполненБанковскийСчет() Экспорт
	
	Возврат СтроковыеФункции.ФорматированнаяСтрока(НСтр("ru = 'Укажите основной банковский счет в <a href=""РеквизитыОрганизацииСсылка"">реквизитах организации</a>'"))
	
КонецФункции

Функция СтрокаСообщенияНеЗаполненаКасса() Экспорт
	
	Возврат СтроковыеФункции.ФорматированнаяСтрока(НСтр("ru = 'Укажите основную кассу в <a href=""РеквизитыОрганизацииСсылка"">реквизитах организации</a>'"))
	
КонецФункции

Функция СтрокаСообщенияНеЗаполненаКассаВОтчете() Экспорт
	
	Возврат СтроковыеФункции.ФорматированнаяСтрока(НСтр("ru = 'Укажите кассу в <a href=""РеквизитыОрганизацииСсылка"">реквизитах организации</a>'"))
	
КонецФункции

Процедура ОтобразитьПредупреждениеОЗаполненииРеквизитовСчета(Форма) Экспорт
	
	Если (ТипЗнч(Форма.Объект.Ссылка) = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") И НЕ Форма.Объект.ВидОперации = Перечисления.ВидыОперацийПКО.ПолучениеНаличныхДенежныхСредствВБанке)
		ИЛИ (ТипЗнч(Форма.Объект.Ссылка) = Тип("ДокументСсылка.РасходныйКассовыйОрдер") И НЕ Форма.Объект.ВидОперации = Перечисления.ВидыОперацийРКО.ВзносНаличнымиВБанк) Тогда
		Форма.Элементы.ПредупреждениеОЗаполненииРеквизитовСчета.Видимость = Ложь;
	Иначе
		Форма.Элементы.ПредупреждениеОЗаполненииРеквизитовСчета.Видимость = ПроверкаРеквизитовОрганизацииКлиентСервер.ПоказатьПредупреждениеОРеквизитахСчета(Форма, Форма.Объект.Организация);
	КонецЕсли;
		
КонецПроцедуры

Процедура ОтобразитьПредупреждениеОЗаполненииРеквизитовКассы(Форма) Экспорт
	
	Форма.Элементы.ПредупреждениеОЗаполненииРеквизитовКассы.Видимость = ПроверкаРеквизитовОрганизацииКлиентСервер.ПоказатьПредупреждениеОРеквизитахКассы(Форма, Форма.СтруктурноеПодразделениеОрганизация);
		
КонецПроцедуры

Процедура ОтобразитьПредупреждениеОЗаполненииРеквизитовКассыВОтчете(Форма, Объект) Экспорт
	
	Форма.Элементы.ПредупреждениеОЗаполненииРеквизитовКассы.Видимость = ПроверкаРеквизитовОрганизацииКлиентСервер.ПоказатьПредупреждениеОРеквизитахКассыВОтчете(Форма, Объект);
		
КонецПроцедуры

#КонецОбласти

