
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Источник = ПараметрыВыполненияКоманды.Источник;
	
	//Запишем изменения в форме
	Если ТипЗнч(Источник) = Тип("ФормаКлиентскогоПриложения") Тогда
		Источник.Записать();
	КонецЕсли;
	
	ИнтеграцияИСМПТККлиент.СверитьДокументыИСЦЭДМ(ПараметрКоманды, Новый Структура("ЗапускатьФоновоеЗадание", Ложь));
	ИнтеграцияИСМПТККлиент.ОповеститьФормы("ЦЭДМ_ОтправленыРезультатыСверки", ПараметрКоманды);
	
КонецПроцедуры
