
Процедура ОбработкаПроведения(Отказ, Режим)

	Если Не Отказ Тогда
		Движения.ПроизводственнаяСправкаПоОбъемам.Записывать = Истина;
		Для Каждого ТекСтрокаСправка Из Справка Цикл
			Если ТекСтрокаСправка.ПробуреноСкв <> 0 ИЛИ ТекСтрокаСправка.ПробуреноПМ <> 0 Тогда
				Движение = Движения.ПроизводственнаяСправкаПоОбъемам.Добавить();
				Движение.ВидДвижения           = ВидДвиженияНакопления.Приход;
				Движение.Период                = ПериодРегистрации; 
				Движение.Организация           = Организация;
				Движение.Участок               = ТекСтрокаСправка.Участок;
				Движение.Агрегат               = ТекСтрокаСправка.Агрегат;           
				Движение.Заказчик              = ТекСтрокаСправка.Заказчик;           
				Движение.УчастокПодразделение  = ТекСтрокаСправка.УчастокПодразделение;
				Движение.ВидСкважины           = ТекСтрокаСправка.ВидСкважины;
				Движение.СоответствиеАгрегатов = ТекСтрокаСправка.СоответствиеАгрегатов;
				Движение.ПробуреноСкв          = ТекСтрокаСправка.ПробуреноСкв;
				Движение.ПробуреноПМ           = ТекСтрокаСправка.ПробуреноПМ;  
				Движение.ВидыБурения           = ТекСтрокаСправка.ВидБурения;
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого ТекСтрокаСправка Из Справка Цикл
			Если ТекСтрокаСправка.АктированоСкв <> 0 ИЛИ ТекСтрокаСправка.АктированоПМ <> 0 Тогда
				Движение = Движения.ПроизводственнаяСправкаПоОбъемам.Добавить();
				Движение.ВидДвижения           = ВидДвиженияНакопления.Расход;
				Движение.Период                = ПериодРегистрации;
				Движение.Организация           = Организация;
				Движение.Участок               = ТекСтрокаСправка.Участок;
				Движение.Агрегат               = ТекСтрокаСправка.Агрегат;
				Движение.Заказчик              = ТекСтрокаСправка.Заказчик;           
				Движение.УчастокПодразделение  = ТекСтрокаСправка.УчастокПодразделение;
				Движение.ВидСкважины           = ТекСтрокаСправка.ВидСкважины;
				Движение.СоответствиеАгрегатов = ТекСтрокаСправка.СоответствиеАгрегатов;
				Движение.АктированоСкв         = ТекСтрокаСправка.АктированоСкв; 
				Движение.АктированоПМ          = ТекСтрокаСправка.АктированоПМ;
				Движение.ВидыБурения           = ТекСтрокаСправка.ВидБурения;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
