////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Работник", Работник);
	Параметры.Свойство("ИспользоватьОтборПоРаботнику", ИспользоватьОтборПоРаботнику);

	
	Если ЗначениеЗаполнено(Работник) И ИспользоватьОтборПоРаботнику Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		Список,	
		"МассивДокументов",
		?(ИспользоватьОтборПоРаботнику, ДокументыПоСотрудникуОрганизации(Работник), Новый Массив),
		ИспользоватьОтборПоРаботнику);	
		
	Иначе
		ОбщегоНазначенияБКВызовСервера.УстановитьОтборПоОсновнойОрганизации(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ СПИСОК

&НаСервере
Процедура СписокПередЗагрузкойПользовательскихНастроекНаСервере(Элемент, Настройки)
	
	ОбщегоНазначенияБККлиентСервер.ВосстановитьОтборСписка(Список, Настройки, "Организация");
	
КонецПроцедуры

&НаКлиенте
Процедура РаботникПриИзменении(Элемент)
	ИспользоватьОтборПоРаботнику = Истина;
	УстановитьОтборПоСотрудникуОрганизации();
КонецПроцедуры

// Возвращает массив всех документов, включенных в критерий отбора "ДокументыПоСотрудникуОрганизации", в которых присутствует переданное физическое лицо
//
// Параметры:
//		ФизическоеЛицо - Ссылка на физическое лицо
//
// Возвращаемое значение:
//		МассивДокументов - Массив документов по физическому лицу
//
&НаСервереБезКонтекста
Функция ДокументыПоСотрудникуОрганизации(СотрудникОрганизации) Экспорт
	
	МассивДокументов = Новый Массив;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СотрудникОрганизации", СотрудникОрганизации);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КритерийОтбораДокументыСотрудников.Ссылка
	|ИЗ
	|	КритерийОтбора.ДокументыПоСотрудникуОрганизации(&СотрудникОрганизации) КАК КритерийОтбораДокументыСотрудников";
	
	МассивДокументов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат МассивДокументов;
	
КонецФункции

&НаКлиенте
Процедура ИспользоватьОтборПоРаботникуПриИзменении(Элемент)
	УстановитьОтборПоСотрудникуОрганизации()
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоСотрудникуОрганизации()
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		Список,	
		"МассивДокументов",
		?(ИспользоватьОтборПоРаботнику, ДокументыПоСотрудникуОрганизации(Работник), Новый Массив),
		ИспользоватьОтборПоРаботнику);			
КонецПроцедуры


