
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокСвойств = "ОС, Товары, Услуги";
		
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры, СписокСвойств);
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура УстановитьВсе(Команда)

	ОС = Истина;
	Товары = Истина;
	Услуги = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)

	ОС = Ложь;
	Товары = Ложь;
	Услуги = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	ПараметрЗакрытия = Новый Структура;
	ПараметрЗакрытия.Вставить("ОС"    , ОС);
	ПараметрЗакрытия.Вставить("Товары", Товары);
	ПараметрЗакрытия.Вставить("Услуги", Услуги);
	
	Закрыть(ПараметрЗакрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть(Неопределено);
	
КонецПроцедуры


