////////////////////////////////////////////////////////////////////////////////
// КонтактнаяИнформация: содержит алгоритмы работы с контактной информацией, 
//   исполняемые на сервере, выполняется передача управления на сервер
//  
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

Функция ШаблоныТелефонныхНомеров() Экспорт
	
	Возврат КонтактнаяИнформацияВызовСервера.ШаблоныТелефонныхНомеров();
	
КонецФункции

// Функция определяет вид объекта контактной информации
//
// Параметры
//  ОбъектСсылка - Ссылка на объект контактной информации
// Возвращаемые значения
//  Возвращается ссылка на перечисление ВидыОбъектовКонтактнойИнформации,
//  соответствующее параметру ОбъектСсылка
Функция ВидОбъектаКИ(ОбъектСсылка) Экспорт

	Если ОбъектСсылка = Неопределено Тогда
		Возврат ПредопределенноеЗначение("Перечисление.ВидыОбъектовКонтактнойИнформации.ПустаяСсылка");
	ИначеЕсли ТипЗнч(ОбъектСсылка) = Тип("СправочникСсылка.Контрагенты") Тогда
		Возврат ПредопределенноеЗначение("Перечисление.ВидыОбъектовКонтактнойИнформации.Контрагенты");
	ИначеЕсли ТипЗнч(ОбъектСсылка) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		Возврат ПредопределенноеЗначение("Перечисление.ВидыОбъектовКонтактнойИнформации.ФизическиеЛица");
	ИначеЕсли ТипЗнч(ОбъектСсылка) = Тип("СправочникСсылка.Организации") ИЛИ ТипЗнч(ОбъектСсылка) = Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда
		Возврат ПредопределенноеЗначение("Перечисление.ВидыОбъектовКонтактнойИнформации.Организации");
	ИначеЕсли ТипЗнч(ОбъектСсылка) = Тип("СправочникСсылка.Пользователи") Тогда
		Возврат ПредопределенноеЗначение("Перечисление.ВидыОбъектовКонтактнойИнформации.Пользователи");
	ИначеЕсли ТипЗнч(ОбъектСсылка) = Тип("СправочникСсылка.КонтактныеЛица") Тогда
		Возврат ПредопределенноеЗначение("Перечисление.ВидыОбъектовКонтактнойИнформации.КонтактныеЛица");
	Иначе
		Возврат ПредопределенноеЗначение("Перечисление.ВидыОбъектовКонтактнойИнформации.ПустаяСсылка");
	КонецЕсли; 
	
КонецФункции

// Функция возвращает пустое значение определенного типа,
//  в соответствии с видом объекта контактной информации
//
// Параметры
//  ВидОбъектаКонтактнойИнформации - ПеречислениеСсылка.ВидыОбъектовКонтактнойИнформации
//
// Возвращаемое значение:
//   СправочникСсылка (пустая) или Неопределено
//
Функция ПолучитьПустоеЗначениеОбъектаКонтактнойИнформации(ВидОбъектаКонтактнойИнформации) Экспорт

	Если ВидОбъектаКонтактнойИнформации = ПредопределенноеЗначение("Перечисление.ВидыОбъектовКонтактнойИнформации.КонтактныеЛица") Тогда
		Возврат ПредопределенноеЗначение("Справочник.КонтактныеЛица.ПустаяСсылка");
	ИначеЕсли ВидОбъектаКонтактнойИнформации = ПредопределенноеЗначение("Перечисление.ВидыОбъектовКонтактнойИнформации.Контрагенты") Тогда
		Возврат ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
	ИначеЕсли ВидОбъектаКонтактнойИнформации = ПредопределенноеЗначение("Перечисление.ВидыОбъектовКонтактнойИнформации.Организации") Тогда
		Возврат ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка");
	ИначеЕсли ВидОбъектаКонтактнойИнформации = ПредопределенноеЗначение("Перечисление.ВидыОбъектовКонтактнойИнформации.Пользователи") Тогда
		Возврат ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
	ИначеЕсли ВидОбъектаКонтактнойИнформации = ПредопределенноеЗначение("Перечисление.ВидыОбъектовКонтактнойИнформации.ФизическиеЛица") Тогда
		Возврат ПредопределенноеЗначение("Справочник.ФизическиеЛица.ПустаяСсылка");
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции

Функция МассивТиповКонтактнойИнформации() Экспорт
	
	Возврат КонтактнаяИнформацияВызовСервера.МассивТиповКонтактнойИнформации();
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция ПолучитьИмяФормыРедактированияЗаписи(ТипКИ) Экспорт

	Если ТипКИ = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес") Тогда
		Возврат "Обработка.РедактированиеКонтактнойИнформации.Форма.ФормаЗаписиАдреса";
	ИначеЕсли ТипКИ = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты") Тогда
		Возврат "Обработка.РедактированиеКонтактнойИнформации.Форма.ФормаЗаписиАдресаЭП";
	ИначеЕсли ТипКИ = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.ВебСтраница") Тогда
		Возврат "Обработка.РедактированиеКонтактнойИнформации.Форма.ФормаЗаписиВебСтраницы";
	ИначеЕсли ТипКИ = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон") Тогда
		Возврат "Обработка.РедактированиеКонтактнойИнформации.Форма.ФормаЗаписиТелефона";
	Иначе
		Возврат "Обработка.РедактированиеКонтактнойИнформации.Форма.ФормаЗаписиПрочее";
	КонецЕсли;

КонецФункции

Функция ПроверитьИПолучитьОбъектКИОрганизации(ОбъектКИ) Экспорт
	Возврат КонтактнаяИнформацияВызовСервера.ПроверитьИПолучитьОбъектКИОрганизации(ОбъектКИ);
КонецФункции

Функция ПолучитьАдресныеСокращенияПоУровню(Уровень) Экспорт
	
	Возврат КонтактнаяИнформацияВызовСервера.ПолучитьАдресныеСокращенияПоУровню(Уровень);
	
КонецФункции