
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	Элементы.ПодключаемоеОборудование.Доступность = Не Объект.ИспользоватьБезПодключенияОборудования;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура ЭквайрерПриИзменении(Элемент)
	
	ДоговорВзаиморасчетовРеквизиты = ПолучитьЗначениеРеквизита(Объект.ДоговорВзаиморасчетов, "Владелец, ВидДоговора, ПометкаУдаления");
	
	Если ДоговорВзаиморасчетовРеквизиты.Владелец <> Объект.Эквайрер Тогда
		
		ЭквайрерРеквизиты = ПолучитьЗначениеРеквизита(Объект.Эквайрер, "ОсновнойДоговорКонтрагента");
		
		Объект.ДоговорВзаиморасчетов = ЭквайрерРеквизиты.ОсновнойДоговорКонтрагента;
		
		Если ЗначениеЗаполнено(Объект.ДоговорВзаиморасчетов)
			И (ДоговорВзаиморасчетовРеквизиты.ВидДоговора <> ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.Прочее")
			ИЛИ ДоговорВзаиморасчетовРеквизиты.ПометкаУдаления) Тогда
			Объект.ДоговорВзаиморасчетов = Неопределено;
		КонецЕсли;
	Иначе
		//Объект.ДоговорВзаиморасчетов = Объект.ДоговорВзаиморасчетов.Ссылка;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьБезПодключенияОборудованияПриИзменении(Элемент)
	
	Если Объект.ИспользоватьБезПодключенияОборудования Тогда
		Элементы.ПодключаемоеОборудование.Доступность = Ложь;
		Объект.ПодключаемоеОборудование = Неопределено;
	Иначе
		Элементы.ПодключаемоеОборудование.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ ТарифыЗаРасчетноеОбслуживание

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервереБезКонтекста
Функция ПолучитьЗначениеРеквизита(Ссылка, ИменаРеквизитов)
	
	Возврат ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Ссылка, ИменаРеквизитов);
	
КонецФункции

