
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Параметры.Свойство("СсылкаНаСотрудника",СсылкаНаСотрудника);
	Если Не ЗначениеЗаполнено(СсылкаНаСотрудника) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли; 
	СсылкаНаСотрудника = Параметры.СсылкаНаСотрудника;
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ОтражениеПлановыхНачислений, "Сотрудник", СсылкаНаСотрудника);

КонецПроцедуры

&НаКлиенте
Процедура История(Команда)
	
	СтруктураПараметров = Новый Структура("Сотрудник", СсылкаНаСотрудника);
	ОткрытьФорму("РегистрСведений.РеглУчетПлановыхНачисленийРаботниковОрганизаций.ФормаСписка", СтруктураПараметров, ЭтаФорма);

КонецПроцедуры
