#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)

	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ДОКУМЕНТА
	ПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	Если РучнаяКорректировка Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПроведения = Документы.си_ПогашениеСтоимостиМатериалов.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоБСО = си_УчетСпецодеждыСерверПовтИсп.ПроверкаНаБСО();
	Если ЭтоБСО Тогда
		ТаблицаВыработкаСотрудников = ПараметрыПроведения.ТаблицаВыработкаСотрудников;
	Иначе
		ТаблицаВыработкаСотрудников = Новый ТаблицаЗначений;
	КонецЕсли;
	
	си_УчетСпецодеждыСервер.СформироватьДвиженияАмортизацияСпецодеждыВЭксплуатации(ПараметрыПроведения.Реквизиты, ПараметрыПроведения.ТаблицаСпецодежда,ТаблицаВыработкаСотрудников,ПараметрыПроведения.ТаблицаВыработкаМатериалов, Движения, Отказ);
	си_УчетСпецодеждыСервер.СформироватьДвиженияАмортизацияСпецодеждыБУ(ПараметрыПроведения.Реквизиты,  ПараметрыПроведения.ТаблицаСпецодеждаБУ, ТаблицаВыработкаСотрудников,ПараметрыПроведения.ТаблицаВыработкаМатериалов,Движения, Отказ);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
		
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
		
	Если ДанныеЗаполнения <> Неопределено И ТипДанныхЗаполнения <> Тип("Структура") 
		И Метаданные().ВводитсяНаОсновании.Содержит(ДанныеЗаполнения.Метаданные()) Тогда
		//Документы.си_КорректировкаВыпускаСМР.ЗаполнитьПоДокументуОснованию(ЭтотОбъект, ДанныеЗаполнения);
		Возврат;
	КонецЕсли;
	
	общ_ПереопределяемыеПроцедурыБКСервер.ЗаполнитьШапкуДокумента(ЭтотОбъект, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	МассивНепроверяемыхРеквизитов = Новый Массив();
	НеобходимаПострочнаяПроверка = Истина;
	ПараметрыПострочнойПроверки = Новый Структура();
	си_ОбщегоНазначения.ИсключитьПроверку(ПроверяемыеРеквизиты,МассивНепроверяемыхРеквизитов);	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	си_ПогашениеСтоимостиМатериалов.Ссылка
		|ИЗ
		|	Документ.си_ПогашениеСтоимостиМатериалов КАК си_ПогашениеСтоимостиМатериалов
		|ГДЕ
		|	КОНЕЦПЕРИОДА(си_ПогашениеСтоимостиМатериалов.Дата,МЕСЯЦ) = КОНЕЦПЕРИОДА(&Дата,МЕСЯЦ)
		|	И си_ПогашениеСтоимостиМатериалов.Проведен
		|	И си_ПогашениеСтоимостиМатериалов.Ссылка<>&Ссылка
		|	И си_ПогашениеСтоимостиМатериалов.Организация = &Организация
		|	И си_ПогашениеСтоимостиМатериалов.СтруктурноеПодразделение = &СтруктурноеПодразделение";

	Запрос.УстановитьПараметр("Ссылка", 					Ссылка);
	Запрос.УстановитьПараметр("Дата", 						Дата);
	Запрос.УстановитьПараметр("Организация", 				Организация);
	Запрос.УстановитьПараметр("СтруктурноеПодразделение", 	СтруктурноеПодразделение);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОбщегоНазначения.СообщитьПользователю("По указанной структурной единице уже выполнено погашение стоимости материалов в за указанный месяц!",ЭтотОбъект,"Дата","Объект",Отказ);
	КонецЦикла;
	
	Если НеобходимаПострочнаяПроверка Тогда 

	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли