
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)         
	общ_ПереопределениеПроцедурБСПСервер.ФормаСпискаРегистра_ПриСозданииНаСервере(ЭтотОбъект,Отказ,СтандартнаяОбработка); 
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаСервере
Процедура СписокПередЗагрузкойПользовательскихНастроекНаСервере(Элемент, Настройки)
	общ_ПереопределениеПроцедурБСПСервер.ФормаСписка_СписокПередЗагрузкойПользовательскихНастроекНаСервере(ЭтотОбъект,Элемент, Настройки);
КонецПроцедуры

#КонецОбласти
