
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Источник = ПараметрыВыполненияКоманды.Источник;
	
	Если ТипЗнч(Источник) = ЭСФКлиентПереопределяемый.ПолучитьТипФормаКлиентскогоПриложения() Тогда
			
		Если Источник.ИмяФормы = "Документ.СНТ.Форма.ФормаДокумента" Тогда
			
			СНТКлиент.ПолучитьИдентификаторыТоваровСНТИзВС(ПараметрКоманды, Новый Структура("ЗапускатьФоновоеЗадание", Ложь));
			
		Иначе
			
			ИспользоватьФоновуюОтправкуСНТ = СНТКлиентСерверПереопределяемый.ИспользоватьФоновуюОтправкуСНТ();			
			
			ДополнительныеПараметры = Новый Структура("ЗапускатьФоновоеЗадание, КлючФормы", ИспользоватьФоновуюОтправкуСНТ, Источник.КлючУникальности);
			
			СНТКлиент.ПолучитьИдентификаторыТоваровСНТИзВС(ПараметрКоманды, ДополнительныеПараметры);
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры
