
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Источник = ПараметрыВыполненияКоманды.Источник;
	
	//Отправляем первую позицию массива
	МассивНовый = Новый Массив;
	Если ТипЗнч(ПараметрКоманды) = Тип("Массив") И ПараметрКоманды.Количество() <> 0 Тогда
		
		МассивНовый.Добавить(ПараметрКоманды[0]);

	КонецЕсли;
	
	Если ТипЗнч(Источник) = Тип("ФормаКлиентскогоПриложения") Тогда
		Если Источник.ИмяФормы = "Документ.УведомлениеОВводеВОборотИСЦЭДМ.Форма.ФормаДокумента" Тогда
			ИнтеграцияИСМПТККлиент.ОтправитьИсходящиеДокументыИСЦЭДМ(МассивНовый, Новый Структура("ЗапускатьФоновоеЗадание, Форма", Ложь, Источник));
		Иначе
			ИспользоватьФоновуюОтправкуДокументИСЦЭДМ = ОбщегоНазначенияИСМПТККлиентСерверПереопределяемый.ИспользоватьФоновуюОтправкуДокументовИСЦЭДМ();
			ДополнительныеПараметры = Новый Структура("ЗапускатьФоновоеЗадание, Форма", ИспользоватьФоновуюОтправкуДокументИСЦЭДМ, Источник);
			ИнтеграцияИСМПТККлиент.ОтправитьИсходящиеДокументыИСЦЭДМ(МассивНовый, ДополнительныеПараметры);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры