
#Область ПрограммныйИнтерфейс

// Вызывает процедуры доработки описания профилей
//
// Параметры:
//  ОписанияПрофилей	 - список ролей профиля 
//  ПараметрыОбновления	 - структура параметров обновления 
//
Процедура ДоработатьОписанияПрофилей(ОписанияПрофилей, ПараметрыОбновления) Экспорт
	Для Каждого ОписаниеПрофиля Из ОписанияПрофилей Цикл
		ДоработатьОписаниеПрофиля(ОписаниеПрофиля);
	КонецЦикла;
	ЗаполнитьПрофильУчетСпецодеждыИИнвентаря(ОписанияПрофилей);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДоработатьОписаниеПрофиля(ОписаниеПрофиля) 
	
	Если НЕ  ТипЗнч(ОписаниеПрофиля) = Тип("Структура") или  (ТипЗнч(ОписаниеПрофиля) = Тип("Структура") и НЕ ОписаниеПрофиля.Свойство("Роли")) Тогда
        Возврат;
    КонецЕсли;
	
	Если ТипЗнч(ОписаниеПрофиля) = Тип("Структура") и НЕ ОписаниеПрофиля.Свойство("Роли") Тогда
		Возврат;
	КонецЕсли;

	Если НЕ ТипЗнч(ОписаниеПрофиля.Роли) = Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Роль Из ОписаниеПрофиля.Роли Цикл
		Если Найти(Роль,"си_")=0 И Метаданные.Роли.Найти("си_"+Роль)<>Неопределено И ОписаниеПрофиля.Роли.Найти("си_"+Роль)=Неопределено Тогда
			ОписаниеПрофиля.Роли.Добавить("си_"+Роль);
		КонецЕсли;
	КонецЦикла;
	Если ОписаниеПрофиля.Имя="Бухгалтер" И ОписаниеПрофиля.Роли.Найти("си_ПодсистемаСпецодеждаИИнвентарь")=Неопределено Тогда
		ОписаниеПрофиля.Роли.Добавить("си_ПодсистемаСпецодеждаИИнвентарь");
	КонецЕсли;

	Если ОписаниеПрофиля.Имя="Только просмотр" И ОписаниеПрофиля.Роли.Найти("си_ПодсистемаСпецодеждаИИнвентарь")=Неопределено Тогда
		ОписаниеПрофиля.Роли.Добавить("си_ПодсистемаСпецодеждаИИнвентарь");
	КонецЕсли;
	
КонецПроцедуры


Процедура ЗаполнитьПрофильУчетСпецодеждыИИнвентаря(Знач ОписанияПрофилей) Экспорт
	
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "УчетСпецодеждыИИнвентаря";
	ОписаниеПрофиля.Идентификатор = "592e6c46-88e8-4f3b-9dc5-0a5123aa55a2"; // Произвольный уникальный идентификатор, присвоенный при разработке.
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Учет спецодежды и инвентаря (3.0)'", Метаданные.ОсновнойЯзык.КодЯзыка);
	ОписаниеПрофиля.Описание =
	НСтр("ru = ''",
	Метаданные.ОсновнойЯзык.КодЯзыка);
	
	// Виды доступные роли.			
	ОписаниеПрофиля.Роли.Добавить("си_ЗапускСЛК");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБСП");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБК");
	Если Метаданные.Роли.Найти("бсо_БазовыеПрава")<>Неопределено Тогда
		ОписаниеПрофиля.Роли.Добавить("бсо_БазовыеПрава");
	КонецЕсли;
	Если Метаданные.Роли.Найти("си_БазовыеПрава")<>Неопределено Тогда
		ОписаниеПрофиля.Роли.Добавить("си_БазовыеПрава");
	КонецЕсли;
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваИПП");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	ОписаниеПрофиля.Роли.Добавить("си_ДобавлениеИзменениеДанныхУчетаСпецодеждыИИнвентаря");
	ОписаниеПрофиля.Роли.Добавить("си_ПодсистемаСпецодеждаИИнвентарь");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОписанияИзмененийПрограммы");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрСвязанныеДокументы");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАдресныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВерсийОбъектов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхОтчетовИОбработок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииОВерсияхОбъектов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбменовДанными");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("си_ДобавлениеИзменениеНоменклатуры"); 
	ОписаниеПрофиля.Роли.Добавить("си_УправлениеСпецодеждой");
	
	// Виды ограничения доступа профиля.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ПодразделенияОрганизаций");	
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады");	
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыФизическихЛиц");	
	ДоработатьОписаниеПрофиля(ОписаниеПрофиля);
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);	
	
КонецПроцедуры

#КонецОбласти
