
#Область ДокументыИСМПТ

Функция ПолучитьСписокДокументовОснованияДляАктаПриемаПередачиИСМПТ(НаправлениеАкта, ВидОперации, Действие) Экспорт

	//ПЕРЕОПРЕДЕЛЕНИЕ//
	ДокументыВыбора = Новый СписокЗначений;
	
	Если НаправлениеАкта = ПредопределенноеЗначение("Перечисление.НаправленияДокументовИСМПТК.Исходящий") Тогда
		
		ДанныеДокумента = ОбщегоНазначенияИСМПТКВызовСервера.ПолучитьИмяИПредставлениеПоСсылке(ПредопределенноеЗначение("Документ.РеализацияТоваровУслуг.ПустаяСсылка"));
		ДокументыВыбора.Добавить(ДанныеДокумента.Имя, ДанныеДокумента.Синоним);
		
		ДанныеДокумента = ОбщегоНазначенияИСМПТКВызовСервера.ПолучитьИмяИПредставлениеПоСсылке(ПредопределенноеЗначение("Документ.ВозвратТоваровПоставщику.ПустаяСсылка"));
		ДокументыВыбора.Добавить(ДанныеДокумента.Имя, ДанныеДокумента.Синоним);
		
	Иначе

		ДанныеДокумента = ОбщегоНазначенияИСМПТКВызовСервера.ПолучитьИмяИПредставлениеПоСсылке(ПредопределенноеЗначение("Документ.ПоступлениеТоваровУслуг.ПустаяСсылка"));
		ДокументыВыбора.Добавить(ДанныеДокумента.Имя, ДанныеДокумента.Синоним);
		
		ДанныеДокумента = ОбщегоНазначенияИСМПТКВызовСервера.ПолучитьИмяИПредставлениеПоСсылке(ПредопределенноеЗначение("Документ.ВозвратТоваровОтПокупателя.ПустаяСсылка"));
		ДокументыВыбора.Добавить(ДанныеДокумента.Имя, ДанныеДокумента.Синоним);
					
	КонецЕсли;
	
	Возврат ДокументыВыбора;

	
КонецФункции

Функция ПолучитьСписокДокументовОснованияДляУведомленияОРасхожденииИСМПТ(ВидОперации = "", Действие = "") Экспорт
	
	ДокументыВыбора = Новый СписокЗначений;
	
	ДанныеДокумента = ОбщегоНазначенияИСМПТКВызовСервера.ПолучитьИмяИПредставлениеПоСсылке(ПредопределенноеЗначение("Документ.АктПриемаПередачиИСМПТК.ПустаяСсылка"));
	ДокументыВыбора.Добавить(ДанныеДокумента.Имя, ДанныеДокумента.Синоним);
									
	Возврат ДокументыВыбора;
	
КонецФункции

Функция ПолучитьСписокДокументовОснованияДляВводаВОборотИСМПТ(ВидОперации = "", Действие = "") Экспорт
	
	//ПЕРЕОПРЕДЕЛЕНИЕ//
	ДокументыВыбора = Новый СписокЗначений;
	
	ДанныеДокумента = ОбщегоНазначенияИСМПТКВызовСервера.ПолучитьИмяИПредставлениеПоСсылке(ПредопределенноеЗначение("Документ.ВозвратТоваровОтПокупателя.ПустаяСсылка"));
	ДокументыВыбора.Добавить(ДанныеДокумента.Имя, ДанныеДокумента.Синоним);
	
	ДанныеДокумента = ОбщегоНазначенияИСМПТКВызовСервера.ПолучитьИмяИПредставлениеПоСсылке(ПредопределенноеЗначение("Документ.ОприходованиеТоваров.ПустаяСсылка"));
	ДокументыВыбора.Добавить(ДанныеДокумента.Имя, ДанныеДокумента.Синоним);
				
	Возврат ДокументыВыбора;
	
КонецФункции

Функция ПолучитьСписокДокументовОснованияДляВыводаИзОборотаИСМПТ(ВидОперации = "", Действие = "") Экспорт
	
	//ПЕРЕОПРЕДЕЛЕНИЕ//
	ДокументыВыбора = Новый СписокЗначений;
	
	ДанныеДокумента = ОбщегоНазначенияИСМПТКВызовСервера.ПолучитьИмяИПредставлениеПоСсылке(ПредопределенноеЗначение("Документ.РеализацияТоваровУслуг.ПустаяСсылка"));
	ДокументыВыбора.Добавить(ДанныеДокумента.Имя, ДанныеДокумента.Синоним);
	
	ДанныеДокумента = ОбщегоНазначенияИСМПТКВызовСервера.ПолучитьИмяИПредставлениеПоСсылке(ПредопределенноеЗначение("Документ.СписаниеТоваров.ПустаяСсылка"));
	ДокументыВыбора.Добавить(ДанныеДокумента.Имя, ДанныеДокумента.Синоним);
	
	ДанныеДокумента = ОбщегоНазначенияИСМПТКВызовСервера.ПолучитьИмяИПредставлениеПоСсылке(ПредопределенноеЗначение("Документ.ТребованиеНакладная.ПустаяСсылка"));
	ДокументыВыбора.Добавить(ДанныеДокумента.Имя, ДанныеДокумента.Синоним);
	
	Возврат ДокументыВыбора;
	
КонецФункции

Функция ПолучитьСписокДокументовОснованияУведомленияОВвозеИСМПТ(ВидОперации = "", Действие = "") Экспорт
	
	//ПЕРЕОПРЕДЕЛЕНИЕ//
	ДокументыВыбора = Новый СписокЗначений;
	
	ДанныеДокумента = ОбщегоНазначенияИСМПТКВызовСервера.ПолучитьИмяИПредставлениеПоСсылке(ПредопределенноеЗначение("Документ.ПоступлениеТоваровУслуг.ПустаяСсылка"));
	ДокументыВыбора.Добавить(ДанныеДокумента.Имя, ДанныеДокумента.Синоним);
									
	Возврат ДокументыВыбора;
	
КонецФункции

Функция ПолучитьСписокДокументовОснованияУведомленияОбЭкспортеИСМПТ(ВидОперации = "", Действие = "") Экспорт
	
	//ПЕРЕОПРЕДЕЛЕНИЕ//
	ДокументыВыбора = Новый СписокЗначений;
	
	ДанныеДокумента = ОбщегоНазначенияИСМПТКВызовСервера.ПолучитьИмяИПредставлениеПоСсылке(ПредопределенноеЗначение("Документ.РеализацияТоваровУслуг.ПустаяСсылка"));
	ДокументыВыбора.Добавить(ДанныеДокумента.Имя, ДанныеДокумента.Синоним);
									
	Возврат ДокументыВыбора;
	
КонецФункции

Функция ПолучитьСписокДокументовОснованияДляАгрегацииКМИСМПТК(ВидОперации = "", Действие = "") Экспорт
	
	ДокументыВыбора = Новый СписокЗначений;
	
	Возврат ДокументыВыбора;
	
КонецФункции

#КонецОбласти

#Область ДокументыСУЗ

Функция ПолучитьСписокДокументовОснованияДляНанесенияКМ() Экспорт
	
	ДокументыВыбора = Новый СписокЗначений;
	
	ДанныеДокумента = ОбщегоНазначенияИСМПТКВызовСервера.ПолучитьИмяИПредставлениеПоСсылке(ПредопределенноеЗначение("Документ.ЗаказКодовМаркировкиСУЗИСМПТК.ПустаяСсылка"));
	ДокументыВыбора.Добавить(ДанныеДокумента.Имя, ДанныеДокумента.Синоним);
									
	Возврат ДокументыВыбора;
	
КонецФункции

Функция ПолучитьСписокДокументовОснованияДляЗаказаКМ() Экспорт
	
	//ПЕРЕОПРЕДЕЛЕНИЕ//
	ДокументыВыбора = Новый СписокЗначений;
	
	Возврат ДокументыВыбора;
	
КонецФункции

#КонецОбласти

#Область ДокументыИСЦЭДМ

Функция ПолучитьСписокДокументовОснованияДляАктаПриемаПередачиИСЦЭДМ(НаправлениеАкта, ВидОперации, Действие) Экспорт
	
	//ПЕРЕОПРЕДЕЛЕНИЕ//
	ДокументыВыбора = Новый СписокЗначений;
	
	Если НаправлениеАкта = ПредопределенноеЗначение("Перечисление.НаправленияДокументовИСМПТК.Исходящий") Тогда
		
		ДанныеДокумента = ОбщегоНазначенияИСМПТКВызовСервера.ПолучитьИмяИПредставлениеПоСсылке(ПредопределенноеЗначение("Документ.РеализацияТоваровУслуг.ПустаяСсылка"));
		ДокументыВыбора.Добавить(ДанныеДокумента.Имя, ДанныеДокумента.Синоним);
		
		ДанныеДокумента = ОбщегоНазначенияИСМПТКВызовСервера.ПолучитьИмяИПредставлениеПоСсылке(ПредопределенноеЗначение("Документ.ВозвратТоваровПоставщику.ПустаяСсылка"));
		ДокументыВыбора.Добавить(ДанныеДокумента.Имя, ДанныеДокумента.Синоним);
		
	Иначе

		ДанныеДокумента = ОбщегоНазначенияИСМПТКВызовСервера.ПолучитьИмяИПредставлениеПоСсылке(ПредопределенноеЗначение("Документ.ПоступлениеТоваровУслуг.ПустаяСсылка"));
		ДокументыВыбора.Добавить(ДанныеДокумента.Имя, ДанныеДокумента.Синоним);
		
		ДанныеДокумента = ОбщегоНазначенияИСМПТКВызовСервера.ПолучитьИмяИПредставлениеПоСсылке(ПредопределенноеЗначение("Документ.ВозвратТоваровОтПокупателя.ПустаяСсылка"));
		ДокументыВыбора.Добавить(ДанныеДокумента.Имя, ДанныеДокумента.Синоним);
					
	КонецЕсли;
	
	Возврат ДокументыВыбора;
	
КонецФункции

Функция ПолучитьСписокДокументовОснованияДляВводаВОборотИСЦЭДМ(ВидОперации = "", Действие = "") Экспорт
	
	//ПЕРЕОПРЕДЕЛЕНИЕ//
	ДокументыВыбора = Новый СписокЗначений;

	ДанныеДокумента = ОбщегоНазначенияИСМПТКВызовСервера.ПолучитьИмяИПредставлениеПоСсылке(ПредопределенноеЗначение("Документ.ВозвратТоваровОтПокупателя.ПустаяСсылка"));
	ДокументыВыбора.Добавить(ДанныеДокумента.Имя, ДанныеДокумента.Синоним);
	
	ДанныеДокумента = ОбщегоНазначенияИСМПТКВызовСервера.ПолучитьИмяИПредставлениеПоСсылке(ПредопределенноеЗначение("Документ.ОприходованиеТоваров.ПустаяСсылка"));
	ДокументыВыбора.Добавить(ДанныеДокумента.Имя, ДанныеДокумента.Синоним);
	
	Возврат ДокументыВыбора;
	
КонецФункции

Функция ПолучитьСписокДокументовОснованияДляВыводаИзОборотаИСЦЭДМ(ВидОперации = "", Действие = "") Экспорт
	
	//ПЕРЕОПРЕДЕЛЕНИЕ//
	ДокументыВыбора = Новый СписокЗначений;
	
	ДанныеДокумента = ОбщегоНазначенияИСМПТКВызовСервера.ПолучитьИмяИПредставлениеПоСсылке(ПредопределенноеЗначение("Документ.РеализацияТоваровУслуг.ПустаяСсылка"));
	ДокументыВыбора.Добавить(ДанныеДокумента.Имя, ДанныеДокумента.Синоним);
	
	ДанныеДокумента = ОбщегоНазначенияИСМПТКВызовСервера.ПолучитьИмяИПредставлениеПоСсылке(ПредопределенноеЗначение("Документ.СписаниеТоваров.ПустаяСсылка"));
	ДокументыВыбора.Добавить(ДанныеДокумента.Имя, ДанныеДокумента.Синоним);
	
	ДанныеДокумента = ОбщегоНазначенияИСМПТКВызовСервера.ПолучитьИмяИПредставлениеПоСсылке(ПредопределенноеЗначение("Документ.ТребованиеНакладная.ПустаяСсылка"));
	ДокументыВыбора.Добавить(ДанныеДокумента.Имя, ДанныеДокумента.Синоним);
	
	Возврат ДокументыВыбора;
	
КонецФункции

Функция ПолучитьСписокДокументовОснованияДляАгрегацииВнеПроизводстваИСЦЭДМ(ВидОперации = "", Действие = "") Экспорт
	
	ДокументыВыбора = Новый СписокЗначений;
	
	Возврат ДокументыВыбора;
	
КонецФункции

Функция ПолучитьСписокДокументовОснованияДляАктаВнутреннегоПеремещенияИСЦЭДМ(ВидОперации = "", Действие = "") Экспорт
	
	//ПЕРЕОПРЕДЕЛЕНИЕ//
	ДокументыВыбора = Новый СписокЗначений;
	
	ДанныеДокумента = ОбщегоНазначенияИСМПТКВызовСервера.ПолучитьИмяИПредставлениеПоСсылке(ПредопределенноеЗначение("Документ.ПеремещениеТоваров.ПустаяСсылка"));
	ДокументыВыбора.Добавить(ДанныеДокумента.Имя, ДанныеДокумента.Синоним);
		
	Возврат ДокументыВыбора;
	
КонецФункции

Функция ПолучитьСписокДокументовОснованияДляУведомленияОВвозеЕАЭСИСЦЭДМ(ВидОперации = "", Действие = "") Экспорт
	
	//ПЕРЕОПРЕДЕЛЕНИЕ//
	ДокументыВыбора = Новый СписокЗначений;
	
	ДанныеДокумента = ОбщегоНазначенияИСМПТКВызовСервера.ПолучитьИмяИПредставлениеПоСсылке(ПредопределенноеЗначение("Документ.ПоступлениеТоваровУслуг.ПустаяСсылка"));
	ДокументыВыбора.Добавить(ДанныеДокумента.Имя, ДанныеДокумента.Синоним);
									
	Возврат ДокументыВыбора;
	
КонецФункции

Функция ПолучитьСписокДокументовОснованияДляДляУведомленияОВвозеИмпортИСЦЭДМ(ВидОперации = "", Действие = "") Экспорт
	
	//ПЕРЕОПРЕДЕЛЕНИЕ//
	ДокументыВыбора = Новый СписокЗначений;
	
	ДанныеДокумента = ОбщегоНазначенияИСМПТКВызовСервера.ПолучитьИмяИПредставлениеПоСсылке(ПредопределенноеЗначение("Документ.ПоступлениеТоваровУслуг.ПустаяСсылка"));
	ДокументыВыбора.Добавить(ДанныеДокумента.Имя, ДанныеДокумента.Синоним);
										
	Возврат ДокументыВыбора;
	
КонецФункции

#КонецОбласти
