
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("ОтборСчетКт") Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ОтборСчетКт", Параметры.ОтборСчетКт);
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Типовой.Ссылка
			|ИЗ
			|	ПланСчетов.Типовой КАК Типовой
			|ГДЕ
			|	Типовой.Ссылка В ИЕРАРХИИ(&ОтборСчетКт)";
			
		МассивСчетов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		МассивСчетов.Добавить(ПланыСчетов.Типовой.ПустаяСсылка());
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "СчетКт", МассивСчетов, ВидСравненияКомпоновкиДанных.ВСписке);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
