
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	//ПараметрыОткрытия = ОбщегоНазначенияБККлиентСервер.ПараметрыОткрытияФормыСОжиданием(ПараметрыВыполненияКоманды);
	//ПараметрыОткрытия.Заголовок = НСтр("ru = 'Банковские счета'");
	//ПараметрыОткрытия.ИмяФормы = "Справочник.БанковскиеСчета.ФормаСписка";

	//Отбор = Новый Структура("Владелец", ПараметрКоманды);
	//ПараметрыФормы = Новый Структура("Отбор", Отбор);
	//
	//ОбщегоНазначенияБПКлиент.ОткрытьФормуСОжиданием(ПараметрыОткрытия, ПараметрыФормы);
	
КонецПроцедуры
