////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.Ставка.Доступность = НЕ  (Объект.ДляОсвобожденногоОборота ИЛИ Объект.МестоРеализацииНеРК);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура СтавкаПриИзменении(Элемент)
	
	Объект.Наименование = "";
	СформироватьНаименование();
	
КонецПроцедуры

&НаКлиенте
Процедура ДляОсвобожденногоОборотаПриИзменении(Элемент)
	
	Если Объект.ДляОсвобожденногоОборота Тогда
		Объект.Ставка = 0;
		Объект.МестоРеализацииНеРК = Ложь;
	КонецЕсли;
	
	Элементы.Ставка.Доступность = НЕ (Объект.ДляОсвобожденногоОборота ИЛИ Объект.МестоРеализацииНеРК);
	
	Объект.Наименование = "";
	СформироватьНаименование();

КонецПроцедуры

&НаКлиенте
Процедура МестоРеализацииНеРКПриИзменении(Элемент)
	
	Если Объект.МестоРеализацииНеРК Тогда
		Объект.Ставка = 0;
		Объект.ДляОсвобожденногоОборота = Ложь;
	КонецЕсли;
	
	Элементы.Ставка.Доступность = НЕ (Объект.ДляОсвобожденногоОборота ИЛИ Объект.МестоРеализацииНеРК);
	
	Объект.Наименование = "";
	СформироватьНаименование();

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Процедура проверяет, необходимо ли сформировать новое наименование справочника 
// и, если необходимо, формирует его.
//
// Параметры:
//  Нет.
//
&НаКлиенте
Процедура СформироватьНаименование()
	
	Если  ПустаяСтрока(Объект.Наименование) Тогда
		
		Если Объект.ДляОсвобожденногоОборота Тогда
			Объект.Наименование = НСтр("ru = 'без НДС'", ОбщегоНазначенияКлиент.КодОсновногоЯзыка());
		ИначеЕсли Объект.МестоРеализацииНеРК Тогда
			Объект.Наименование = НСтр("ru = 'без НДС - не РК'", ОбщегоНазначенияКлиент.КодОсновногоЯзыка());
		Иначе
			Объект.Наименование = Строка(Объект.Ставка)+"%";
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // СформироватьНаименованиеПолноеАвтоматически()

