#Область ПрограммныйИнтерфейс

#Область ПечатьШтрихкодов

Функция ДанныеДляПечатиШтрихкодовОС(Идентификатор, ОбъектыПечати, ДополнительныеПараметры) Экспорт
	Если ТипЗнч(ОбъектыПечати[0]) = Тип("СправочникСсылка.ОсновныеСредства") Тогда
		Возврат Справочники.ОсновныеСредства.ДанныеДляПечатиШтрихкодовОС(ОбъектыПечати, ДополнительныеПараметры);	
	Иначе	
		Возврат Документы[ОбъектыПечати[0].Метаданные().Имя].ДанныеДляПечатиШтрихкодовОС(ОбъектыПечати);	
	КонецЕсли;	
КонецФункции

Функция ДанныеДляПечатиШтрихкодовНоменклатуры(Идентификатор, ОбъектыПечати) Экспорт
	Если ТипЗнч(ОбъектыПечати[0]) = Тип("СправочникСсылка.Номенклатура") Тогда
		Возврат Справочники.Номенклатура.ДанныеДляПечатиШтрихкодовНоменклатуры(ОбъектыПечати);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

#КонецОбласти

#КонецОбласти