////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура НазначениеКатегорииПриИзменении(Элемент)
	
	ВозможноИзменитьНазначениеКатегории = Истина;
	ТекстПредупреждения = "";
	СтароеНазначениеКатегории = Неопределено;	
	ПроверитьВозможностьИзмененияНазначенияКатегории(ВозможноИзменитьНазначениеКатегории, ТекстПредупреждения, СтароеНазначениеКатегории);	
	
	Если НЕ ВозможноИзменитьНазначениеКатегории Тогда
		Объект.НазначениеКатегории = СтароеНазначениеКатегории;
		ПоказатьПредупреждение(,ТекстПредупреждения);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьВозможностьИзмененияНазначенияКатегории(ВозможноИзменить, ТекстПредупреждения, СтароеНазначениеКатегории)
	
	ОбъектКатерияОбъектов = РеквизитФормыВЗначение("Объект");
	
	СтароеНазначениеКатегории = Объект.Ссылка.НазначениеКатегории;
	
	Если НЕ Объект.Ссылка.Пустая()
		И Объект.НазначениеКатегории <> СтароеНазначениеКатегории
		И ОбъектКатерияОбъектов.СуществуютСсылки() Тогда
		
		ВозможноИзменить = Ложь;
		
		ТекстПредупреждения = НСтр(
		"ru = 'Существуют объекты, которым назначена категория ""%1"".
		|Назначение категории не может быть изменено.'");
		
		ТекстПредупреждения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстПредупреждения, СокрЛП(Объект.Наименование));
		
	КонецЕсли;
	
КонецПроцедуры