
Процедура Автозаполнение(Объект, ЭтотОбъект, ПоддержкаРаботыСоСтруктурнымиПодразделениями, МассивСотрудников = Неопределено) Экспорт
	
	Заполнен = Ложь;
	Если ЗначениеЗаполнено(Объект.Организация) И НЕ ЗначениеЗаполнено(Объект.ПодразделениеОрганизации) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РаботникиОрганизаций.Сотрудник КАК Сотрудник,
		|	ПриемНаРаботуВОрганизацию.Ссылка КАК Ссылка
		|ИЗ
		|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриемНаРаботуВОрганизацию КАК ПриемНаРаботуВОрганизацию
		|		ПО РаботникиОрганизаций.Регистратор = ПриемНаРаботуВОрганизацию.Ссылка
		|ГДЕ
		|	РаботникиОрганизаций.Организация = &Организация
		|	И НЕ ПриемНаРаботуВОрганизацию.Ссылка ЕСТЬ NULL";
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ВыборкаДетальныеЗаписи.Сотрудник.ДатаУвольнения > Объект.Дата Тогда
				Продолжить;
			Иначе
				НоваяСтрока = Объект.РаботникиОрганизации.Добавить();
				НоваяСтрока.ФизЛицо = ВыборкаДетальныеЗаписи.Сотрудник.Ссылка.ФизЛицо;
				НоваяСтрока.Должность = ВыборкаДетальныеЗаписи.Сотрудник.ТекущаяДолжностьОрганизации;
				НоваяСтрока.Подразделение = ВыборкаДетальныеЗаписи.Сотрудник.ТекущееПодразделениеОрганизации;
				НоваяСтрока.КодСотрудника = ВыборкаДетальныеЗаписи.Сотрудник.Код;
				НоваяСтрока.Приказ = ВыборкаДетальныеЗаписи.Ссылка;
				
				Заполнен = Истина;
			КонецЕсли;	
		КонецЦикла;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Организация) И ЗначениеЗаполнено(Объект.ПодразделениеОрганизации) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РаботникиОрганизаций.Сотрудник КАК Сотрудник,
		|	ПриемНаРаботуВОрганизацию.Ссылка КАК Ссылка
		|ИЗ
		|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриемНаРаботуВОрганизацию КАК ПриемНаРаботуВОрганизацию
		|		ПО РаботникиОрганизаций.Регистратор = ПриемНаРаботуВОрганизацию.Ссылка
		|ГДЕ
		|	РаботникиОрганизаций.Организация = &Организация
		|	И РаботникиОрганизаций.Сотрудник.ТекущееПодразделениеОрганизации = &ПодразделениеОрганизации
		|	И НЕ ПриемНаРаботуВОрганизацию.Ссылка ЕСТЬ NULL";
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
		Запрос.УстановитьПараметр("ПодразделениеОрганизации", Объект.ПодразделениеОрганизации);
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ВыборкаДетальныеЗаписи.Сотрудник.ДатаУвольнения > Объект.Дата Тогда
				Продолжить;
			Иначе
				НоваяСтрока = Объект.РаботникиОрганизации.Добавить();
				НоваяСтрока.ФизЛицо = ВыборкаДетальныеЗаписи.Сотрудник.Ссылка.ФизЛицо;
				НоваяСтрока.Должность = ВыборкаДетальныеЗаписи.Сотрудник.ТекущаяДолжностьОрганизации;
				НоваяСтрока.Подразделение = ВыборкаДетальныеЗаписи.Сотрудник.ТекущееПодразделениеОрганизации;
				НоваяСтрока.КодСотрудника = ВыборкаДетальныеЗаписи.Сотрудник.Код;
				НоваяСтрока.Приказ = ВыборкаДетальныеЗаписи.Ссылка;
				
				Заполнен = Истина;
			КонецЕсли;	
		КонецЦикла;
	КонецЕсли;
	
	Если Не Заполнен Тогда
		Сообщить("Не обнаружены данные для записи в табличную часть документа!");
	КонецЕсли;
	
КонецПроцедуры
