
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокСвойств = "СписокСчетовБУПрочихРазделов";
		
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры, СписокСвойств);
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ <ИМЯ ТАБЛИЦЫ ФОРМЫ>

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	УстановитьПометкуВСтрокахТабличнойЧасти(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	УстановитьПометкуВСтрокахТабличнойЧасти(Ложь);

КонецПроцедуры

&НаКлиенте
Процедура КомандаОК(Команда)
	
	//СписокСчетовБУПрочихРазделов.Очистить();
	//
	//Для Каждого Строка Из СписокСчетов Цикл
	//	Если Строка.Пометка Тогда
	//		СписокСчетовБУПрочихРазделов.Добавить(Строка.Значение);
	//	КонецЕсли;
	//КонецЦикла;
	
	ПараметрЗакрытия = Новый Структура;
	
	//ПараметрЗакрытия.Вставить("СписокСчетовРазделаБУ" , СписокСчетовБУПрочихРазделов);
	ПараметрЗакрытия.Вставить("СписокСчетовБУПрочихРазделов" , СписокСчетовБУПрочихРазделов);

	Закрыть(ПараметрЗакрытия);

КонецПроцедуры

&НаКлиенте
Процедура КомандаОтмена(Команда)
	
	Закрыть(Неопределено);

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура УстановитьПометкуВСтрокахТабличнойЧасти(НоваяПометка)

	СписокСчетовБУПрочихРазделов.ЗаполнитьПометки(НоваяПометка);
	
КонецПроцедуры

