
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.УчастникТаможенногоСоюза) Тогда
		ЯвляетсяУчастникомТаможенногоСоюза = Истина;	
	КонецЕсли; 
	
	УправлениеФормой(ЭтаФорма);
	
	УстановитьДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Оповестить("ЗакрытьФормуКлассификатора",, ВладелецФормы);
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура ЯвляетсяУчастникомТаможенногоСоюзаПриИзменении(Элемент)
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)

	Объект   = Форма.Объект;
	Элементы = Форма.Элементы;
	
	Элементы.УчастникТаможенногоСоюза.Доступность = Форма.ЯвляетсяУчастникомТаможенногоСоюза;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЭлементов()
	
	Элементы.ЯвляетсяУчастникомТаможенногоСоюза.Доступность = РольДоступна("ДобавлениеИзменениеОбщейБухгалтерскойНСИ") 
																ИЛИ РольДоступна("ДобавлениеИзменениеДанныхБухгалтерии") 
																ИЛИ Пользователи.ЭтоПолноправныйПользователь();

КонецПроцедуры
