#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПриЗаписи()

	// ЭлектронныеСчетаФактуры
	ОбновитьПовторноИспользуемыеЗначения();
	// Конец ЭлектронныеСчетаФактуры
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Если курс на 1 января 1980 не задан, установим его.
	ОбщегоНазначенияБК.ПроверитьКорректностьКурсаНа01_01_1980(Ссылка);
    	
КонецПроцедуры

#КонецЕсли