////////////////////////////////////////////////////////////////////////////////
// Получение внешней или встроенной обработки "ОбменСНТ"

#Область РаботаСВнешнейОбработкой

// См. СНТСерверПовтИсп.ИспользоватьВнешнююОбработку()
Функция ИспользоватьВнешнююОбработку() Экспорт
	
	Возврат ПравоДоступа("Чтение", Метаданные.Константы.СНТИспользоватьВнешнийМодульОбменаДанными)
		И ПравоДоступа("Чтение", Метаданные.Константы.СНТВнешнийМодульОбменаДанными)
		И Константы.СНТИспользоватьВнешнийМодульОбменаДанными.Получить();
	
КонецФункции
	
Функция ПодключитьВнешнююОбработку() Экспорт
		
	ДвоичныеДанныеОбработки = Константы.СНТВнешнийМодульОбменаДанными.Получить().Получить();
	ИмяОбработки_ОбменСНТ = Неопределено;
	Если ДвоичныеДанныеОбработки <> Неопределено Тогда
		
		Адрес = ПоместитьВоВременноеХранилище(ДвоичныеДанныеОбработки);
		Попытка
			ИмяОбработки_ОбменСНТ = ВнешниеОбработки.Подключить(Адрес, СНТКлиентСервер.ИмяВнешнейОбработкиОбменСНТ(), Ложь);
		Исключение
			Текст = НСтр("ru='Не удалось загрузить внешний модуль для обмена СНТ: %1 . Будет использован модуль, встроенный в конфигурацию.'");
			ТекстСообщения = СтрШаблон(Текст, ИнформацияОбОшибке().Описание);	
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);			
		КонецПопытки;
	КонецЕсли;
	
	Возврат ИмяОбработки_ОбменСНТ;
	
КонецФункции

Функция СоздатьВнешнююОбработкуИзФайла() Экспорт

	Возврат Неопределено;
	
КонецФункции

// См. СНТСерверПовтИсп.ОбработкаОбменСНТ()
Функция ОбработкаОбменСНТ() Экспорт
	
	Если ИспользоватьВнешнююОбработку() Тогда
		Возврат НовыйЭкземплярВнешнейОбработкиОбменСНТ();	
	Иначе
		Возврат Обработки.ОбменСНТ.Создать();	
	КонецЕсли;
	
КонецФункции

// См. ЭСФСерверПовтИсп.НовыйЭкземплярВнешнейОбработкиОбменЭСФ()
Функция НовыйЭкземплярВнешнейОбработкиОбменСНТ() Экспорт
	
	ИмяВнешнейОбработки = ПодключитьВнешнююОбработку();
	ВнешняяОбработкаОбменСНТ = Неопределено;
	Если ИмяВнешнейОбработки <> Неопределено Тогда
		ВнешняяОбработкаОбменСНТ = ВнешниеОбработки.Создать(ИмяВнешнейОбработки);
	КонецЕсли;
	
	Возврат ВнешняяОбработкаОбменСНТ;
	
КонецФункции

#КонецОбласти

#Область РаботаСФоновымиЗаданиями

Функция ВыполнитьВФоне(Знач ИмяЭкспортнойПроцедуры, Знач ПараметрыПроцедуры, Знач ПараметрыВыполнения) Экспорт
	
	// Код вынесен в переопределяемый модуль, процедуры запуска фонового задания должна передавать КлючЗадания - ПараметрыВыполнения.УникальныйИдентификатор
	АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено, ПараметрыВыполнения.ИдентификаторФормы);
	НаименованиеЗадания = ПараметрыВыполнения.НаименованиеФоновогоЗадания;
	
	Если Не ЗначениеЗаполнено(НаименованиеЗадания) Тогда
		НаименованиеЗадания = ИмяЭкспортнойПроцедуры;
	КонецЕсли;
	
	ПараметрыЭкспортнойПроцедуры = Новый Массив;
	ПараметрыЭкспортнойПроцедуры.Добавить(ПараметрыПроцедуры);
	ПараметрыЭкспортнойПроцедуры.Добавить(АдресХранилища);
	
	ПараметрыЗадания = Новый Массив;
	ПараметрыЗадания.Добавить(ИмяЭкспортнойПроцедуры);
	ПараметрыЗадания.Добавить(ПараметрыЭкспортнойПроцедуры);
	
	ПараметрыЗадания.Добавить(Неопределено);
	Задание = ФоновыеЗадания.Выполнить(ИмяЭкспортнойПроцедуры, ПараметрыЭкспортнойПроцедуры, ПараметрыВыполнения.КлючФоновогоЗадания, НаименованиеЗадания);
	Попытка
		Задание.ОжидатьЗавершения(ПараметрыВыполнения.ОжидатьЗавершение);
	Исключение		
		// Специальная обработка не требуется, возможно исключение вызвано истечением времени ожидания.
	КонецПопытки;
	
	Результат = Новый Структура;
	Результат.Вставить("АдресХранилища",       АдресХранилища);
	Результат.Вставить("ЗаданиеВыполнено",     ДлительныеОперации.ЗаданиеВыполнено(Задание.УникальныйИдентификатор));
	Результат.Вставить("ИдентификаторЗадания", Задание.УникальныйИдентификатор);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ЗапросыПоПриходнымРасходнымДокументам
Функция ТекстЗапросаРеализацияТоваровУслуг(ПервыйЗапрос = Истина)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
	|	РеализацияТоваровУслуг.Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК ОрганизацияПолучатель,
	|	РеализацияТоваровУслуг.СтруктурноеПодразделение КАК СтруктурноеПодразделение,
	|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК СтруктурноеПодразделениеПолучатель,
	|	ВЫБОР
	|		КОГДА &ЭтоИсправленнаяСНТ
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыСНТ.Исправленная)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыСНТ.Первичная)
	|	КОНЕЦ КАК ТипСНТ,
	|	ВЫБОР
	|		КОГДА НЕ РеализацияТоваровУслуг.СтруктурноеПодразделение.УказыватьРеквизитыГоловнойОрганизации
	|			ТОГДА РеализацияТоваровУслуг.СтруктурноеПодразделение
	|		КОГДА РеализацияТоваровУслуг.Организация.УказыватьРеквизитыГоловнойОрганизацииВСчетеФактуре
	|			ТОГДА ОрганизацияГоловная.Ссылка
	|		ИНАЧЕ РеализацияТоваровУслуг.Организация
	|	КОНЕЦ КАК Поставщик,
	|	ВЫБОР
	|		КОГДА Контрагенты.УказыватьРеквизитыГоловнойОрганизацииВСчетеФактуре
	|			ТОГДА КонтрагентыГоловная.Ссылка
	|		ИНАЧЕ РеализацияТоваровУслуг.Контрагент
	|	КОНЕЦ КАК Контрагент,
	|	ВЫБОР
	|		КОГДА КлассификаторСтранМира.КодАльфа2 = ""KZ""
	|				ИЛИ КлассификаторСтранМира.КодАльфа2 ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСНТ.Реализация)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСНТ.Вывоз)
	|	КОНЕЦ КАК ВидОперации,
	|	ВЫБОР
	|		КОГДА КлассификаторСтранМира.КодАльфа2 = ""KZ""
	|				ИЛИ КлассификаторСтранМира.КодАльфа2 ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыВывозаСНТ.ПустаяСсылка)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыВывозаСНТ.Экспорт)
	|	КОНЕЦ КАК ВидВывоза,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыВвозаСНТ.ПустаяСсылка) КАК ВидВвоза,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыПеремещенияСНТ.ПустаяСсылка) КАК ВидПеремещения,
	|	ВЫБОР
	|		КОГДА Контрагенты.УказыватьРеквизитыГоловнойОрганизацииВСчетеФактуре
	|			ТОГДА КонтрагентыГоловная.Ссылка
	|		ИНАЧЕ РеализацияТоваровУслуг.Контрагент
	|	КОНЕЦ КАК Получатель,
	|	РеализацияТоваровУслуг.Дата КАК ДатаОтгрузкиТовара,
	|	ТаблицаТовары.Ссылка КАК ДокументОснование,
	|	РеализацияТоваровУслуг.ВалютаДокумента КАК Валюта,
	|	РеализацияТоваровУслуг.ВалютаДокумента.БуквенныйКод КАК ВалютаКод,
	|	РеализацияТоваровУслуг.КурсВзаиморасчетов КАК КурсВалюты,
	|	РеализацияТоваровУслуг.Склад КАК СкладОтправитель,
	|	ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка) КАК СкладПолучатель,
	|	ТаблицаТовары.Номенклатура КАК Товар,
	|	СправочникНоменклатура.НаименованиеПолное КАК ТоварНаименование,
	|	СправочникНоменклатура.КодТНВЭД КАК КодТНВЭД,
	|	ТаблицаТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	КлассификаторЕдиницИзмерения.КодЭСФ КАК ЕдиницаИзмеренияКод,
	|	ТаблицаТовары.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.УчитыватьНДС
	|				И РеализацияТоваровУслуг.СуммаВключаетНДС
	|			ТОГДА ВЫБОР
	|					КОГДА РеализацияТоваровУслуг.УчитыватьАкциз
	|							И РеализацияТоваровУслуг.СуммаВключаетАкциз
	|						ТОГДА ВЫРАЗИТЬ((ТаблицаТовары.Сумма - ТаблицаТовары.СуммаАкциза - ТаблицаТовары.СуммаНДС) / ТаблицаТовары.Количество КАК ЧИСЛО(14, 2))
	|					ИНАЧЕ ВЫРАЗИТЬ((ТаблицаТовары.Сумма - ТаблицаТовары.СуммаНДС) / ТаблицаТовары.Количество КАК ЧИСЛО(14, 2))
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РеализацияТоваровУслуг.УчитыватьАкциз
	|						И РеализацияТоваровУслуг.СуммаВключаетАкциз
	|					ТОГДА ВЫРАЗИТЬ((ТаблицаТовары.Сумма - ТаблицаТовары.СуммаАкциза) / ТаблицаТовары.Количество КАК ЧИСЛО(14, 2))
	|				ИНАЧЕ ВЫРАЗИТЬ(ТаблицаТовары.Цена КАК ЧИСЛО(14, 2))
	|			КОНЕЦ
	|	КОНЕЦ КАК Цена,
	|	""5"" КАК ПризнакПроисхождения,
	|	"""" КАК НомерЗаявленияВРамкахТС,
	|	"""" КАК ИдентификаторТовара,
	|	"""" КАК НомерПозицииВДекларацииИлиЗаявлении,
	|	ЗНАЧЕНИЕ(Справочник.ИсточникиПроисхождения.ПустаяСсылка) КАК ИсточникПроисхождения,
	|	""Товары"" КАК ИмяТабличнойЧасти,
	|	""РеализацияТоваровУслуг"" КАК ИмяДокумента,
	|	ЛОЖЬ КАК ЗапрещеноРазбиватьДокумент,
	|	ИСТИНА КАК РаспределятьТоварыПоИП,
	|	"""" КАК ПрефиксВидаДокумента,
	|	"""" КАК НомерУчетногоДокумента,
	|	"""" КАК НомерПакета,
	|	ТаблицаТовары.СтавкаАкциза КАК СтавкаАкциза,
	|	ТаблицаТовары.СуммаАкциза КАК СуммаАкциза,
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.СтавкаНДС <> ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка)
	|			ТОГДА ТаблицаТовары.СтавкаНДС.ДляОсвобожденногоОборота
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК БезНДС,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.УчитыватьНДС
	|			ТОГДА ТаблицаТовары.СтавкаНДС
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка)
	|	КОНЕЦ КАК СтавкаНДС,
	|	ТаблицаТовары.СуммаНДС КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.УчитыватьНДС
	|				И РеализацияТоваровУслуг.СуммаВключаетНДС
	|			ТОГДА ВЫБОР
	|					КОГДА РеализацияТоваровУслуг.УчитыватьАкциз
	|							И РеализацияТоваровУслуг.СуммаВключаетАкциз
	|						ТОГДА ТаблицаТовары.Сумма - ТаблицаТовары.СуммаНДС
	|					ИНАЧЕ ТаблицаТовары.Сумма - ТаблицаТовары.СуммаНДС + ТаблицаТовары.СуммаАкциза
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РеализацияТоваровУслуг.УчитыватьАкциз
	|						И РеализацияТоваровУслуг.СуммаВключаетАкциз
	|					ТОГДА ТаблицаТовары.Сумма
	|				ИНАЧЕ ТаблицаТовары.Сумма + ТаблицаТовары.СуммаАкциза
	|			КОНЕЦ
	|	КОНЕЦ КАК ОборотПоРеализации,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.УчитыватьНДС
	|				И РеализацияТоваровУслуг.СуммаВключаетНДС
	|			ТОГДА ВЫБОР
	|					КОГДА РеализацияТоваровУслуг.УчитыватьАкциз
	|							И РеализацияТоваровУслуг.СуммаВключаетАкциз
	|						ТОГДА ТаблицаТовары.Сумма - ТаблицаТовары.СуммаАкциза - ТаблицаТовары.СуммаНДС
	|					ИНАЧЕ ТаблицаТовары.Сумма - ТаблицаТовары.СуммаНДС
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РеализацияТоваровУслуг.УчитыватьАкциз
	|						И РеализацияТоваровУслуг.СуммаВключаетАкциз
	|					ТОГДА ТаблицаТовары.Сумма - ТаблицаТовары.СуммаАкциза
	|				ИНАЧЕ ТаблицаТовары.Сумма
	|			КОНЕЦ
	|	КОНЕЦ КАК СуммаБезНалогов,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.УчитыватьНДС
	|				И РеализацияТоваровУслуг.СуммаВключаетНДС
	|			ТОГДА ВЫБОР
	|					КОГДА РеализацияТоваровУслуг.УчитыватьАкциз
	|							И РеализацияТоваровУслуг.СуммаВключаетАкциз
	|						ТОГДА ТаблицаТовары.Сумма
	|					ИНАЧЕ ТаблицаТовары.Сумма + ТаблицаТовары.СуммаАкциза
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РеализацияТоваровУслуг.УчитыватьАкциз
	|						И РеализацияТоваровУслуг.СуммаВключаетАкциз
	|					ТОГДА ТаблицаТовары.Сумма + ТаблицаТовары.СуммаНДС
	|				ИНАЧЕ ТаблицаТовары.Сумма + ТаблицаТовары.СуммаНДС + ТаблицаТовары.СуммаАкциза
	|			КОНЕЦ
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР
	|		КОГДА НЕ РеализацияТоваровУслуг.СтруктурноеПодразделение.УказыватьРеквизитыГоловнойОрганизации
	|			ТОГДА ЕСТЬNULL(РеализацияТоваровУслуг.СтруктурноеПодразделение.ИдентификационныйНомер, """")
	|		КОГДА РеализацияТоваровУслуг.Организация.УказыватьРеквизитыГоловнойОрганизацииВСчетеФактуре
	|			ТОГДА ЕСТЬNULL(ОрганизацияГоловная.ИдентификационныйНомер, """")
	|		ИНАЧЕ ЕСТЬNULL(Организации.ИдентификационныйНомер, """")
	|	КОНЕЦ КАК ПоставщикИдентификатор,
	|	ВЫБОР
	|		КОГДА НЕ РеализацияТоваровУслуг.СтруктурноеПодразделение.УказыватьРеквизитыГоловнойОрганизации
	|			ТОГДА ЕСТЬNULL(ВЫРАЗИТЬ(РеализацияТоваровУслуг.СтруктурноеПодразделение.НаименованиеПолное КАК СТРОКА(200)), """")
	|		КОГДА РеализацияТоваровУслуг.Организация.УказыватьРеквизитыГоловнойОрганизацииВСчетеФактуре
	|			ТОГДА ЕСТЬNULL(ВЫРАЗИТЬ(ОрганизацияГоловная.НаименованиеПолное КАК СТРОКА(200)), """")
	|		ИНАЧЕ ЕСТЬNULL(ВЫРАЗИТЬ(Организации.НаименованиеПолное КАК СТРОКА(200)), """")
	|	КОНЕЦ КАК ПоставщикНаименование,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.СтруктурноеПодразделение.УказыватьРеквизитыГоловнойОрганизации
	|			ТОГДА ЕСТЬNULL(РеализацияТоваровУслуг.СтруктурноеПодразделение.ИдентификационныйНомер, """")
	|		КОГДА РеализацияТоваровУслуг.Организация.УказыватьРеквизитыГоловнойОрганизацииВСчетеФактуре
	|			ТОГДА ЕСТЬNULL(Организации.ИдентификационныйНомер, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ПоставщикБИНСтруктурногоПодразделения,
	|	ВЫБОР
	|		КОГДА Контрагенты.УказыватьРеквизитыГоловнойОрганизацииВСчетеФактуре
	|			ТОГДА ЕСТЬNULL(Контрагенты.ИдентификационныйКодЛичности, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ПолучательБИНСтруктурногоПодразделения,
	|	ЛОЖЬ КАК ПоставщикНерезидент,
	|	ЛОЖЬ КАК ПоставщикРозничнаяРеализация,
	|	ЛОЖЬ КАК ПоставщикМалаяТорговаяТочка,
	|	""KZ"" КАК ПоставщикКодСтраны,
	|	""KZ"" КАК ПоставщикКодСтраныОтправки,
	|	ВЫБОР
	|		КОГДА НЕ РеализацияТоваровУслуг.СтруктурноеПодразделение.УказыватьРеквизитыГоловнойОрганизации
	|			ТОГДА РеализацияТоваровУслуг.СтруктурноеПодразделение
	|		ИНАЧЕ РеализацияТоваровУслуг.Организация
	|	КОНЕЦ КАК Грузоотправитель,
	|	ВЫБОР
	|		КОГДА НЕ РеализацияТоваровУслуг.СтруктурноеПодразделение.УказыватьРеквизитыГоловнойОрганизации
	|			ТОГДА ЕСТЬNULL(ВЫРАЗИТЬ(РеализацияТоваровУслуг.СтруктурноеПодразделение.НаименованиеПолное КАК СТРОКА(200)), """")
	|		ИНАЧЕ ЕСТЬNULL(ВЫРАЗИТЬ(Организации.НаименованиеПолное КАК СТРОКА(200)), """")
	|	КОНЕЦ КАК ГрузоотправительНаименование,
	|	ВЫБОР
	|		КОГДА НЕ РеализацияТоваровУслуг.СтруктурноеПодразделение.УказыватьРеквизитыГоловнойОрганизации
	|			ТОГДА ЕСТЬNULL(РеализацияТоваровУслуг.СтруктурноеПодразделение.ИдентификационныйНомер, """")
	|		ИНАЧЕ ЕСТЬNULL(Организации.ИдентификационныйНомер, """")
	|	КОНЕЦ КАК ГрузоотправительИдентификатор,
	|	ЛОЖЬ КАК ГрузоотправительНерезидент,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.Грузополучатель <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА РеализацияТоваровУслуг.Грузополучатель
	|		ИНАЧЕ Контрагенты.Ссылка
	|	КОНЕЦ КАК Грузополучатель,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.Грузополучатель <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|					КОГДА (ВЫРАЗИТЬ(Грузополучатели.НаименованиеПолное КАК СТРОКА(200))) <> """"""""
	|						ТОГДА ВЫРАЗИТЬ(Грузополучатели.НаименованиеПолное КАК СТРОКА(200))
	|					ИНАЧЕ Грузополучатели.Наименование
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА (ВЫРАЗИТЬ(Контрагенты.НаименованиеПолное КАК СТРОКА(200))) <> """"""""
	|					ТОГДА ВЫРАЗИТЬ(Контрагенты.НаименованиеПолное КАК СТРОКА(200))
	|				ИНАЧЕ Контрагенты.Наименование
	|			КОНЕЦ
	|	КОНЕЦ КАК ГрузополучательНаименование,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.Грузополучатель <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(Грузополучатели.ИдентификационныйКодЛичности, """")
	|		КОГДА КлассификаторСтранМира.КодАльфа2 <> ""KZ""
	|				И КлассификаторСтранМира.УчастникТаможенногоСоюза <> ЗНАЧЕНИЕ(Справочник.СтраныУчастникиТаможенногоСоюза.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(Контрагенты.НомерНалоговойРегистрацииВСтранеРезидентства, """")// ЕРП - РегистрационныйНомер
	|		КОГДА КлассификаторСтранМира.КодАльфа2 <> ""KZ""
	|				И КлассификаторСтранМира.УчастникТаможенногоСоюза = ЗНАЧЕНИЕ(Справочник.СтраныУчастникиТаможенногоСоюза.ПустаяСсылка)
	|			ТОГДА """"
	|		ИНАЧЕ ЕСТЬNULL(Контрагенты.ИдентификационныйКодЛичности, """")
	|	КОНЕЦ КАК ГрузополучательИдентификатор,
	|	ВЫБОР
	|		КОГДА КлассификаторСтранМира.КодАльфа2 <> ""KZ""
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ГрузополучательНерезидент,
	|	""KZ"" КАК ГрузоотправительКодСтраныОтправки,
	|	ВЫБОР
	|		КОГДА Контрагенты.УказыватьРеквизитыГоловнойОрганизацииВСчетеФактуре
	|			ТОГДА ЕСТЬNULL(КонтрагентыГоловная.ИдентификационныйКодЛичности, """")
	|		КОГДА КлассификаторСтранМира.КодАльфа2 <> ""KZ""
	|				И КлассификаторСтранМира.УчастникТаможенногоСоюза <> ЗНАЧЕНИЕ(Справочник.СтраныУчастникиТаможенногоСоюза.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(Контрагенты.НомерНалоговойРегистрацииВСтранеРезидентства, """")// ЕРП - РегистрационныйНомер
	|		КОГДА КлассификаторСтранМира.КодАльфа2 <> ""KZ""
	|				И КлассификаторСтранМира.УчастникТаможенногоСоюза = ЗНАЧЕНИЕ(Справочник.СтраныУчастникиТаможенногоСоюза.ПустаяСсылка)
	|			ТОГДА """"
	|		ИНАЧЕ ЕСТЬNULL(Контрагенты.ИдентификационныйКодЛичности, """")
	|	КОНЕЦ КАК ПолучательИдентификатор,
	|	ВЫБОР
	|		КОГДА Контрагенты.УказыватьРеквизитыГоловнойОрганизацииВСчетеФактуре
	|			ТОГДА ВЫБОР
	|					КОГДА (ВЫРАЗИТЬ(КонтрагентыГоловная.НаименованиеПолное КАК СТРОКА(200))) <> """"""""
	|						ТОГДА ВЫРАЗИТЬ(КонтрагентыГоловная.НаименованиеПолное КАК СТРОКА(200))
	|					ИНАЧЕ КонтрагентыГоловная.Наименование
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА (ВЫРАЗИТЬ(Контрагенты.НаименованиеПолное КАК СТРОКА(200))) <> """"""""
	|					ТОГДА ВЫРАЗИТЬ(Контрагенты.НаименованиеПолное КАК СТРОКА(200))
	|				ИНАЧЕ Контрагенты.Наименование
	|			КОНЕЦ
	|	КОНЕЦ КАК ПолучательНаименование,
	|	КлассификаторСтранМира.КодАльфа2 КАК ПолучательКодСтраны,
	|	КлассификаторСтранМира.КодАльфа2 КАК ПолучательКодСтраныДоставки,
	|	КлассификаторСтранМира.КодАльфа2 КАК ГрузополучательКодСтраныОтправки,
	|	ВЫБОР
	|		КОГДА КлассификаторСтранМира.КодАльфа2 <> ""KZ""
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПолучательНерезидент,
	|	ЛОЖЬ КАК ПолучательРозничнаяРеализация,
	|	РеализацияТоваровУслуг.Контрагент.МалаяТорговаяТочка КАК ПолучательМалаяТорговаяТочка,
	|	ЛОЖЬ КАК ПолучательРозничныйРеализатор,
	|	ВЫРАЗИТЬ(РеализацияТоваровУслуг.АдресДоставки КАК СТРОКА(400)) КАК АдресДоставки,
	|	"""" КАК АдресОтправки,
	|	РеализацияТоваровУслуг.ДоговорКонтрагента КАК ДоговорПоставки,
	|	ВЫБОР
	|		КОГДА ДоговорыКонтрагентов.НомерДоговора <> """"""""
	|				И ДоговорыКонтрагентов.ДатаДоговора <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК БезДоговора,
	|	ВЫБОР
	|		КОГДА КлассификаторСтранМира.КодАльфа2 <> ""KZ"" 
	|				И (ДоговорыКонтрагентов.НомерДоговора <> """" И ДоговорыКонтрагентов.ДатаДоговора <> ДАТАВРЕМЯ(1, 1, 1))
	|			ТОГДА ДоговорыКонтрагентов.УникальныйНомерВалютногоКонтроля
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК УникальныйНомерВалютногоКонтроля,
	|	РеализацияТоваровУслуг.УчитыватьАкциз КАК УчитыватьАкциз,
	|	РеализацияТоваровУслуг.УчитыватьНДС КАК УчитыватьНДС,
	|	РеализацияТоваровУслуг.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	РеализацияТоваровУслуг.СуммаВключаетАкциз КАК СуммаВключаетАкциз,
	|	ДоговорыКонтрагентов.НомерДоговора КАК ДоговорПоставкиНомер,
	|	ДоговорыКонтрагентов.ДатаДоговора КАК ДоговорПоставкиДата,
	|	ДоговорыКонтрагентов.УсловияОплаты КАК ДоговорПоставкиУсловияОплаты,
	|	ДоговорыКонтрагентов.УсловияПоставки КАК ДоговорПоставкиУсловияПоставки,
	|	ВЫБОР
	|		КОГДА &ЭтоИсправленнаяСНТ
	|			ТОГДА РеализацияТоваровУслуг.Ссылка
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ПервичныйДокументОснование,
	|	&ЭтоИсправленнаяСНТ КАК ЭтоИсправленнаяСНТ,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.УчитыватьНДС
	|			ТОГДА СтавкиНДС.Ставка
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СтавкаНДСЧисло,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.УчитыватьАкциз
	|				И НЕ СтавкиАкциза.Ссылка ЕСТЬ NULL
	|			ТОГДА СтавкиАкциза.Ставка
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СтавкаАкцизаЧисло,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.Контрагент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	|				И НЕ РеализацияТоваровУслуг.Контрагент.ИндивидуальныйПредпринимательАдвокатЧастныйНотариус
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПолучательФизическоеЛицо,
	|	ЛОЖЬ КАК ПоставщикФизическоеЛицо,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.УчастникСРП, ЛОЖЬ) КАК ПолучательУчастникСРП,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.ДоговорСовместнойДеятельности, ЛОЖЬ) КАК ПолучательУчастникСовместнойДеятельности,
	|	РеализацияТоваровУслуг.ДоверенностьНомер КАК НомерДоверенностиОтпуск,
	|	РеализацияТоваровУслуг.ДоверенностьДата КАК ДатаДоверенностиОтпуск,
	|	ТаблицаТовары.НомерСтроки КАК НомерСтроки,
	|	ВЫРАЗИТЬ(СправочникНоменклатура.ВесНетто * ТаблицаТовары.Количество КАК ЧИСЛО(15, 3)) КАК ВесНетто
	|ПОМЕСТИТЬ вт_ДанныеДокумента
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК ТаблицаТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК ОрганизацияГоловная
	|				ПО Организации.ГоловнаяОрганизация = ОрганизацияГоловная.Ссылка
	|			ПО РеализацияТоваровУслуг.Организация = Организации.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Грузополучатели
	|			ПО РеализацияТоваровУслуг.Грузополучатель = Грузополучатели.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК КонтрагентыГоловная
	|				ПО Контрагенты.ГоловнойКонтрагент = КонтрагентыГоловная.Ссылка
	|			ПО РеализацияТоваровУслуг.Контрагент = Контрагенты.Ссылка
	|		ПО ТаблицаТовары.Ссылка = РеализацияТоваровУслуг.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК КлассификаторСтранМира
	|		ПО (Контрагенты.СтранаРезидентства = КлассификаторСтранМира.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО ТаблицаТовары.Номенклатура = СправочникНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
	|		ПО ТаблицаТовары.ЕдиницаИзмерения = КлассификаторЕдиницИзмерения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО (РеализацияТоваровУслуг.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтавкиНДС КАК СтавкиНДС
	|		ПО ТаблицаТовары.СтавкаНДС = СтавкиНДС.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтавкиАкциза КАК СтавкиАкциза
	|		ПО (РеализацияТоваровУслуг.УчитыватьАкциз)
	|			И ТаблицаТовары.СтавкаАкциза = СтавкиАкциза.Ссылка
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка В(&МассивДокументов)
	|	И РеализацияТоваровУслуг.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРеализацияТоваров.ПередачаСтруктурномуПодразделению)";
	
	Если Не ПервыйЗапрос Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПОМЕСТИТЬ вт_ДанныеДокумента", "");	
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РАЗРЕШЕННЫЕ", "");
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции	

Функция ТекстЗапросаРеализацияТоваровУслугПередачаСтруктурномуПодразделению(ПервыйЗапрос = Истина)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
	|	РеализацияТоваровУслуг.Организация КАК Организация,
	|	ОрганизацияСобственныеКонтрагенты.Ссылка КАК ОрганизацияПолучатель,
	|	РеализацияТоваровУслуг.СтруктурноеПодразделение КАК СтруктурноеПодразделение,
	|	ОрганизацияСобственныеКонтрагенты.Ссылка КАК СтруктурноеПодразделениеПолучатель,
	|	ВЫБОР
	|		КОГДА &ЭтоИсправленнаяСНТ
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыСНТ.Исправленная)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыСНТ.Первичная)
	|	КОНЕЦ КАК ТипСНТ,
	|	ВЫБОР
	|		КОГДА НЕ РеализацияТоваровУслуг.СтруктурноеПодразделение.УказыватьРеквизитыГоловнойОрганизации
	|			ТОГДА РеализацияТоваровУслуг.СтруктурноеПодразделение
	|		ИНАЧЕ РеализацияТоваровУслуг.Организация
	|	КОНЕЦ КАК Поставщик,
	|	"""" КАК Контрагент,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСНТ.ПеремещениеМеждуФилиалами) КАК ВидОперации,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыВывозаСНТ.ПустаяСсылка) КАК ВидВывоза,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыВвозаСНТ.ПустаяСсылка) КАК ВидВвоза,
	|	ВЫБОР
	|		КОГДА НЕ ОрганизацияСобственныеКонтрагенты.ИностраннаяОрганизация
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыПеремещенияСНТ.ВПределахОдногоЛицаРК)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыПеремещенияСНТ.ВПределахОдногоЛицаЕАЭС)
	|	КОНЕЦ КАК ВидПеремещения,
	|	ОрганизацияСобственныеКонтрагенты.Ссылка КАК Получатель,
	|	РеализацияТоваровУслуг.Дата КАК ДатаОтгрузкиТовара,
	|	ТаблицаТовары.Ссылка КАК ДокументОснование,
	|	РеализацияТоваровУслуг.ВалютаДокумента КАК Валюта,
	|	РеализацияТоваровУслуг.ВалютаДокумента.БуквенныйКод КАК ВалютаКод,
	|	РеализацияТоваровУслуг.КурсВзаиморасчетов КАК КурсВалюты,
	|	РеализацияТоваровУслуг.Склад КАК СкладОтправитель,
	|	ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка) КАК СкладПолучатель,
	|	ТаблицаТовары.Номенклатура КАК Товар,
	|	СправочникНоменклатура.НаименованиеПолное КАК ТоварНаименование,
	|	СправочникНоменклатура.КодТНВЭД КАК КодТНВЭД,
	|	ТаблицаТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	КлассификаторЕдиницИзмерения.КодЭСФ КАК ЕдиницаИзмеренияКод,
	|	ТаблицаТовары.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.УчитыватьНДС
	|				И РеализацияТоваровУслуг.СуммаВключаетНДС
	|			ТОГДА ВЫБОР
	|					КОГДА РеализацияТоваровУслуг.УчитыватьАкциз
	|							И РеализацияТоваровУслуг.СуммаВключаетАкциз
	|						ТОГДА ВЫРАЗИТЬ((ТаблицаТовары.Сумма - ТаблицаТовары.СуммаАкциза - ТаблицаТовары.СуммаНДС) / ТаблицаТовары.Количество КАК ЧИСЛО(14, 2))
	|					ИНАЧЕ ВЫРАЗИТЬ((ТаблицаТовары.Сумма - ТаблицаТовары.СуммаНДС) / ТаблицаТовары.Количество КАК ЧИСЛО(14, 2))
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РеализацияТоваровУслуг.УчитыватьАкциз
	|						И РеализацияТоваровУслуг.СуммаВключаетАкциз
	|					ТОГДА ВЫРАЗИТЬ((ТаблицаТовары.Сумма - ТаблицаТовары.СуммаАкциза) / ТаблицаТовары.Количество КАК ЧИСЛО(14, 2))
	|				ИНАЧЕ ВЫРАЗИТЬ(ТаблицаТовары.Цена КАК ЧИСЛО(14, 2))
	|			КОНЕЦ
	|	КОНЕЦ КАК Цена,
	|	""5"" КАК ПризнакПроисхождения,
	|	"""" КАК НомерЗаявленияВРамкахТС,
	|	"""" КАК ИдентификаторТовара,
	|	"""" КАК НомерПозицииВДекларацииИлиЗаявлении,
	|	ЗНАЧЕНИЕ(Справочник.ИсточникиПроисхождения.ПустаяСсылка) КАК ИсточникПроисхождения,
	|	""Товары"" КАК ИмяТабличнойЧасти,
	|	""РеализацияТоваровУслуг"" КАК ИмяДокумента,
	|	ЛОЖЬ КАК ЗапрещеноРазбиватьДокумент,
	|	ИСТИНА КАК РаспределятьТоварыПоИП,
	|	"""" КАК ПрефиксВидаДокумента,
	|	"""" КАК НомерУчетногоДокумента,
	|	"""" КАК НомерПакета,
	|	ТаблицаТовары.СтавкаАкциза КАК СтавкаАкциза,
	|	ТаблицаТовары.СуммаАкциза КАК СуммаАкциза,
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.СтавкаНДС <> ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка)
	|			ТОГДА ТаблицаТовары.СтавкаНДС.ДляОсвобожденногоОборота
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК БезНДС,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.УчитыватьНДС
	|			ТОГДА ТаблицаТовары.СтавкаНДС
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка)
	|	КОНЕЦ КАК СтавкаНДС,
	|	ТаблицаТовары.СуммаНДС КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.УчитыватьНДС
	|				И РеализацияТоваровУслуг.СуммаВключаетНДС
	|			ТОГДА ВЫБОР
	|					КОГДА РеализацияТоваровУслуг.УчитыватьАкциз
	|							И РеализацияТоваровУслуг.СуммаВключаетАкциз
	|						ТОГДА ТаблицаТовары.Сумма - ТаблицаТовары.СуммаНДС
	|					ИНАЧЕ ТаблицаТовары.Сумма - ТаблицаТовары.СуммаНДС + ТаблицаТовары.СуммаАкциза
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РеализацияТоваровУслуг.УчитыватьАкциз
	|						И РеализацияТоваровУслуг.СуммаВключаетАкциз
	|					ТОГДА ТаблицаТовары.Сумма
	|				ИНАЧЕ ТаблицаТовары.Сумма + ТаблицаТовары.СуммаАкциза
	|			КОНЕЦ
	|	КОНЕЦ КАК ОборотПоРеализации,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.УчитыватьНДС
	|				И РеализацияТоваровУслуг.СуммаВключаетНДС
	|			ТОГДА ВЫБОР
	|					КОГДА РеализацияТоваровУслуг.УчитыватьАкциз
	|							И РеализацияТоваровУслуг.СуммаВключаетАкциз
	|						ТОГДА ТаблицаТовары.Сумма - ТаблицаТовары.СуммаАкциза - ТаблицаТовары.СуммаНДС
	|					ИНАЧЕ ТаблицаТовары.Сумма - ТаблицаТовары.СуммаНДС
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РеализацияТоваровУслуг.УчитыватьАкциз
	|						И РеализацияТоваровУслуг.СуммаВключаетАкциз
	|					ТОГДА ТаблицаТовары.Сумма - ТаблицаТовары.СуммаАкциза
	|				ИНАЧЕ ТаблицаТовары.Сумма
	|			КОНЕЦ
	|	КОНЕЦ КАК СуммаБезНалогов,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.УчитыватьНДС
	|				И РеализацияТоваровУслуг.СуммаВключаетНДС
	|			ТОГДА ВЫБОР
	|					КОГДА РеализацияТоваровУслуг.УчитыватьАкциз
	|							И РеализацияТоваровУслуг.СуммаВключаетАкциз
	|						ТОГДА ТаблицаТовары.Сумма
	|					ИНАЧЕ ТаблицаТовары.Сумма + ТаблицаТовары.СуммаАкциза
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РеализацияТоваровУслуг.УчитыватьАкциз
	|						И РеализацияТоваровУслуг.СуммаВключаетАкциз
	|					ТОГДА ТаблицаТовары.Сумма + ТаблицаТовары.СуммаНДС
	|				ИНАЧЕ ТаблицаТовары.Сумма + ТаблицаТовары.СуммаНДС + ТаблицаТовары.СуммаАкциза
	|			КОНЕЦ
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР
	|		КОГДА НЕ РеализацияТоваровУслуг.СтруктурноеПодразделение.УказыватьРеквизитыГоловнойОрганизации
	|			ТОГДА ЕСТЬNULL(РеализацияТоваровУслуг.СтруктурноеПодразделение.ИдентификационныйНомер, """")
	|		ИНАЧЕ ЕСТЬNULL(Организации.ИдентификационныйНомер, """")
	|	КОНЕЦ КАК ПоставщикИдентификатор,
	|	ВЫБОР
	|		КОГДА НЕ РеализацияТоваровУслуг.СтруктурноеПодразделение.УказыватьРеквизитыГоловнойОрганизации
	|			ТОГДА ЕСТЬNULL(ВЫРАЗИТЬ(РеализацияТоваровУслуг.СтруктурноеПодразделение.НаименованиеПолное КАК СТРОКА(200)), """")
	|		ИНАЧЕ ЕСТЬNULL(ВЫРАЗИТЬ(Организации.НаименованиеПолное КАК СТРОКА(200)), """")
	|	КОНЕЦ КАК ПоставщикНаименование,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.СтруктурноеПодразделение.УказыватьРеквизитыГоловнойОрганизации
	|			ТОГДА ЕСТЬNULL(РеализацияТоваровУслуг.СтруктурноеПодразделение.ИдентификационныйНомер, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ПоставщикБИНСтруктурногоПодразделения,
	|	"""" КАК ПолучательБИНСтруктурногоПодразделения,
	|	ЛОЖЬ КАК ПоставщикНерезидент,
	|	ЛОЖЬ КАК ПоставщикРозничнаяРеализация,
	|	ЛОЖЬ КАК ПоставщикМалаяТорговаяТочка,
	|	""KZ"" КАК ПоставщикКодСтраны,
	|	""KZ"" КАК ПоставщикКодСтраныОтправки,
	|	ВЫБОР
	|		КОГДА НЕ РеализацияТоваровУслуг.СтруктурноеПодразделение.УказыватьРеквизитыГоловнойОрганизации
	|			ТОГДА РеализацияТоваровУслуг.СтруктурноеПодразделение
	|		ИНАЧЕ РеализацияТоваровУслуг.Организация
	|	КОНЕЦ КАК Грузоотправитель,
	|	ВЫБОР
	|		КОГДА НЕ РеализацияТоваровУслуг.СтруктурноеПодразделение.УказыватьРеквизитыГоловнойОрганизации
	|			ТОГДА ЕСТЬNULL(ВЫРАЗИТЬ(РеализацияТоваровУслуг.СтруктурноеПодразделение.НаименованиеПолное КАК СТРОКА(200)), """")
	|		ИНАЧЕ ЕСТЬNULL(ВЫРАЗИТЬ(Организации.НаименованиеПолное КАК СТРОКА(200)), """")
	|	КОНЕЦ КАК ГрузоотправительНаименование,
	|	ВЫБОР
	|		КОГДА НЕ РеализацияТоваровУслуг.СтруктурноеПодразделение.УказыватьРеквизитыГоловнойОрганизации
	|			ТОГДА ЕСТЬNULL(РеализацияТоваровУслуг.СтруктурноеПодразделение.ИдентификационныйНомер, """")
	|		ИНАЧЕ ЕСТЬNULL(Организации.ИдентификационныйНомер, """")
	|	КОНЕЦ КАК ГрузоотправительИдентификатор,
	|	ЛОЖЬ КАК ГрузоотправительНерезидент,
	|	""KZ"" КАК ГрузоотправительКодСтраныОтправки,
	|	ОрганизацияСобственныеКонтрагенты.Ссылка КАК Грузополучатель,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(ОрганизацияСобственныеКонтрагенты.НаименованиеПолное КАК СТРОКА(200))) <> """"""""
	|			ТОГДА ВЫРАЗИТЬ(ОрганизацияСобственныеКонтрагенты.НаименованиеПолное КАК СТРОКА(200))
	|		ИНАЧЕ ОрганизацияСобственныеКонтрагенты.Наименование
	|	КОНЕЦ КАК ГрузополучательНаименование,
	|	ВЫБОР
	|		КОГДА ОрганизацияСобственныеКонтрагенты.ИностраннаяОрганизация
	|				И КлассификаторСтранМира.КодАльфа2 <> ""KZ""
	|				И КлассификаторСтранМира.УчастникТаможенногоСоюза <> ЗНАЧЕНИЕ(Справочник.СтраныУчастникиТаможенногоСоюза.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(ОрганизацияСобственныеКонтрагенты.КодВСтранеРегистрации, """")
	|		КОГДА ОрганизацияСобственныеКонтрагенты.ИностраннаяОрганизация
	|				И КлассификаторСтранМира.КодАльфа2 <> ""KZ""
	|				И КлассификаторСтранМира.УчастникТаможенногоСоюза = ЗНАЧЕНИЕ(Справочник.СтраныУчастникиТаможенногоСоюза.ПустаяСсылка)
	|			ТОГДА """"
	|		ИНАЧЕ ЕСТЬNULL(ОрганизацияСобственныеКонтрагенты.ИдентификационныйНомер, """")
	|	КОНЕЦ КАК ГрузополучательИдентификатор,
	|	ВЫБОР
	|		КОГДА ОрганизацияСобственныеКонтрагенты.ИностраннаяОрганизация
	|				И КлассификаторСтранМира.КодАльфа2 <> ""KZ""
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ГрузополучательНерезидент,
	|	ВЫБОР
	|		КОГДА ОрганизацияСобственныеКонтрагенты.ИностраннаяОрганизация
	|				И КлассификаторСтранМира.КодАльфа2 <> ""KZ""
	|				И КлассификаторСтранМира.УчастникТаможенногоСоюза <> ЗНАЧЕНИЕ(Справочник.СтраныУчастникиТаможенногоСоюза.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(ОрганизацияСобственныеКонтрагенты.КодВСтранеРегистрации, """")
	|		КОГДА ОрганизацияСобственныеКонтрагенты.ИностраннаяОрганизация
	|				И КлассификаторСтранМира.КодАльфа2 <> ""KZ""
	|				И КлассификаторСтранМира.УчастникТаможенногоСоюза = ЗНАЧЕНИЕ(Справочник.СтраныУчастникиТаможенногоСоюза.ПустаяСсылка)
	|			ТОГДА """"
	|		ИНАЧЕ ЕСТЬNULL(ОрганизацияСобственныеКонтрагенты.ИдентификационныйНомер, """")
	|	КОНЕЦ КАК ПолучательИдентификатор,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(ОрганизацияСобственныеКонтрагенты.НаименованиеПолное КАК СТРОКА(200))) <> """"""""
	|			ТОГДА ВЫРАЗИТЬ(ОрганизацияСобственныеКонтрагенты.НаименованиеПолное КАК СТРОКА(200))
	|		ИНАЧЕ ОрганизацияСобственныеКонтрагенты.Наименование
	|	КОНЕЦ КАК ПолучательНаименование,
	|	ВЫБОР
	|		КОГДА ОрганизацияСобственныеКонтрагенты.ИностраннаяОрганизация
	|			ТОГДА КлассификаторСтранМира.КодАльфа2
	|		ИНАЧЕ ""KZ""
	|	КОНЕЦ КАК ПолучательКодСтраны,
	|	ВЫБОР
	|		КОГДА ОрганизацияСобственныеКонтрагенты.ИностраннаяОрганизация
	|			ТОГДА КлассификаторСтранМира.КодАльфа2
	|		ИНАЧЕ ""KZ""
	|	КОНЕЦ КАК ПолучательКодСтраныДоставки,
	|	ВЫБОР
	|		КОГДА ОрганизацияСобственныеКонтрагенты.ИностраннаяОрганизация
	|			ТОГДА КлассификаторСтранМира.КодАльфа2
	|		ИНАЧЕ ""KZ""
	|	КОНЕЦ КАК ГрузополучательКодСтраныОтправки,
	|	ВЫБОР
	|		КОГДА ОрганизацияСобственныеКонтрагенты.ИностраннаяОрганизация
	|				И КлассификаторСтранМира.КодАльфа2 <> ""KZ""
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПолучательНерезидент,
	|	ЛОЖЬ КАК ПолучательРозничнаяРеализация,
	|	РеализацияТоваровУслуг.Контрагент.МалаяТорговаяТочка КАК ПолучательМалаяТорговаяТочка,
	|	ЛОЖЬ КАК ПолучательРозничныйРеализатор,
	|	ВЫРАЗИТЬ(РеализацияТоваровУслуг.АдресДоставки КАК СТРОКА(400)) КАК АдресДоставки,
	|	"""" КАК АдресОтправки,
	|	РеализацияТоваровУслуг.ДоговорКонтрагента КАК ДоговорПоставки,
	|	ВЫБОР
	|		КОГДА ДоговорыКонтрагентов.НомерДоговора <> """"""""
	|				И ДоговорыКонтрагентов.ДатаДоговора <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК БезДоговора,
	|	"""" КАК УникальныйНомерВалютногоКонтроля,
	|	РеализацияТоваровУслуг.УчитыватьАкциз КАК УчитыватьАкциз,
	|	РеализацияТоваровУслуг.УчитыватьНДС КАК УчитыватьНДС,
	|	РеализацияТоваровУслуг.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	РеализацияТоваровУслуг.СуммаВключаетАкциз КАК СуммаВключаетАкциз,
	|	ДоговорыКонтрагентов.НомерДоговора КАК ДоговорПоставкиНомер,
	|	ДоговорыКонтрагентов.ДатаДоговора КАК ДоговорПоставкиДата,
	|	ДоговорыКонтрагентов.УсловияОплаты КАК ДоговорПоставкиУсловияОплаты,
	|	ДоговорыКонтрагентов.УсловияПоставки КАК ДоговорПоставкиУсловияПоставки,
	|	ВЫБОР
	|		КОГДА &ЭтоИсправленнаяСНТ
	|			ТОГДА РеализацияТоваровУслуг.Ссылка
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ПервичныйДокументОснование,
	|	&ЭтоИсправленнаяСНТ КАК ЭтоИсправленнаяСНТ,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.УчитыватьНДС
	|			ТОГДА СтавкиНДС.Ставка
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СтавкаНДСЧисло,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.УчитыватьАкциз
	|				И НЕ СтавкиАкциза.Ссылка ЕСТЬ NULL
	|			ТОГДА СтавкиАкциза.Ставка
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СтавкаАкцизаЧисло,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.Контрагент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПолучательФизическоеЛицо,
	|	ЛОЖЬ КАК ПоставщикФизическоеЛицо,
	|	ЛОЖЬ КАК ПолучательУчастникСРП,
	|	ЛОЖЬ КАК ПолучательУчастникСовместнойДеятельности,
	|	РеализацияТоваровУслуг.ДоверенностьНомер КАК НомерДоверенностиОтпуск,
	|	РеализацияТоваровУслуг.ДоверенностьДата КАК ДатаДоверенностиОтпуск,
	|	ТаблицаТовары.НомерСтроки КАК НомерСтроки,
	|	ВЫРАЗИТЬ(СправочникНоменклатура.ВесНетто * ТаблицаТовары.Количество КАК ЧИСЛО(15, 3)) КАК ВесНетто
	|ПОМЕСТИТЬ вт_ДанныеДокумента
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК ТаблицаТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|			ПО РеализацияТоваровУслуг.Организация = Организации.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СобственныеКонтрагенты КАК СобственныеКонтрагенты
	|			ПО РеализацияТоваровУслуг.Контрагент = СобственныеКонтрагенты.Контрагент
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК ОрганизацияСобственныеКонтрагенты
	|			ПО (СобственныеКонтрагенты.Организация = ОрганизацияСобственныеКонтрагенты.Ссылка)
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК КлассификаторСтранМира
	|			ПО (ОрганизацияСобственныеКонтрагенты.СтранаРегистрации = КлассификаторСтранМира.Ссылка)
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|			ПО РеализацияТоваровУслуг.Контрагент = Контрагенты.Ссылка
	|		ПО ТаблицаТовары.Ссылка = РеализацияТоваровУслуг.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО ТаблицаТовары.Номенклатура = СправочникНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
	|		ПО ТаблицаТовары.ЕдиницаИзмерения = КлассификаторЕдиницИзмерения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО (РеализацияТоваровУслуг.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтавкиНДС КАК СтавкиНДС
	|		ПО ТаблицаТовары.СтавкаНДС = СтавкиНДС.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтавкиАкциза КАК СтавкиАкциза
	|		ПО (РеализацияТоваровУслуг.УчитыватьАкциз)
	|			И ТаблицаТовары.СтавкаАкциза = СтавкиАкциза.Ссылка
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка В(&МассивДокументов)
	|	И РеализацияТоваровУслуг.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРеализацияТоваров.ПередачаСтруктурномуПодразделению)";
	
	
	Если Не ПервыйЗапрос Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПОМЕСТИТЬ вт_ДанныеДокумента", "");	
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РАЗРЕШЕННЫЕ", "");
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции	

Функция ТекстЗапросаВозвратТоваровПоставщику(ПервыйЗапрос = Истина)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВозвратТоваровПоставщику.Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК ОрганизацияПолучатель,
	|	ВозвратТоваровПоставщику.СтруктурноеПодразделение КАК СтруктурноеПодразделение,
	|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК СтруктурноеПодразделениеПолучатель,
	|	ВЫБОР
	|		КОГДА НЕ ВозвратТоваровПоставщику.СтруктурноеПодразделение.УказыватьРеквизитыГоловнойОрганизации
	|			ТОГДА ВозвратТоваровПоставщику.СтруктурноеПодразделение
	|		КОГДА ВозвратТоваровПоставщику.Организация.УказыватьРеквизитыГоловнойОрганизацииВСчетеФактуре
	|			ТОГДА ОрганизацияГоловная.Ссылка
	|		ИНАЧЕ ВозвратТоваровПоставщику.Организация
	|	КОНЕЦ КАК Поставщик,
	|	ВЫБОР
	|		КОГДА Контрагенты.УказыватьРеквизитыГоловнойОрганизацииВСчетеФактуре
	|			ТОГДА КонтрагентыГоловная.Ссылка
	|		ИНАЧЕ ВозвратТоваровПоставщику.Контрагент
	|	КОНЕЦ КАК Контрагент,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыСНТ.ВозвратТоваров) КАК ТипСНТ,
	|	ВЫБОР
	|		КОГДА КлассификаторСтранМира.КодАльфа2 = ""KZ""
	|				ИЛИ КлассификаторСтранМира.КодАльфа2 ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСНТ.Реализация)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСНТ.Вывоз)
	|	КОНЕЦ КАК ВидОперации,
	|	ВЫБОР
	|		КОГДА КлассификаторСтранМира.КодАльфа2 = ""KZ""
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыВывозаСНТ.ПустаяСсылка)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыВывозаСНТ.Экспорт)
	|	КОНЕЦ КАК ВидВывоза,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыВвозаСНТ.ПустаяСсылка) КАК ВидВвоза,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыПеремещенияСНТ.ПустаяСсылка) КАК ВидПеремещения,
	|	ВЫБОР
	|		КОГДА Контрагенты.УказыватьРеквизитыГоловнойОрганизацииВСчетеФактуре
	|			ТОГДА КонтрагентыГоловная.Ссылка
	|		ИНАЧЕ ВозвратТоваровПоставщику.Контрагент
	|	КОНЕЦ КАК Получатель,
	|	ВозвратТоваровПоставщику.Дата КАК ДатаОтгрузкиТовара,
	|	ТаблицаТовары.Ссылка КАК ДокументОснование,
	|	ВозвратТоваровПоставщику.ВалютаДокумента КАК Валюта,
	|	ВозвратТоваровПоставщику.ВалютаДокумента.БуквенныйКод КАК ВалютаКод,
	|	ВозвратТоваровПоставщику.КурсВзаиморасчетов КАК КурсВалюты,
	|	ВозвратТоваровПоставщику.Склад КАК СкладОтправитель,
	|	ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка) КАК СкладПолучатель,
	|	ТаблицаТовары.Номенклатура КАК Товар,
	|	СправочникНоменклатура.НаименованиеПолное КАК ТоварНаименование,
	|	СправочникНоменклатура.КодТНВЭД КАК КодТНВЭД,
	|	ТаблицаТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	КлассификаторЕдиницИзмерения.КодЭСФ КАК ЕдиницаИзмеренияКод,
	|	ТаблицаТовары.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА ВозвратТоваровПоставщику.УчитыватьНДС
	|				И ВозвратТоваровПоставщику.СуммаВключаетНДС
	|			ТОГДА ВЫРАЗИТЬ((ТаблицаТовары.Сумма - ТаблицаТовары.СуммаНДС) / ТаблицаТовары.Количество КАК ЧИСЛО(14, 2))
	|		ИНАЧЕ ВЫРАЗИТЬ(ТаблицаТовары.Цена КАК ЧИСЛО(14, 2))
	|	КОНЕЦ КАК Цена,
	|	""5"" КАК ПризнакПроисхождения,
	|	"""" КАК НомерЗаявленияВРамкахТС,
	|	"""" КАК ИдентификаторТовара,
	|	"""" КАК НомерПозицииВДекларацииИлиЗаявлении,
	|	ЗНАЧЕНИЕ(Справочник.ИсточникиПроисхождения.ПустаяСсылка) КАК ИсточникПроисхождения,
	|	""Товары"" КАК ИмяТабличнойЧасти,
	|	""ВозвратТоваровПоставщику"" КАК ИмяДокумента,
	|	ЛОЖЬ КАК ЗапрещеноРазбиватьДокумент,
	|	ИСТИНА КАК РаспределятьТоварыПоИП,
	|	"""" КАК ПрефиксВидаДокумента,
	|	"""" КАК НомерУчетногоДокумента,
	|	"""" КАК НомерПакета,
	|	ЗНАЧЕНИЕ(Справочник.СтавкиАкциза.ПустаяСсылка) КАК СтавкаАкциза,
	|	0 КАК СуммаАкциза,
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.СтавкаНДС <> ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка)
	|			ТОГДА ТаблицаТовары.СтавкаНДС.ДляОсвобожденногоОборота
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК БезНДС,
	|	ВЫБОР
	|		КОГДА ВозвратТоваровПоставщику.УчитыватьНДС
	|			ТОГДА ТаблицаТовары.СтавкаНДС
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка)
	|	КОНЕЦ КАК СтавкаНДС,
	|	ТаблицаТовары.СуммаНДС КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА ВозвратТоваровПоставщику.УчитыватьНДС
	|				И ВозвратТоваровПоставщику.СуммаВключаетНДС
	|			ТОГДА ТаблицаТовары.Сумма - ТаблицаТовары.СуммаНДС
	|		ИНАЧЕ ТаблицаТовары.Сумма
	|	КОНЕЦ КАК ОборотПоРеализации,
	|	ВЫБОР
	|		КОГДА ВозвратТоваровПоставщику.УчитыватьНДС
	|				И ВозвратТоваровПоставщику.СуммаВключаетНДС
	|			ТОГДА ТаблицаТовары.Сумма - ТаблицаТовары.СуммаНДС
	|		ИНАЧЕ ТаблицаТовары.Сумма
	|	КОНЕЦ КАК СуммаБезНалогов,
	|	ВЫБОР
	|		КОГДА ВозвратТоваровПоставщику.УчитыватьНДС
	|				И ВозвратТоваровПоставщику.СуммаВключаетНДС
	|			ТОГДА ТаблицаТовары.Сумма
	|		ИНАЧЕ ТаблицаТовары.Сумма + ТаблицаТовары.СуммаНДС
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР
	|		КОГДА НЕ ВозвратТоваровПоставщику.СтруктурноеПодразделение.УказыватьРеквизитыГоловнойОрганизации
	|			ТОГДА ЕСТЬNULL(ВозвратТоваровПоставщику.СтруктурноеПодразделение.ИдентификационныйНомер, """")
	|		КОГДА ВозвратТоваровПоставщику.Организация.УказыватьРеквизитыГоловнойОрганизацииВСчетеФактуре
	|			ТОГДА ЕСТЬNULL(ОрганизацияГоловная.ИдентификационныйНомер, """")
	|		ИНАЧЕ ЕСТЬNULL(Организации.ИдентификационныйНомер, """")
	|	КОНЕЦ КАК ПоставщикИдентификатор,
	|	ВЫБОР
	|		КОГДА НЕ ВозвратТоваровПоставщику.СтруктурноеПодразделение.УказыватьРеквизитыГоловнойОрганизации
	|			ТОГДА ЕСТЬNULL(ВЫРАЗИТЬ(ВозвратТоваровПоставщику.СтруктурноеПодразделение.НаименованиеПолное КАК СТРОКА(200)), """")
	|		КОГДА ВозвратТоваровПоставщику.Организация.УказыватьРеквизитыГоловнойОрганизацииВСчетеФактуре
	|			ТОГДА ЕСТЬNULL(ВЫРАЗИТЬ(ОрганизацияГоловная.НаименованиеПолное КАК СТРОКА(200)), """")
	|		ИНАЧЕ ЕСТЬNULL(ВЫРАЗИТЬ(Организации.НаименованиеПолное КАК СТРОКА(200)), """")
	|	КОНЕЦ КАК ПоставщикНаименование,
	|	ВЫБОР
	|		КОГДА ВозвратТоваровПоставщику.СтруктурноеПодразделение.УказыватьРеквизитыГоловнойОрганизации
	|			ТОГДА ЕСТЬNULL(ВозвратТоваровПоставщику.СтруктурноеПодразделение.ИдентификационныйНомер, """")
	|		КОГДА ВозвратТоваровПоставщику.Организация.УказыватьРеквизитыГоловнойОрганизацииВСчетеФактуре
	|			ТОГДА ЕСТЬNULL(Организации.ИдентификационныйНомер, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ПоставщикБИНСтруктурногоПодразделения,
	|	ВЫБОР
	|		КОГДА Контрагенты.УказыватьРеквизитыГоловнойОрганизацииВСчетеФактуре
	|			ТОГДА ЕСТЬNULL(Контрагенты.ИдентификационныйКодЛичности, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ПолучательБИНСтруктурногоПодразделения,
	|	ЛОЖЬ КАК ПоставщикНерезидент,
	|	ЛОЖЬ КАК ПоставщикРозничнаяРеализация,
	|	ЛОЖЬ КАК ПоставщикМалаяТорговаяТочка,
	|	""KZ"" КАК ПоставщикКодСтраны,
	|	""KZ"" КАК ПоставщикКодСтраныОтправки,
	|	ВЫБОР
	|		КОГДА НЕ ВозвратТоваровПоставщику.СтруктурноеПодразделение.УказыватьРеквизитыГоловнойОрганизации
	|			ТОГДА ВозвратТоваровПоставщику.СтруктурноеПодразделение
	|		ИНАЧЕ ВозвратТоваровПоставщику.Организация
	|	КОНЕЦ КАК Грузоотправитель,
	|	ВЫБОР
	|		КОГДА НЕ ВозвратТоваровПоставщику.СтруктурноеПодразделение.УказыватьРеквизитыГоловнойОрганизации
	|			ТОГДА ЕСТЬNULL(ВЫРАЗИТЬ(ВозвратТоваровПоставщику.СтруктурноеПодразделение.НаименованиеПолное КАК СТРОКА(200)), """")
	|		ИНАЧЕ ЕСТЬNULL(ВЫРАЗИТЬ(Организации.НаименованиеПолное КАК СТРОКА(200)), """")
	|	КОНЕЦ КАК ГрузоотправительНаименование,
	|	ВЫБОР
	|		КОГДА НЕ ВозвратТоваровПоставщику.СтруктурноеПодразделение.УказыватьРеквизитыГоловнойОрганизации
	|			ТОГДА ЕСТЬNULL(ВозвратТоваровПоставщику.СтруктурноеПодразделение.ИдентификационныйНомер, """")
	|		ИНАЧЕ ЕСТЬNULL(Организации.ИдентификационныйНомер, """")
	|	КОНЕЦ КАК ГрузоотправительИдентификатор,
	|	ЛОЖЬ КАК ГрузоотправительНерезидент,
	|	ВЫБОР
	|		КОГДА ВозвратТоваровПоставщику.Грузополучатель <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ВозвратТоваровПоставщику.Грузополучатель
	|		ИНАЧЕ Контрагенты.Ссылка
	|	КОНЕЦ КАК Грузополучатель,
	|	ВЫБОР
	|		КОГДА ВозвратТоваровПоставщику.Грузополучатель <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|					КОГДА (ВЫРАЗИТЬ(Грузополучатели.НаименованиеПолное КАК СТРОКА(200))) <> """"""""
	|						ТОГДА ВЫРАЗИТЬ(Грузополучатели.НаименованиеПолное КАК СТРОКА(200))
	|					ИНАЧЕ Грузополучатели.Наименование
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА (ВЫРАЗИТЬ(Контрагенты.НаименованиеПолное КАК СТРОКА(200))) <> """"""""
	|					ТОГДА ВЫРАЗИТЬ(Контрагенты.НаименованиеПолное КАК СТРОКА(200))
	|				ИНАЧЕ Контрагенты.Наименование
	|			КОНЕЦ
	|	КОНЕЦ КАК ГрузополучательНаименование,
	|	ВЫБОР
	|		КОГДА ВозвратТоваровПоставщику.Грузополучатель <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(Грузополучатели.ИдентификационныйКодЛичности, """")
	|		ИНАЧЕ ЕСТЬNULL(Контрагенты.ИдентификационныйКодЛичности, """")
	|	КОНЕЦ КАК ГрузополучательИдентификатор,
	|	ВЫБОР
	|		КОГДА КлассификаторСтранМира.КодАльфа2 <> ""KZ""
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ГрузополучательНерезидент,
	|	""KZ"" КАК ГрузоотправительКодСтраныОтправки,
	|	ВЫБОР
	|		КОГДА Контрагенты.УказыватьРеквизитыГоловнойОрганизацииВСчетеФактуре
	|			ТОГДА ЕСТЬNULL(КонтрагентыГоловная.ИдентификационныйКодЛичности, """")
	|		ИНАЧЕ ЕСТЬNULL(Контрагенты.ИдентификационныйКодЛичности, """")
	|	КОНЕЦ КАК ПолучательИдентификатор,
	|	ВЫБОР
	|		КОГДА Контрагенты.УказыватьРеквизитыГоловнойОрганизацииВСчетеФактуре
	|			ТОГДА ВЫБОР
	|					КОГДА (ВЫРАЗИТЬ(КонтрагентыГоловная.НаименованиеПолное КАК СТРОКА(200))) <> """"""""
	|						ТОГДА ВЫРАЗИТЬ(КонтрагентыГоловная.НаименованиеПолное КАК СТРОКА(200))
	|					ИНАЧЕ КонтрагентыГоловная.Наименование
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА (ВЫРАЗИТЬ(Контрагенты.НаименованиеПолное КАК СТРОКА(200))) <> """"""""
	|					ТОГДА ВЫРАЗИТЬ(Контрагенты.НаименованиеПолное КАК СТРОКА(200))
	|				ИНАЧЕ Контрагенты.Наименование
	|			КОНЕЦ
	|	КОНЕЦ КАК ПолучательНаименование,
	|	КлассификаторСтранМира.КодАльфа2 КАК ПолучательКодСтраны,
	|	КлассификаторСтранМира.КодАльфа2 КАК ПолучательКодСтраныДоставки,
	|	КлассификаторСтранМира.КодАльфа2 КАК ГрузополучательКодСтраныОтправки,
	|	ВЫБОР
	|		КОГДА КлассификаторСтранМира.КодАльфа2 <> ""KZ""
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПолучательНерезидент,
	|	ЛОЖЬ КАК ПолучательРозничнаяРеализация,
	|	ВозвратТоваровПоставщику.Контрагент.МалаяТорговаяТочка КАК ПолучательМалаяТорговаяТочка,
	|	ЛОЖЬ КАК ПолучательРозничныйРеализатор,
	|	"""" КАК АдресДоставки,
	|	"""" КАК АдресОтправки,
	|	ВозвратТоваровПоставщику.ДоговорКонтрагента КАК ДоговорПоставки,
	|	ВЫБОР
	|		КОГДА ДоговорыКонтрагентов.НомерДоговора <> """"""""
	|				И ДоговорыКонтрагентов.ДатаДоговора <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК БезДоговора,
	|	"""" КАК УникальныйНомерВалютногоКонтроля,
	|	ЛОЖЬ КАК УчитыватьАкциз,
	|	ВозвратТоваровПоставщику.УчитыватьНДС КАК УчитыватьНДС,
	|	ВозвратТоваровПоставщику.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ЛОЖЬ КАК СуммаВключаетАкциз,
	|	ДоговорыКонтрагентов.НомерДоговора КАК ДоговорПоставкиНомер,
	|	ДоговорыКонтрагентов.ДатаДоговора КАК ДоговорПоставкиДата,
	|	ДоговорыКонтрагентов.УсловияОплаты КАК ДоговорПоставкиУсловияОплаты,
	|	ДоговорыКонтрагентов.УсловияПоставки КАК ДоговорПоставкиУсловияПоставки,
	|	ВозвратТоваровПоставщику.ДокументОснование КАК ПервичныйДокументОснование,
	|	&ЭтоИсправленнаяСНТ КАК ЭтоИсправленнаяСНТ,
	|	ВЫБОР
	|		КОГДА ВозвратТоваровПоставщику.УчитыватьНДС
	|			ТОГДА СтавкиНДС.Ставка
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СтавкаНДСЧисло,
	|	0 КАК СтавкаАкцизаЧисло,
	|	ВЫБОР
	|		КОГДА ВозвратТоваровПоставщику.Контрагент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	|				И НЕ ВозвратТоваровПоставщику.Контрагент.ИндивидуальныйПредпринимательАдвокатЧастныйНотариус
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПолучательФизическоеЛицо,
	|	ЛОЖЬ КАК ПоставщикФизическоеЛицо,
	|	НЕОПРЕДЕЛЕНО КАК НомерДоверенностиОтпуск,
	|	НЕОПРЕДЕЛЕНО КАК ДатаДоверенностиОтпуск,
	|	ЛОЖЬ КАК ПолучательУчастникСРП,
	|	ЛОЖЬ КАК ПолучательУчастникСовместнойДеятельности,
	|	ТаблицаТовары.НомерСтроки КАК НомерСтроки,
	|	ВЫРАЗИТЬ(СправочникНоменклатура.ВесНетто * ТаблицаТовары.Количество КАК ЧИСЛО(15, 3)) КАК ВесНетто
	|ПОМЕСТИТЬ вт_ДанныеДокумента
	|ИЗ
	|	Документ.ВозвратТоваровПоставщику.Товары КАК ТаблицаТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровПоставщику КАК ВозвратТоваровПоставщику
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК ОрганизацияГоловная
	|				ПО Организации.ГоловнаяОрганизация = ОрганизацияГоловная.Ссылка
	|			ПО ВозвратТоваровПоставщику.Организация = Организации.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Грузополучатели
	|			ПО ВозвратТоваровПоставщику.Грузополучатель = Грузополучатели.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК КонтрагентыГоловная
	|				ПО Контрагенты.ГоловнойКонтрагент = КонтрагентыГоловная.Ссылка
	|			ПО ВозвратТоваровПоставщику.Контрагент = Контрагенты.Ссылка
	|		ПО ТаблицаТовары.Ссылка = ВозвратТоваровПоставщику.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК КлассификаторСтранМира
	|		ПО (Контрагенты.СтранаРезидентства = КлассификаторСтранМира.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО ТаблицаТовары.Номенклатура = СправочникНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
	|		ПО ТаблицаТовары.ЕдиницаИзмерения = КлассификаторЕдиницИзмерения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО (ВозвратТоваровПоставщику.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтавкиНДС КАК СтавкиНДС
	|		ПО ТаблицаТовары.СтавкаНДС = СтавкиНДС.Ссылка
	|ГДЕ
	|	ВозвратТоваровПоставщику.Ссылка В(&МассивДокументов)";

	
	Если Не ПервыйЗапрос Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПОМЕСТИТЬ вт_ДанныеДокумента", "");	
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РАЗРЕШЕННЫЕ", "");
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

// ВозвратТоваровОтПокупателя.Организация - соответствует нашей организации
// ВозвратТоваровОтПокупателя.Контрагент - соответсвует розничной выручке
Функция ТекстЗапросаВозвратТоваровОтПокупателей(ПервыйЗапрос = Истина)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВозвратТоваровОтПокупателя.Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК ОрганизацияПолучатель,	
	|	ВозвратТоваровОтПокупателя.СтруктурноеПодразделение КАК СтруктурноеПодразделение,
	|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК СтруктурноеПодразделениеПолучатель,
	|	ВозвратТоваровОтПокупателя.Контрагент КАК Поставщик,
	|	ВозвратТоваровОтПокупателя.Контрагент КАК Контрагент,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыСНТ.ВозвратТоваров) КАК ТипСНТ,
	|	ВЫБОР
	|		КОГДА КлассификаторСтранМира.КодАльфа2 = ""KZ""
	|				ИЛИ КлассификаторСтранМира.КодАльфа2 ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСНТ.ПустаяСсылка)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСНТ.Ввоз)
	|	КОНЕЦ КАК ВидОперации,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыВывозаСНТ.ПустаяСсылка) КАК ВидВывоза,
	|	ВЫБОР
	|		КОГДА КлассификаторСтранМира.КодАльфа2 = ""KZ""
	|				ИЛИ КлассификаторСтранМира.КодАльфа2 ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыВвозаСНТ.ПустаяСсылка)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыВвозаСНТ.Импорт)
	|	КОНЕЦ КАК ВидВвоза,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыПеремещенияСНТ.ПустаяСсылка) КАК ВидПеремещения,
	|	ВЫБОР
	|		КОГДА НЕ ВозвратТоваровОтПокупателя.СтруктурноеПодразделение.УказыватьРеквизитыГоловнойОрганизации
	|			ТОГДА ВозвратТоваровОтПокупателя.СтруктурноеПодразделение
	|		КОГДА ВозвратТоваровОтПокупателя.Организация.УказыватьРеквизитыГоловнойОрганизацииВСчетеФактуре
	|			ТОГДА ОрганизацияГоловная.Ссылка
	|		ИНАЧЕ ВозвратТоваровОтПокупателя.Организация
	|	КОНЕЦ КАК Получатель,
	|	ВозвратТоваровОтПокупателя.Дата КАК ДатаОтгрузкиТовара,
	|	ТаблицаТовары.Ссылка КАК ДокументОснование,
	|	ВозвратТоваровОтПокупателя.ВалютаДокумента КАК Валюта,
	|	ВозвратТоваровОтПокупателя.ВалютаДокумента.БуквенныйКод КАК ВалютаКод,
	|	ВозвратТоваровОтПокупателя.КурсВзаиморасчетов КАК КурсВалюты,
	|	ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка) КАК СкладОтправитель,
	|	ВозвратТоваровОтПокупателя.Склад КАК СкладПолучатель,
	|	ТаблицаТовары.Номенклатура КАК Товар,
	|	СправочникНоменклатура.НаименованиеПолное КАК ТоварНаименование,
	|	СправочникНоменклатура.КодТНВЭД КАК КодТНВЭД,
	|	ТаблицаТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	КлассификаторЕдиницИзмерения.КодЭСФ КАК ЕдиницаИзмеренияКод,
	|	ТаблицаТовары.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА ВозвратТоваровОтПокупателя.УчитыватьНДС
	|				И ВозвратТоваровОтПокупателя.СуммаВключаетНДС
	|			ТОГДА ВЫБОР
	|					КОГДА ВозвратТоваровОтПокупателя.УчитыватьАкциз
	|							И ВозвратТоваровОтПокупателя.СуммаВключаетАкциз
	|						ТОГДА ВЫРАЗИТЬ((ТаблицаТовары.Сумма - ТаблицаТовары.СуммаАкциза - ТаблицаТовары.СуммаНДС) / ТаблицаТовары.Количество КАК ЧИСЛО(14,2))
	|					ИНАЧЕ ВЫРАЗИТЬ((ТаблицаТовары.Сумма - ТаблицаТовары.СуммаНДС) / ТаблицаТовары.Количество КАК ЧИСЛО(14,2))
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВозвратТоваровОтПокупателя.УчитыватьАкциз
	|						И ВозвратТоваровОтПокупателя.СуммаВключаетАкциз
	|					ТОГДА ВЫРАЗИТЬ((ТаблицаТовары.Сумма - ТаблицаТовары.СуммаАкциза) / ТаблицаТовары.Количество КАК ЧИСЛО(14,2))
	|				ИНАЧЕ ВЫРАЗИТЬ(ТаблицаТовары.Цена КАК ЧИСЛО(14,2))
	|			КОНЕЦ
	|	КОНЕЦ КАК Цена,
	|	""5"" КАК ПризнакПроисхождения,
	|	"""" КАК НомерЗаявленияВРамкахТС,
	|	"""" КАК ИдентификаторТовара,
	|	"""" КАК НомерПозицииВДекларацииИлиЗаявлении,
	|	ЗНАЧЕНИЕ(Справочник.ИсточникиПроисхождения.ПустаяСсылка) КАК ИсточникПроисхождения,
	|	""Товары"" КАК ИмяТабличнойЧасти,
	|	""ВозвратТоваровОтПокупателя"" КАК ИмяДокумента,
	|	ЛОЖЬ КАК ЗапрещеноРазбиватьДокумент,
	|	ИСТИНА КАК РаспределятьТоварыПоИП,
	|	"""" КАК ПрефиксВидаДокумента,
	|	"""" КАК НомерУчетногоДокумента,
	|	"""" КАК НомерПакета,
	|	ТаблицаТовары.СтавкаАкциза КАК СтавкаАкциза,
	|	ТаблицаТовары.СуммаАкциза КАК СуммаАкциза,
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.СтавкаНДС <> ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка)
	|			ТОГДА ТаблицаТовары.СтавкаНДС.ДляОсвобожденногоОборота
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК БезНДС,
	|	ВЫБОР
	|		КОГДА ВозвратТоваровОтПокупателя.УчитыватьНДС
	|			ТОГДА ТаблицаТовары.СтавкаНДС
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка)
	|	КОНЕЦ КАК СтавкаНДС,
	|	ТаблицаТовары.СуммаНДС КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА ВозвратТоваровОтПокупателя.УчитыватьНДС
	|				И ВозвратТоваровОтПокупателя.СуммаВключаетНДС
	|			ТОГДА ВЫБОР
	|					КОГДА ВозвратТоваровОтПокупателя.УчитыватьАкциз
	|							И ВозвратТоваровОтПокупателя.СуммаВключаетАкциз
	|						ТОГДА ТаблицаТовары.Сумма - ТаблицаТовары.СуммаНДС
	|					ИНАЧЕ ТаблицаТовары.Сумма - ТаблицаТовары.СуммаНДС + ТаблицаТовары.СуммаАкциза
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВозвратТоваровОтПокупателя.УчитыватьАкциз
	|						И ВозвратТоваровОтПокупателя.СуммаВключаетАкциз
	|					ТОГДА ТаблицаТовары.Сумма
	|				ИНАЧЕ ТаблицаТовары.Сумма + ТаблицаТовары.СуммаАкциза
	|			КОНЕЦ
	|	КОНЕЦ КАК ОборотПоРеализации,
	|	ВЫБОР
	|		КОГДА ВозвратТоваровОтПокупателя.УчитыватьНДС
	|				И ВозвратТоваровОтПокупателя.СуммаВключаетНДС
	|			ТОГДА ВЫБОР
	|					КОГДА ВозвратТоваровОтПокупателя.УчитыватьАкциз
	|							И ВозвратТоваровОтПокупателя.СуммаВключаетАкциз
	|						ТОГДА ТаблицаТовары.Сумма - ТаблицаТовары.СуммаАкциза - ТаблицаТовары.СуммаНДС
	|					ИНАЧЕ ТаблицаТовары.Сумма - ТаблицаТовары.СуммаНДС
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВозвратТоваровОтПокупателя.УчитыватьАкциз
	|						И ВозвратТоваровОтПокупателя.СуммаВключаетАкциз
	|					ТОГДА ТаблицаТовары.Сумма - ТаблицаТовары.СуммаАкциза
	|				ИНАЧЕ ТаблицаТовары.Сумма
	|			КОНЕЦ
	|	КОНЕЦ КАК СуммаБезНалогов,
	|	ВЫБОР
	|		КОГДА ВозвратТоваровОтПокупателя.УчитыватьНДС
	|				И ВозвратТоваровОтПокупателя.СуммаВключаетНДС
	|			ТОГДА ВЫБОР
	|					КОГДА ВозвратТоваровОтПокупателя.УчитыватьАкциз
	|							И ВозвратТоваровОтПокупателя.СуммаВключаетАкциз
	|						ТОГДА ТаблицаТовары.Сумма
	|					ИНАЧЕ ТаблицаТовары.Сумма + ТаблицаТовары.СуммаАкциза
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВозвратТоваровОтПокупателя.УчитыватьАкциз
	|						И ВозвратТоваровОтПокупателя.СуммаВключаетАкциз
	|					ТОГДА ТаблицаТовары.Сумма + ТаблицаТовары.СуммаНДС
	|				ИНАЧЕ ТаблицаТовары.Сумма + ТаблицаТовары.СуммаНДС + ТаблицаТовары.СуммаАкциза
	|			КОНЕЦ
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР
	|		КОГДА Контрагенты.ИдентификационныйКодЛичности <> """"
	|			ТОГДА Контрагенты.ИдентификационныйКодЛичности
	|		КОГДА КлассификаторСтранМира.КодАльфа2 <> ""KZ""
	|				И КлассификаторСтранМира.УчастникТаможенногоСоюза <> ЗНАЧЕНИЕ(Справочник.СтраныУчастникиТаможенногоСоюза.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(Контрагенты.НомерНалоговойРегистрацииВСтранеРезидентства, """")// ЕРП - РегистрационныйНомер
	|		КОГДА КлассификаторСтранМира.КодАльфа2 <> ""KZ""
	|				И КлассификаторСтранМира.УчастникТаможенногоСоюза = ЗНАЧЕНИЕ(Справочник.СтраныУчастникиТаможенногоСоюза.ПустаяСсылка)
	|			ТОГДА """"
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ПоставщикИдентификатор,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(Контрагенты.НаименованиеПолное КАК СТРОКА(200))) <> """"
	|			ТОГДА ВЫРАЗИТЬ(Контрагенты.НаименованиеПолное КАК СТРОКА(200))
	|		ИНАЧЕ ""Розничная реализация""
	|	КОНЕЦ КАК ПоставщикНаименование,
//БК 3 
	//|	ВЫБОР
	//|		КОГДА (ВЫРАЗИТЬ(Контрагенты.НаименованиеПолное КАК СТРОКА(200))) <> """"
	//|			ТОГДА ВЫРАЗИТЬ(Контрагенты.НаименованиеПолное КАК СТРОКА(200))
	//|		ИНАЧЕ 
	//|			ВЫБОР 
	//|           	КОГДА ВозвратТоваровОтПокупателя.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВозвратТоваровОтПокупателя.ВозвратРозничнойПродажи) 
	//|               ТОГДА ""Розничная реализация""
	//|				ИНАЧЕ """" 
	//|			КОНЕЦ
	//|	КОНЕЦ КАК ПоставщикНаименование,
//БК 3	
	|	КлассификаторСтранМира.КодАльфа2 КАК ПоставщикКодСтраны,
	|	КлассификаторСтранМира.КодАльфа2 КАК ПоставщикКодСтраныОтправки,
	|	ВЫБОР
	|		КОГДА КлассификаторСтранМира.КодАльфа2 <> ""KZ""
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПоставщикНерезидент,
	|	КлассификаторСтранМира.КодАльфа2 КАК ГрузоотправительКодСтраныОтправки,
	|	ВозвратТоваровОтПокупателя.Контрагент КАК Грузоотправитель,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(Контрагенты.НаименованиеПолное КАК СТРОКА(200))) <> """"
	|			ТОГДА ВЫРАЗИТЬ(Контрагенты.НаименованиеПолное КАК СТРОКА(200))
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ГрузоотправительНаименование,
	|	ВЫБОР
	|		КОГДА Контрагенты.ИдентификационныйКодЛичности <> """"
	|			ТОГДА Контрагенты.ИдентификационныйКодЛичности
	|		КОГДА КлассификаторСтранМира.КодАльфа2 <> ""KZ""
	|				И КлассификаторСтранМира.УчастникТаможенногоСоюза <> ЗНАЧЕНИЕ(Справочник.СтраныУчастникиТаможенногоСоюза.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(Контрагенты.НомерНалоговойРегистрацииВСтранеРезидентства, """")// ЕРП - РегистрационныйНомер
	|		КОГДА КлассификаторСтранМира.КодАльфа2 <> ""KZ""
	|				И КлассификаторСтранМира.УчастникТаможенногоСоюза = ЗНАЧЕНИЕ(Справочник.СтраныУчастникиТаможенногоСоюза.ПустаяСсылка)
	|			ТОГДА """"
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ГрузоотправительИдентификатор,
	|	ВЫБОР
	|		КОГДА КлассификаторСтранМира.КодАльфа2 <> ""KZ""
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ГрузоотправительНерезидент,
	|	ВЫБОР
	|		КОГДА НЕ ВозвратТоваровОтПокупателя.СтруктурноеПодразделение.УказыватьРеквизитыГоловнойОрганизации
	|			ТОГДА ВозвратТоваровОтПокупателя.СтруктурноеПодразделение
	|		ИНАЧЕ ВозвратТоваровОтПокупателя.Организация
	|	КОНЕЦ КАК Грузополучатель,
	|	ВЫБОР
	|		КОГДА НЕ ВозвратТоваровОтПокупателя.СтруктурноеПодразделение.УказыватьРеквизитыГоловнойОрганизации
	|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ВозвратТоваровОтПокупателя.СтруктурноеПодразделение.НаименованиеПолное, """") КАК СТРОКА(200))
	|		ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(Организации.НаименованиеПолное, """") КАК СТРОКА(200))
	|	КОНЕЦ КАК ГрузополучательНаименование,
	|	ВЫБОР
	|		КОГДА НЕ ВозвратТоваровОтПокупателя.СтруктурноеПодразделение.УказыватьРеквизитыГоловнойОрганизации
	|			ТОГДА ЕСТЬNULL(ВозвратТоваровОтПокупателя.СтруктурноеПодразделение.ИдентификационныйНомер, """")
	|		ИНАЧЕ ЕСТЬNULL(Организации.ИдентификационныйНомер, """")
	|	КОНЕЦ КАК ГрузополучательИдентификатор,
	|	ЛОЖЬ КАК ГрузополучательНерезидент,
	|	ВЫБОР
	|		КОГДА НЕ ВозвратТоваровОтПокупателя.СтруктурноеПодразделение.УказыватьРеквизитыГоловнойОрганизации
	|			ТОГДА ЕСТЬNULL(ВозвратТоваровОтПокупателя.СтруктурноеПодразделение.ИдентификационныйНомер, """")
	|		КОГДА ВозвратТоваровОтПокупателя.Организация.УказыватьРеквизитыГоловнойОрганизацииВСчетеФактуре
	|			ТОГДА ЕСТЬNULL(ОрганизацияГоловная.ИдентификационныйНомер, """")
	|		ИНАЧЕ ЕСТЬNULL(Организации.ИдентификационныйНомер, """")
	|	КОНЕЦ КАК ПолучательИдентификатор,
	|	ВЫБОР
	|		КОГДА НЕ ВозвратТоваровОтПокупателя.СтруктурноеПодразделение.УказыватьРеквизитыГоловнойОрганизации
	|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ВозвратТоваровОтПокупателя.СтруктурноеПодразделение.НаименованиеПолное, """") КАК СТРОКА(200))
	|		КОГДА ВозвратТоваровОтПокупателя.Организация.УказыватьРеквизитыГоловнойОрганизацииВСчетеФактуре
	|			ТОГДА ЕСТЬNULL(ВЫРАЗИТЬ(ОрганизацияГоловная.НаименованиеПолное КАК СТРОКА(200)), """")
	|		ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(Организации.НаименованиеПолное, """") КАК СТРОКА(200))
	|	КОНЕЦ КАК ПолучательНаименование,
	|	ВЫБОР
	|		КОГДА ВозвратТоваровОтПокупателя.СтруктурноеПодразделение.УказыватьРеквизитыГоловнойОрганизации
	|			ТОГДА ЕСТЬNULL(ВозвратТоваровОтПокупателя.СтруктурноеПодразделение.ИдентификационныйНомер, """")
	|		КОГДА ВозвратТоваровОтПокупателя.Организация.УказыватьРеквизитыГоловнойОрганизацииВСчетеФактуре
	|			ТОГДА ЕСТЬNULL(Организации.ИдентификационныйНомер, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ПолучательБИНСтруктурногоПодразделения,
	|	"""" КАК ПоставщикБИНСтруктурногоПодразделения,
	|	""KZ"" КАК ПолучательКодСтраны,
	|	""KZ"" КАК ПолучательКодСтраныДоставки,
	|	""KZ"" КАК ГрузополучательКодСтраныОтправки,
	|	ЛОЖЬ КАК ПолучательНерезидент,
	|	"""" КАК АдресДоставки,
	|	"""" КАК АдресОтправки,
	|	ВЫБОР
	|		КОГДА ДоговорыКонтрагентов.НомерДоговора <> """"""""
	|				И ДоговорыКонтрагентов.ДатаДоговора <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК БезДоговора,
	|	ВозвратТоваровОтПокупателя.ДоговорКонтрагента КАК ДоговорПоставки,
	|	"""" КАК УникальныйНомерВалютногоКонтроля,
	|	ВозвратТоваровОтПокупателя.УчитыватьАкциз,
	|	ВозвратТоваровОтПокупателя.УчитыватьНДС КАК УчитыватьНДС,
	|	ВозвратТоваровОтПокупателя.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ЛОЖЬ КАК СуммаВключаетАкциз,
	|	ДоговорыКонтрагентов.НомерДоговора КАК ДоговорПоставкиНомер,
	|	ДоговорыКонтрагентов.ДатаДоговора КАК ДоговорПоставкиДата,
	|	ДоговорыКонтрагентов.УсловияОплаты КАК ДоговорПоставкиУсловияОплаты,
	|	ДоговорыКонтрагентов.УсловияПоставки КАК ДоговорПоставкиУсловияПоставки,
	|	ВозвратТоваровОтПокупателя.ДокументОснование КАК ПервичныйДокументОснование,
	|	&ЭтоИсправленнаяСНТ КАК ЭтоИсправленнаяСНТ,
	|	ВЫБОР
	|		КОГДА ВозвратТоваровОтПокупателя.УчитыватьНДС
	|			ТОГДА СтавкиНДС.Ставка
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СтавкаНДСЧисло,
	|	ЕСТЬNULL(СтавкиАкциза.Ставка, 0) КАК СтавкаАкцизаЧисло,
	|	ВЫБОР
	|		КОГДА ВозвратТоваровОтПокупателя.Контрагент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	|				И НЕ ВозвратТоваровОтПокупателя.Контрагент.ИндивидуальныйПредпринимательАдвокатЧастныйНотариус
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПоставщикФизическоеЛицо,
	|	ЛОЖЬ КАК ПолучательФизическоеЛицо,
	|	ЛОЖЬ КАК ПолучательРозничнаяРеализация,
	|	ЛОЖЬ КАК ПолучательРозничныйРеализатор,
	|	ВозвратТоваровОтПокупателя.Контрагент.МалаяТорговаяТочка КАК ПолучательМалаяТорговаяТочка,
	|	ЛОЖЬ КАК ПолучательУчастникСРП,
	|	ЛОЖЬ КАК ПолучательУчастникСовместнойДеятельности,
	|	ЛОЖЬ КАК ПоставщикРозничнаяРеализация,
	|	ЛОЖЬ КАК ПоставщикМалаяТорговаяТочка,
	|	ВозвратТоваровОтПокупателя.ДоверенностьНомер КАК НомерДоверенностиОтпуск,
	|	ВозвратТоваровОтПокупателя.ДоверенностьДата КАК ДатаДоверенностиОтпуск,
	|	ТаблицаТовары.НомерСтроки,
	|	ВЫРАЗИТЬ(СправочникНоменклатура.ВесНетто * ТаблицаТовары.Количество КАК ЧИСЛО(15, 3)) КАК ВесНетто
	|ПОМЕСТИТЬ вт_ДанныеДокумента
	|ИЗ
	|	Документ.ВозвратТоваровОтПокупателя.Товары КАК ТаблицаТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровОтПокупателя КАК ВозвратТоваровОтПокупателя
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК ОрганизацияГоловная
	|				ПО Организации.ГоловнаяОрганизация = ОрганизацияГоловная.Ссылка
	|			ПО ВозвратТоваровОтПокупателя.Организация = Организации.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|			ПО ВозвратТоваровОтПокупателя.Контрагент = Контрагенты.Ссылка
	|		ПО ТаблицаТовары.Ссылка = ВозвратТоваровОтПокупателя.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК КлассификаторСтранМира
	|		ПО (Контрагенты.СтранаРезидентства = КлассификаторСтранМира.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО ТаблицаТовары.Номенклатура = СправочникНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
	|		ПО ТаблицаТовары.ЕдиницаИзмерения = КлассификаторЕдиницИзмерения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО (ВозвратТоваровОтПокупателя.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтавкиНДС КАК СтавкиНДС
	|		ПО ТаблицаТовары.СтавкаНДС = СтавкиНДС.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтавкиАкциза КАК СтавкиАкциза
	|		ПО (ВозвратТоваровОтПокупателя.УчитыватьАкциз)
	|			И ТаблицаТовары.СтавкаАкциза = СтавкиАкциза.Ссылка
	|ГДЕ
	|	ВозвратТоваровОтПокупателя.Ссылка В(&МассивДокументов)";
	
	Если Не ПервыйЗапрос Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПОМЕСТИТЬ вт_ДанныеДокумента", "");	
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РАЗРЕШЕННЫЕ", "");
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаОтчетОРозничныхПродажах(ПервыйЗапрос = Истина)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОтчетОРозничныхПродажах.Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК ОрганизацияПолучатель,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ОтчетОРозничныхПродажах.СтруктурноеПодразделение) = ТИПЗНАЧЕНИЯ(ОтчетОРозничныхПродажах.СтруктурноеПодразделение.Ссылка)
	|			ТОГДА  ОтчетОРозничныхПродажах.СтруктурноеПодразделение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
	|	КОНЕЦ КАК СтруктурноеПодразделение,
	|   ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК СтруктурноеПодразделениеПолучатель,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыСНТ.Первичная) КАК ТипСНТ,
	|	ВЫБОР
	|		КОГДА НЕ ОтчетОРозничныхПродажах.СтруктурноеПодразделение.УказыватьРеквизитыГоловнойОрганизации
	|			ТОГДА ОтчетОРозничныхПродажах.СтруктурноеПодразделение
	|		КОГДА ОтчетОРозничныхПродажах.Организация.УказыватьРеквизитыГоловнойОрганизацииВСчетеФактуре
	|			ТОГДА ОрганизацияГоловная.Ссылка
	|		ИНАЧЕ ОтчетОРозничныхПродажах.Организация
	|	КОНЕЦ КАК Поставщик,
	|	ОтчетОРозничныхПродажах.Контрагент КАК Контрагент,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСНТ.Реализация) КАК ВидОперации,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыВывозаСНТ.ПустаяСсылка) КАК ВидВывоза,
	|   ЗНАЧЕНИЕ(Перечисление.ВидыВвозаСНТ.ПустаяСсылка) КАК ВидВвоза,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыПеремещенияСНТ.ПустаяСсылка) КАК ВидПеремещения,
	|	ОтчетОРозничныхПродажах.Контрагент КАК Получатель,
	|	ОтчетОРозничныхПродажах.Дата КАК ДатаОтгрузкиТовара,
	|	ТаблицаТовары.Ссылка КАК ДокументОснование,
	|	ОтчетОРозничныхПродажах.ВалютаДокумента КАК Валюта,
	|	ОтчетОРозничныхПродажах.ВалютаДокумента.БуквенныйКод КАК ВалютаКод,
	|	ОтчетОРозничныхПродажах.КурсВзаиморасчетов КАК КурсВалюты,
	|	ОтчетОРозничныхПродажах.Склад КАК СкладОтправитель,
	|	ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка) КАК СкладПолучатель,
	|	ТаблицаТовары.Номенклатура КАК Товар,
	|	СправочникНоменклатура.НаименованиеПолное КАК ТоварНаименование,
	|	СправочникНоменклатура.КодТНВЭД КАК КодТНВЭД,
	|	ТаблицаТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	КлассификаторЕдиницИзмерения.КодЭСФ КАК ЕдиницаИзмеренияКод,
	|	ТаблицаТовары.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА ОтчетОРозничныхПродажах.УчитыватьНДС
	|				И ОтчетОРозничныхПродажах.СуммаВключаетНДС
	|			ТОГДА ВЫБОР
	|					КОГДА ОтчетОРозничныхПродажах.УчитыватьАкциз
	|							И ОтчетОРозничныхПродажах.СуммаВключаетАкциз
	|						ТОГДА ВЫРАЗИТЬ((ТаблицаТовары.Сумма - ТаблицаТовары.СуммаАкциза - ТаблицаТовары.СуммаНДС) / ТаблицаТовары.Количество КАК ЧИСЛО(14,2))
	|					ИНАЧЕ ВЫРАЗИТЬ((ТаблицаТовары.Сумма - ТаблицаТовары.СуммаНДС) / ТаблицаТовары.Количество КАК ЧИСЛО(14,2))
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ОтчетОРозничныхПродажах.УчитыватьАкциз
	|						И ОтчетОРозничныхПродажах.СуммаВключаетАкциз
	|					ТОГДА ВЫРАЗИТЬ((ТаблицаТовары.Сумма - ТаблицаТовары.СуммаАкциза) / ТаблицаТовары.Количество КАК ЧИСЛО(14,2))
	|				ИНАЧЕ ВЫРАЗИТЬ(ТаблицаТовары.Цена КАК ЧИСЛО(14,2))
	|			КОНЕЦ
	|	КОНЕЦ КАК Цена,
	|	""5"" КАК ПризнакПроисхождения,
	|	"""" КАК НомерЗаявленияВРамкахТС,
	|	"""" КАК ИдентификаторТовара,
	|	"""" КАК НомерПозицииВДекларацииИлиЗаявлении,
	|	ЗНАЧЕНИЕ(Справочник.ИсточникиПроисхождения.ПустаяСсылка) КАК ИсточникПроисхождения,
	|	""Товары"" КАК ИмяТабличнойЧасти,
	|	""ОтчетОРозничныхПродажах"" КАК ИмяДокумента,
	|	ЛОЖЬ КАК ЗапрещеноРазбиватьДокумент,
	|	ИСТИНА КАК РаспределятьТоварыПоИП,
	|	"""" КАК ПрефиксВидаДокумента,
	|	"""" КАК НомерУчетногоДокумента,
	|	"""" КАК НомерПакета,
	|	ТаблицаТовары.СтавкаАкциза КАК СтавкаАкциза,
	|	ТаблицаТовары.СуммаАкциза КАК СуммаАкциза,
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.СтавкаНДС <> ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка) 
	|			ТОГДА ТаблицаТовары.СтавкаНДС.ДляОсвобожденногоОборота
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК БезНДС,
	|	ВЫБОР
	|		КОГДА ОтчетОРозничныхПродажах.УчитыватьНДС
	|			ТОГДА ТаблицаТовары.СтавкаНДС
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка)
	|	КОНЕЦ КАК СтавкаНДС,
	|	ТаблицаТовары.СуммаНДС КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА ОтчетОРозничныхПродажах.УчитыватьНДС
	|				И ОтчетОРозничныхПродажах.СуммаВключаетНДС
	|			ТОГДА ВЫБОР
	|					КОГДА ОтчетОРозничныхПродажах.УчитыватьАкциз
	|							И ОтчетОРозничныхПродажах.СуммаВключаетАкциз
	|						ТОГДА ТаблицаТовары.Сумма - ТаблицаТовары.СуммаНДС
	|					ИНАЧЕ ТаблицаТовары.Сумма - ТаблицаТовары.СуммаНДС + ТаблицаТовары.СуммаАкциза
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ОтчетОРозничныхПродажах.УчитыватьАкциз
	|						И ОтчетОРозничныхПродажах.СуммаВключаетАкциз
	|					ТОГДА ТаблицаТовары.Сумма
	|				ИНАЧЕ ТаблицаТовары.Сумма + ТаблицаТовары.СуммаАкциза
	|			КОНЕЦ
	|	КОНЕЦ КАК ОборотПоРеализации,
	|	ВЫБОР
	|		КОГДА ОтчетОРозничныхПродажах.УчитыватьНДС
	|				И ОтчетОРозничныхПродажах.СуммаВключаетНДС
	|			ТОГДА ВЫБОР
	|					КОГДА ОтчетОРозничныхПродажах.УчитыватьАкциз
	|							И ОтчетОРозничныхПродажах.СуммаВключаетАкциз
	|						ТОГДА ТаблицаТовары.Сумма - ТаблицаТовары.СуммаАкциза - ТаблицаТовары.СуммаНДС
	|					ИНАЧЕ ТаблицаТовары.Сумма - ТаблицаТовары.СуммаНДС
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ОтчетОРозничныхПродажах.УчитыватьАкциз
	|						И ОтчетОРозничныхПродажах.СуммаВключаетАкциз
	|					ТОГДА ТаблицаТовары.Сумма - ТаблицаТовары.СуммаАкциза
	|				ИНАЧЕ ТаблицаТовары.Сумма
	|			КОНЕЦ
	|	КОНЕЦ КАК СуммаБезНалогов,
	|	ВЫБОР
	|		КОГДА ОтчетОРозничныхПродажах.УчитыватьНДС
	|				И ОтчетОРозничныхПродажах.СуммаВключаетНДС
	|			ТОГДА ВЫБОР
	|					КОГДА ОтчетОРозничныхПродажах.УчитыватьАкциз
	|							И ОтчетОРозничныхПродажах.СуммаВключаетАкциз
	|						ТОГДА ТаблицаТовары.Сумма
	|					ИНАЧЕ ТаблицаТовары.Сумма + ТаблицаТовары.СуммаАкциза
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ОтчетОРозничныхПродажах.УчитыватьАкциз
	|						И ОтчетОРозничныхПродажах.СуммаВключаетАкциз
	|					ТОГДА ТаблицаТовары.Сумма + ТаблицаТовары.СуммаНДС
	|				ИНАЧЕ ТаблицаТовары.Сумма + ТаблицаТовары.СуммаНДС + ТаблицаТовары.СуммаАкциза
	|			КОНЕЦ
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР
	|		КОГДА НЕ ОтчетОРозничныхПродажах.СтруктурноеПодразделение.УказыватьРеквизитыГоловнойОрганизации
	|			ТОГДА ЕСТЬNULL(ОтчетОРозничныхПродажах.СтруктурноеПодразделение.ИдентификационныйНомер, """")
	|		КОГДА ОтчетОРозничныхПродажах.Организация.УказыватьРеквизитыГоловнойОрганизацииВСчетеФактуре
	|			ТОГДА ЕСТЬNULL(ОрганизацияГоловная.ИдентификационныйНомер, """")
	|		ИНАЧЕ ЕСТЬNULL(Организации.ИдентификационныйНомер, """")
	|	КОНЕЦ КАК ПоставщикИдентификатор,
	|	ВЫБОР
	|		КОГДА НЕ ОтчетОРозничныхПродажах.СтруктурноеПодразделение.УказыватьРеквизитыГоловнойОрганизации
	|			ТОГДА ЕСТЬNULL(ВЫРАЗИТЬ(ОтчетОРозничныхПродажах.СтруктурноеПодразделение.НаименованиеПолное КАК СТРОКА(200)), """")
	|		КОГДА ОтчетОРозничныхПродажах.Организация.УказыватьРеквизитыГоловнойОрганизацииВСчетеФактуре
	|			ТОГДА ЕСТЬNULL(ВЫРАЗИТЬ(ОрганизацияГоловная.НаименованиеПолное КАК СТРОКА(200)), """")
	|		ИНАЧЕ ЕСТЬNULL(ВЫРАЗИТЬ(Организации.НаименованиеПолное КАК СТРОКА(200)), """")
	|	КОНЕЦ КАК ПоставщикНаименование,
	|	ВЫБОР
	|		КОГДА ОтчетОРозничныхПродажах.СтруктурноеПодразделение.УказыватьРеквизитыГоловнойОрганизации
	|			ТОГДА ЕСТЬNULL(ОтчетОРозничныхПродажах.СтруктурноеПодразделение.ИдентификационныйНомер, """")
	|		КОГДА ОтчетОРозничныхПродажах.Организация.УказыватьРеквизитыГоловнойОрганизацииВСчетеФактуре
	|			ТОГДА ЕСТЬNULL(Организации.ИдентификационныйНомер, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ПоставщикБИНСтруктурногоПодразделения,
	|	"""" КАК ПолучательБИНСтруктурногоПодразделения,
	|	ЛОЖЬ КАК ПоставщикНерезидент,
	|	ЛОЖЬ КАК ПоставщикРозничнаяРеализация,
	|	ЛОЖЬ КАК ПолучательРозничныйРеализатор,
	|	ЛОЖЬ КАК ПоставщикМалаяТорговаяТочка,
	|	""KZ"" КАК ПоставщикКодСтраны,
	|	""KZ"" КАК ПоставщикКодСтраныОтправки,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ОтчетОРозничныхПродажах.СтруктурноеПодразделение) = ТИПЗНАЧЕНИЯ(ОтчетОРозничныхПродажах.СтруктурноеПодразделение.Ссылка)
	|				И НЕ ОтчетОРозничныхПродажах.СтруктурноеПодразделение.УказыватьРеквизитыГоловнойОрганизации
	|			ТОГДА ОтчетОРозничныхПродажах.СтруктурноеПодразделение
	|		ИНАЧЕ ОтчетОРозничныхПродажах.Организация
	|	КОНЕЦ КАК Грузоотправитель,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ОтчетОРозничныхПродажах.СтруктурноеПодразделение) = ТИПЗНАЧЕНИЯ(ОтчетОРозничныхПродажах.СтруктурноеПодразделение.Ссылка)
	|				И НЕ ОтчетОРозничныхПродажах.СтруктурноеПодразделение.УказыватьРеквизитыГоловнойОрганизации
	|			ТОГДА ЕСТЬNULL(ВЫРАЗИТЬ(ОтчетОРозничныхПродажах.СтруктурноеПодразделение.НаименованиеПолное КАК СТРОКА(200)), """")
	|		ИНАЧЕ ЕСТЬNULL(ВЫРАЗИТЬ(Организации.НаименованиеПолное КАК СТРОКА(200)), """")
	|	КОНЕЦ КАК ГрузоотправительНаименование,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ОтчетОРозничныхПродажах.СтруктурноеПодразделение) = ТИПЗНАЧЕНИЯ(ОтчетОРозничныхПродажах.СтруктурноеПодразделение.Ссылка)
	|				И НЕ ОтчетОРозничныхПродажах.СтруктурноеПодразделение.УказыватьРеквизитыГоловнойОрганизации
	|			ТОГДА ЕСТЬNULL(ОтчетОРозничныхПродажах.СтруктурноеПодразделение.ИдентификационныйНомер, """")
	|		ИНАЧЕ ЕСТЬNULL(Организации.ИдентификационныйНомер, """")
	|	КОНЕЦ КАК ГрузоотправительИдентификатор,
	|	ЛОЖЬ КАК ГрузоотправительНерезидент,
	|	ОтчетОРозничныхПродажах.Контрагент КАК Грузополучатель,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(Контрагент.НаименованиеПолное КАК СТРОКА(200)), """") КАК ГрузополучательНаименование,
	|	"""" КАК ГрузополучательИдентификатор,
	|	ЛОЖЬ КАК ГрузополучательНерезидент,
	|	""KZ"" КАК ГрузоотправительКодСтраныОтправки,
	|	"""" КАК ПолучательИдентификатор,
	|	""Розничная реализация"" КАК ПолучательНаименование,
	|	""KZ"" КАК ПолучательКодСтраны,
	|	""KZ"" КАК ПолучательКодСтраныДоставки,
	|	""KZ"" КАК ГрузополучательКодСтраныОтправки,
	|	ЛОЖЬ КАК ПолучательНерезидент,
	|	ИСТИНА КАК ПолучательРозничнаяРеализация,
	|	ЛОЖЬ КАК ПолучательМалаяТорговаяТочка,
	|	"""" КАК АдресДоставки, //ВЫРАЗИТЬ(ОтчетОРозничныхПродажах.АдресДоставки КАК СТРОКА(400)) КАК АдресДоставки,
	|	"""" КАК АдресОтправки,
	|	ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка) КАК ДоговорПоставки,
	|	ИСТИНА КАК БезДоговора,
	|	"""" КАК УникальныйНомерВалютногоКонтроля,
	|	ОтчетОРозничныхПродажах.УчитыватьАкциз КАК УчитыватьАкциз,
	|	ОтчетОРозничныхПродажах.УчитыватьНДС КАК УчитыватьНДС,
	|	ОтчетОРозничныхПродажах.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ОтчетОРозничныхПродажах.СуммаВключаетАкциз КАК СуммаВключаетАкциз,
	|	НЕОПРЕДЕЛЕНО КАК ДоговорПоставкиНомер, // пустое число
	|	НЕОПРЕДЕЛЕНО КАК ДоговорПоставкиДата, // пустая дата
	|	НЕОПРЕДЕЛЕНО КАК ДоговорПоставкиУсловияОплаты, 
	|	НЕОПРЕДЕЛЕНО КАК ДоговорПоставкиУсловияПоставки, 
	|	ВЫБОР
	|		КОГДА &ЭтоИсправленнаяСНТ
	|			ТОГДА ОтчетОРозничныхПродажах.Ссылка
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ПервичныйДокументОснование,
	|	ВЫБОР
	|		КОГДА ОтчетОРозничныхПродажах.УчитыватьНДС
	|			ТОГДА СтавкиНДС.Ставка
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СтавкаНДСЧисло,
	|   ВЫБОР
   	|       КОГДА ОтчетОРозничныхПродажах.УчитыватьАкциз И НЕ СтавкиАкциза.Ссылка Есть NULL
   	|           ТОГДА СтавкиАкциза.Ставка
   	|       ИНАЧЕ 0
   	|   КОНЕЦ КАК СтавкаАкцизаЧисло,
	|	&ЭтоИсправленнаяСНТ КАК ЭтоИсправленнаяСНТ,
	|	ЛОЖЬ КАК ПолучательФизическоеЛицо,
	|	ЛОЖЬ КАК ПоставщикФизическоеЛицо,
	|	ЛОЖЬ КАК ПолучательУчастникСРП,
	|	ЛОЖЬ КАК ПолучательУчастникСовместнойДеятельности,
	|	НЕОПРЕДЕЛЕНО КАК НомерДоверенностиОтпуск,
	|	НЕОПРЕДЕЛЕНО КАК ДатаДоверенностиОтпуск,
	|	ТаблицаТовары.НомерСтроки КАК НомерСтроки,
	|	ВЫРАЗИТЬ(СправочникНоменклатура.ВесНетто * ТаблицаТовары.Количество КАК ЧИСЛО(15, 3)) КАК ВесНетто
	|ПОМЕСТИТЬ вт_ДанныеДокумента
	|ИЗ
	|	Документ.ОтчетОРозничныхПродажах.Товары КАК ТаблицаТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетОРозничныхПродажах КАК ОтчетОРозничныхПродажах
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК ОрганизацияГоловная
	|				ПО Организации.ГоловнаяОрганизация = ОрганизацияГоловная.Ссылка
	|			ПО ОтчетОРозничныхПродажах.Организация = Организации.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Грузополучатели
	|			ПО ОтчетОРозничныхПродажах.Контрагент = Грузополучатели.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|			ПО ОтчетОРозничныхПродажах.Контрагент = Контрагенты.Ссылка
	|		ПО ТаблицаТовары.Ссылка = ОтчетОРозничныхПродажах.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК КлассификаторСтранМира
	|		ПО (Контрагенты.СтранаРезидентства = КлассификаторСтранМира.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО ТаблицаТовары.Номенклатура = СправочникНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
	|		ПО ТаблицаТовары.ЕдиницаИзмерения = КлассификаторЕдиницИзмерения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО (ОтчетОРозничныхПродажах.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтавкиНДС КАК СтавкиНДС
	|		ПО ТаблицаТовары.СтавкаНДС = СтавкиНДС.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтавкиАкциза КАК СтавкиАкциза
	|		ПО ТаблицаТовары.СтавкаАкциза = СтавкиАкциза.Ссылка
	|ГДЕ
	|	ОтчетОРозничныхПродажах.Ссылка В(&МассивДокументов)";
	
	
	Если Не ПервыйЗапрос Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПОМЕСТИТЬ вт_ДанныеДокумента", "");	
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РАЗРЕШЕННЫЕ", "");
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции	

Функция ТекстЗапросаПеремещениеТоваров(ПервыйЗапрос = Истина)

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ПеремещениеТоваров.Ссылка КАК Ссылка,
	|	ПеремещениеТоваров.Организация КАК Организация,
	|	ПеремещениеТоваров.Организация КАК ОрганизацияПолучатель,
	|	ПеремещениеТоваров.СтруктурноеПодразделениеОтправитель КАК СтруктурноеПодразделение,
	|	ПеремещениеТоваров.СтруктурноеПодразделениеПолучатель КАК СтруктурноеПодразделениеПолучатель,
	|	ПеремещениеТоваров.СкладОтправитель КАК СкладОтправитель,
	|	ВЫБОР
	|		КОГДА НЕ ПеремещениеТоваров.СтруктурноеПодразделениеОтправитель.УказыватьРеквизитыГоловнойОрганизации
	|			ТОГДА ПеремещениеТоваров.СтруктурноеПодразделениеОтправитель
	|		ИНАЧЕ ПеремещениеТоваров.Организация
	|	КОНЕЦ КАК Поставщик,
	|	ВЫБОР
	|		КОГДА НЕ ПеремещениеТоваров.СтруктурноеПодразделениеОтправитель.УказыватьРеквизитыГоловнойОрганизации
	|			ТОГДА ЕСТЬNULL(ВЫРАЗИТЬ(ПеремещениеТоваров.СтруктурноеПодразделениеОтправитель.НаименованиеПолное КАК СТРОКА(200)), """")
	|		ИНАЧЕ ЕСТЬNULL(ВЫРАЗИТЬ(Организации.НаименованиеПолное КАК СТРОКА(200)), """")
	|	КОНЕЦ КАК ПоставщикНаименование,
	|	ВЫБОР
	|		КОГДА НЕ ПеремещениеТоваров.СтруктурноеПодразделениеОтправитель.УказыватьРеквизитыГоловнойОрганизации
	|			ТОГДА ЕСТЬNULL(ПеремещениеТоваров.СтруктурноеПодразделениеОтправитель.ИдентификационныйНомер, """")
	|		ИНАЧЕ ЕСТЬNULL(Организации.ИдентификационныйНомер, """")
	|	КОНЕЦ КАК ПоставщикИдентификатор,
	|	ВЫБОР
	|		КОГДА ПеремещениеТоваров.СтруктурноеПодразделениеОтправитель.УказыватьРеквизитыГоловнойОрганизации
	|			ТОГДА ЕСТЬNULL(ПеремещениеТоваров.СтруктурноеПодразделениеОтправитель.ИдентификационныйНомер, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ПоставщикБИНСтруктурногоПодразделения,
	|	ЛОЖЬ КАК ПоставщикНерезидент,
	|	ЛОЖЬ КАК ПоставщикРозничнаяРеализация,
	|	ЛОЖЬ КАК ПоставщикМалаяТорговаяТочка,
	|	""KZ"" КАК ПоставщикКодСтраны,
	|	""KZ"" КАК ПоставщикКодСтраныОтправки,
	|	ПеремещениеТоваров.СкладПолучатель КАК СкладПолучатель,
	|	ВЫБОР
	|		КОГДА НЕ ПеремещениеТоваров.СтруктурноеПодразделениеПолучатель.УказыватьРеквизитыГоловнойОрганизации
	|			ТОГДА ПеремещениеТоваров.СтруктурноеПодразделениеПолучатель
	|		ИНАЧЕ ПеремещениеТоваров.Организация
	|	КОНЕЦ КАК Получатель,
	|	ВЫБОР
	|		КОГДА НЕ ПеремещениеТоваров.СтруктурноеПодразделениеПолучатель.УказыватьРеквизитыГоловнойОрганизации
	|			ТОГДА ЕСТЬNULL(ВЫРАЗИТЬ(ПодразделенияОрганизацийПолучатель.НаименованиеПолное КАК СТРОКА(200)), """")
	|		ИНАЧЕ ЕСТЬNULL(ВЫРАЗИТЬ(Организации.НаименованиеПолное КАК СТРОКА(200)), """")
	|	КОНЕЦ КАК ПолучательНаименование,
	|	ВЫБОР
	|		КОГДА НЕ ПеремещениеТоваров.СтруктурноеПодразделениеПолучатель.УказыватьРеквизитыГоловнойОрганизации
	|			ТОГДА ЕСТЬNULL(ПодразделенияОрганизацийПолучатель.ИдентификационныйНомер, """")
	|		ИНАЧЕ ЕСТЬNULL(Организации.ИдентификационныйНомер, """")
	|	КОНЕЦ КАК ПолучательИдентификатор,
	|	ВЫБОР
	|		КОГДА ПеремещениеТоваров.СтруктурноеПодразделениеПолучатель.УказыватьРеквизитыГоловнойОрганизации
	|			ТОГДА ЕСТЬNULL(ПодразделенияОрганизацийПолучатель.ИдентификационныйНомер, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ПолучательБИНСтруктурногоПодразделения,
	|	ЛОЖЬ КАК ПолучательНерезидент,
	|	ЛОЖЬ КАК ПолучательРозничнаяРеализация,
	|	ЛОЖЬ КАК ПолучательМалаяТорговаяТочка,
	|	ЛОЖЬ КАК ПолучательРозничныйРеализатор,
	|	""KZ"" КАК ПолучательКодСтраны,
	|	""KZ"" КАК ПолучательКодСтраныДоставки,
	|	ПеремещениеТоваров.Дата КАК ДатаОтгрузкиТовара,
	|	ВЫБОР 
	|		КОГДА &ПоддержкаРаботыСоСтруктурнымиПодразделениями И (ПеремещениеТоваров.СтруктурноеПодразделениеОтправитель <> ПеремещениеТоваров.СтруктурноеПодразделениеПолучатель)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСНТ.ПеремещениеМеждуФилиалами)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСНТ.Перемещение)
	|	КОНЕЦ КАК ВидОперации,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыПеремещенияСНТ.ВПределахОдногоЛицаРК) КАК ВидПеремещения,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыВывозаСНТ.ПустаяСсылка) КАК ВидВывоза,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыВвозаСНТ.ПустаяСсылка) КАК ВидВвоза,
	|	""KZ"" КАК ГрузоотправительКодСтраныОтправки,
	|	""KZ"" КАК ГрузополучательКодСтраныОтправки,
	|	ВЫБОР
	|		КОГДА НЕ ПеремещениеТоваров.СтруктурноеПодразделениеОтправитель.УказыватьРеквизитыГоловнойОрганизации
	|			ТОГДА ЕСТЬNULL(ПеремещениеТоваров.СтруктурноеПодразделениеОтправитель, """")
	|		ИНАЧЕ ЕСТЬNULL(ПеремещениеТоваров.Организация, """")
	|	КОНЕЦ КАК Грузоотправитель,
	|	ВЫБОР
	|		КОГДА НЕ ПеремещениеТоваров.СтруктурноеПодразделениеОтправитель.УказыватьРеквизитыГоловнойОрганизации
	|			ТОГДА ЕСТЬNULL(ВЫРАЗИТЬ(ПеремещениеТоваров.СтруктурноеПодразделениеОтправитель.НаименованиеПолное КАК СТРОКА(200)), """")
	|		ИНАЧЕ ЕСТЬNULL(ВЫРАЗИТЬ(Организации.НаименованиеПолное КАК СТРОКА(200)), """")
	|	КОНЕЦ КАК ГрузоотправительНаименование,
	|	ВЫБОР
	|		КОГДА НЕ ПеремещениеТоваров.СтруктурноеПодразделениеОтправитель.УказыватьРеквизитыГоловнойОрганизации
	|			ТОГДА ЕСТЬNULL(ПеремещениеТоваров.СтруктурноеПодразделениеОтправитель.ИдентификационныйНомер, """")
	|		ИНАЧЕ ЕСТЬNULL(Организации.ИдентификационныйНомер, """")
	|	КОНЕЦ КАК ГрузоотправительИдентификатор,
	|	ЛОЖЬ КАК ГрузоотправительНерезидент,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ПеремещениеТоваров.СтруктурноеПодразделениеПолучатель) = ТИПЗНАЧЕНИЯ(ПодразделенияОрганизацийПолучатель.Ссылка)
	|				И НЕ ПеремещениеТоваров.СтруктурноеПодразделениеПолучатель.УказыватьРеквизитыГоловнойОрганизации
	|			ТОГДА ЕСТЬNULL(ПеремещениеТоваров.СтруктурноеПодразделениеПолучатель, """")
	|		ИНАЧЕ ЕСТЬNULL(ПеремещениеТоваров.Организация, """")
	|	КОНЕЦ КАК Грузополучатель,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ПеремещениеТоваров.СтруктурноеПодразделениеПолучатель) = ТИПЗНАЧЕНИЯ(ПодразделенияОрганизацийПолучатель.Ссылка)
	|				И НЕ ПеремещениеТоваров.СтруктурноеПодразделениеПолучатель.УказыватьРеквизитыГоловнойОрганизации
	|			ТОГДА ЕСТЬNULL(ВЫРАЗИТЬ(ПодразделенияОрганизацийПолучатель.НаименованиеПолное КАК СТРОКА(200)), """")
	|		ИНАЧЕ ЕСТЬNULL(ВЫРАЗИТЬ(Организации.НаименованиеПолное КАК СТРОКА(200)), """")
	|	КОНЕЦ КАК ГрузополучательНаименование,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ПеремещениеТоваров.СтруктурноеПодразделениеПолучатель) = ТИПЗНАЧЕНИЯ(ПодразделенияОрганизацийПолучатель.Ссылка)
	|				И НЕ ПеремещениеТоваров.СтруктурноеПодразделениеПолучатель.УказыватьРеквизитыГоловнойОрганизации
	|			ТОГДА ЕСТЬNULL(ПодразделенияОрганизацийПолучатель.ИдентификационныйНомер, """")
	|		ИНАЧЕ ЕСТЬNULL(Организации.ИдентификационныйНомер, """")
	|	КОНЕЦ КАК ГрузополучательИдентификатор,
	|	ЛОЖЬ КАК ГрузополучательНерезидент,
	|	"""" КАК Контрагент,
	|	ИСТИНА КАК БезДоговора,
	|	"""" КАК УникальныйНомерВалютногоКонтроля,
	|	"""" КАК ДоговорПоставкиНомер,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДоговорПоставкиДата,
	|	"""" КАК ДоговорПоставкиУсловияОплаты,
	|	"""" КАК ДоговорПоставкиУсловияПоставки,
	//|	НЕОПРЕДЕЛЕНО КАК ПервичныйДокументОснование,
	|	ВЫБОР
	|		КОГДА &ЭтоИсправленнаяСНТ
	|			ТОГДА ПеремещениеТоваров.Ссылка
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ПервичныйДокументОснование,
	|	&ЭтоИсправленнаяСНТ КАК ЭтоИсправленнаяСНТ,
	|	ЛОЖЬ КАК ПолучательФизическоеЛицо,
	|	ЛОЖЬ КАК ПоставщикФизическоеЛицо,
	|	ЛОЖЬ КАК ПолучательУчастникСРП,
	|	ЛОЖЬ КАК ПолучательУчастникСовместнойДеятельности,
	|   0 КАК ВесНетто
	|ПОМЕСТИТЬ вт_ДанныеДокПоставщикПолучатель
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО ПеремещениеТоваров.Организация = Организации.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизацийПолучатель
	|		ПО ПеремещениеТоваров.СтруктурноеПодразделениеПолучатель = ПодразделенияОрганизацийПолучатель.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизацийОтправитель
	|		ПО ПеремещениеТоваров.СтруктурноеПодразделениеОтправитель = ПодразделенияОрганизацийОтправитель.Ссылка
	|ГДЕ
	|	ПеремещениеТоваров.Ссылка В(&МассивДокументов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""KZT"" КАК Валюта,
	|	""KZT"" КАК ВалютаКод,
	|	1 КАК КурсВалюты,
	|	ЗНАЧЕНИЕ(Справочник.ВиртуальныеСклады.ПустаяСсылка) КАК ВиртуальныйСкладОтправитель,
	|	ЗНАЧЕНИЕ(Справочник.ВиртуальныеСклады.ПустаяСсылка) КАК ВиртуальныйСкладПолучатель,
	|	ТаблицаТовары.Ссылка КАК ДокументОснование,
	|	ТаблицаТовары.Номенклатура КАК Товар,
	|	СправочникНоменклатура.НаименованиеПолное КАК ТоварНаименование,
	|	СправочникНоменклатура.КодТНВЭД КАК КодТНВЭД,
	|	ТаблицаТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	КлассификаторЕдиницИзмерения.КодЭСФ КАК ЕдиницаИзмеренияКод,
	|	ТаблицаТовары.Количество КАК Количество,
	|	0 КАК Цена,
	|	0 КАК Сумма,
	|	""5"" КАК ПризнакПроисхождения,
	|	"""" КАК НомерЗаявленияВРамкахТС,
	|	"""" КАК ИдентификаторТовара,
	|	"""" КАК НомерПозицииВДекларацииИлиЗаявлении,
	|	ЗНАЧЕНИЕ(Справочник.ИсточникиПроисхождения.ПустаяСсылка) КАК ИсточникПроисхождения,
	|	""Товары"" КАК ИмяТабличнойЧасти,
	|	""ПеремещениеТоваровУслуг"" КАК ИмяДокумента,
	|	ЛОЖЬ КАК ЗапрещеноРазбиватьДокумент,
	|	ИСТИНА КАК РаспределятьТоварыПоИП,
	|	"""" КАК ПрефиксВидаДокумента,
	|	"""" КАК НомерУчетногоДокумента,
	|	"""" КАК НомерПакета,
	|	ЗНАЧЕНИЕ(Справочник.СтавкиАкциза.ПустаяСсылка) КАК СтавкаАкциза,
	|	0 КАК СуммаАкциза,
	|	ЛОЖЬ КАК УчитыватьАкциз,
	|	ЛОЖЬ КАК УчитыватьНДС,
	|	0 КАК СуммаВключаетНДС,
	|	0 КАК СуммаВключаетАкциз,
	|	ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка) КАК СтавкаНДС,
	|	ИСТИНА КАК БезНДС,
	|	0 КАК СуммаНДС,
	|	"""" КАК АдресОтправки,
	|	"""" КАК АдресДоставки,
	|	"""" КАК ДоговорПоставки,
	|	0 КАК СуммаБезНалогов,
	|	0 КАК ОборотПоРеализации,
	|	ПеремещениеТоваров.Ссылка,
	//|	ЗНАЧЕНИЕ(Перечисление.ТипыСНТ.Первичная) КАК ТипСНТ,
	|	ВЫБОР
	|		КОГДА &ЭтоИсправленнаяСНТ
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыСНТ.Исправленная)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыСНТ.Первичная)
	|	КОНЕЦ КАК ТипСНТ,
	|	ПеремещениеТоваров.Организация,
	|	ПеремещениеТоваров.Организация КАК ОрганизацияПолучатель,
	|	ПеремещениеТоваров.СтруктурноеПодразделение КАК СтруктурноеПодразделение,
	|	ПеремещениеТоваров.СтруктурноеПодразделениеПолучатель КАК СтруктурноеПодразделениеПолучатель,
	|	ПеремещениеТоваров.СкладОтправитель,
	|	ПеремещениеТоваров.Поставщик,
	|	ПеремещениеТоваров.ПоставщикНаименование,
	|	ПеремещениеТоваров.ПоставщикИдентификатор,
	|	ПеремещениеТоваров.ПоставщикНерезидент,
	|	ПеремещениеТоваров.ПоставщикРозничнаяРеализация,
	|	ПеремещениеТоваров.ПоставщикМалаяТорговаяТочка,
	|	ПеремещениеТоваров.ПоставщикКодСтраны,
	|	ПеремещениеТоваров.ПоставщикКодСтраныОтправки,
	|	ПеремещениеТоваров.СкладПолучатель,
	|	ПеремещениеТоваров.Получатель,
	|	ПеремещениеТоваров.ПолучательНаименование,
	|	ПеремещениеТоваров.ПолучательИдентификатор,
	|	ПеремещениеТоваров.ПолучательНерезидент,
	|	ПеремещениеТоваров.ПолучательРозничнаяРеализация,
	|	ПеремещениеТоваров.ПолучательМалаяТорговаяТочка,
	|	ПеремещениеТоваров.ПолучательРозничныйРеализатор,
	|	ПеремещениеТоваров.ПолучательКодСтраны,
	|	ПеремещениеТоваров.ПолучательКодСтраныДоставки,
	|	ПеремещениеТоваров.ДатаОтгрузкиТовара,
	|	ПеремещениеТоваров.ВидОперации,
	|	ПеремещениеТоваров.ВидПеремещения,
	|	ПеремещениеТоваров.ВидВывоза,
	|	ПеремещениеТоваров.ВидВвоза,
	|	ПеремещениеТоваров.ГрузоотправительКодСтраныОтправки,
	|	ПеремещениеТоваров.ГрузополучательКодСтраныОтправки,
	|	ПеремещениеТоваров.Грузоотправитель,
	|	ПеремещениеТоваров.ГрузоотправительНаименование,
	|	ПеремещениеТоваров.ГрузоотправительИдентификатор,
	|	ПеремещениеТоваров.ГрузоотправительНерезидент,
	|	ПеремещениеТоваров.Грузополучатель,
	|	ПеремещениеТоваров.ГрузополучательНаименование,
	|	ПеремещениеТоваров.ГрузополучательИдентификатор,
	|	ПеремещениеТоваров.ГрузополучательНерезидент,
	|	ПеремещениеТоваров.Контрагент,
	|	ПеремещениеТоваров.БезДоговора,
	|	ПеремещениеТоваров.УникальныйНомерВалютногоКонтроля,
	|	ПеремещениеТоваров.ДоговорПоставкиНомер,
	|	ПеремещениеТоваров.ДоговорПоставкиДата,
	|	ПеремещениеТоваров.ДоговорПоставкиУсловияОплаты,
	|	ПеремещениеТоваров.ДоговорПоставкиУсловияПоставки,
	|	ПеремещениеТоваров.ПервичныйДокументОснование,
	|	ПеремещениеТоваров.ЭтоИсправленнаяСНТ,
	|	0 КАК СтавкаНДСЧисло,
	|	0 КАК СтавкаАкцизаЧисло,
	|	ПеремещениеТоваров.ПолучательФизическоеЛицо,
	|	ПеремещениеТоваров.ПоставщикФизическоеЛицо,
	|	ПеремещениеТоваров.ПолучательБИНСтруктурногоПодразделения,
	|	ПеремещениеТоваров.ПоставщикБИНСтруктурногоПодразделения,
	|	НЕОПРЕДЕЛЕНО КАК НомерДоверенностиОтпуск,
	|	НЕОПРЕДЕЛЕНО КАК ДатаДоверенностиОтпуск,
	|	ТаблицаТовары.НомерСтроки,
	|	ПеремещениеТоваров.ПолучательУчастникСРП,
	|	ПеремещениеТоваров.ПолучательУчастникСовместнойДеятельности,
	|	ВЫРАЗИТЬ(СправочникНоменклатура.ВесНетто * ТаблицаТовары.Количество КАК ЧИСЛО(15, 3)) КАК ВесНетто
	|ПОМЕСТИТЬ вт_ДанныеДокумента
	|ИЗ
	|	вт_ДанныеДокПоставщикПолучатель КАК ПеремещениеТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПеремещениеТоваров.Товары КАК ТаблицаТовары
	|		ПО (ТаблицаТовары.Ссылка = ПеремещениеТоваров.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО (ТаблицаТовары.Номенклатура = СправочникНоменклатура.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
	|		ПО (ТаблицаТовары.ЕдиницаИзмерения = КлассификаторЕдиницИзмерения.Ссылка)";
	
	Если Не ПервыйЗапрос Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПОМЕСТИТЬ вт_ДанныеДокумента", "");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РАЗРЕШЕННЫЕ", "");	
	КонецЕсли;
	
	Возврат ТекстЗапроса;

КонецФункции

//ввод СНТ импорт на основании ПТУ
Функция ТекстЗапросаПоступлениеТоваровУслугИмпорт(ПервыйЗапрос = Истина)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПоступлениеТоваровУслуг.Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК ОрганизацияПолучатель,
	|	ПоступлениеТоваровУслуг.СтруктурноеПодразделение КАК СтруктурноеПодразделение,
	|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК СтруктурноеПодразделениеПолучатель,
	|	ПоступлениеТоваровУслуг.Контрагент КАК Поставщик,
	|	ПоступлениеТоваровУслуг.Организация КАК Контрагент,
	|	ВЫБОР
	|		КОГДА &ЭтоИсправленнаяСНТ
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыСНТ.Исправленная)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыСНТ.Первичная)
	|	КОНЕЦ КАК ТипСНТ,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСНТ.Ввоз) КАК ВидОперации,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыВывозаСНТ.ПустаяСсылка) КАК ВидВывоза,
	|	ВЫБОР
	|		КОГДА КлассификаторСтранМира.КодАльфа2 = ""KZ""
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыВвозаСНТ.ПустаяСсылка)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыВвозаСНТ.Импорт)
	|	КОНЕЦ КАК ВидВвоза,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыПеремещенияСНТ.ПустаяСсылка) КАК ВидПеремещения,
	|	ВЫБОР
	|		КОГДА НЕ ПоступлениеТоваровУслуг.СтруктурноеПодразделение.УказыватьРеквизитыГоловнойОрганизации
	|			ТОГДА ПоступлениеТоваровУслуг.СтруктурноеПодразделение
	|		КОГДА ПоступлениеТоваровУслуг.Организация.УказыватьРеквизитыГоловнойОрганизацииВСчетеФактуре
	|			ТОГДА ОрганизацияГоловная.Ссылка
	|		ИНАЧЕ ПоступлениеТоваровУслуг.Организация
	|	КОНЕЦ КАК Получатель,
	|	ПоступлениеТоваровУслуг.Дата КАК ДатаОтгрузкиТовара,
	|	ТаблицаТовары.Ссылка КАК ДокументОснование,
	|	ПоступлениеТоваровУслуг.ВалютаДокумента КАК Валюта,
	|	ПоступлениеТоваровУслуг.ВалютаДокумента.БуквенныйКод КАК ВалютаКод,
	|	ПоступлениеТоваровУслуг.КурсВзаиморасчетов КАК КурсВалюты,
	|	ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка) КАК СкладОтправитель,
	|	ПоступлениеТоваровУслуг.Склад КАК СкладПолучатель,
	|	ТаблицаТовары.Номенклатура КАК Товар,
	|	СправочникНоменклатура.НаименованиеПолное КАК ТоварНаименование,
	|	СправочникНоменклатура.КодТНВЭД КАК КодТНВЭД,
	|	ТаблицаТовары.ЕдиницаИзмерения,
	|	КлассификаторЕдиницИзмерения.КодЭСФ КАК ЕдиницаИзмеренияКод,
	|	ТаблицаТовары.Количество,
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваровУслуг.УчитыватьНДС
	|				И ПоступлениеТоваровУслуг.СуммаВключаетНДС
	|			ТОГДА ВЫРАЗИТЬ((ТаблицаТовары.Сумма - ТаблицаТовары.СуммаНДС) / ТаблицаТовары.Количество КАК ЧИСЛО(14, 2))
	|		ИНАЧЕ ВЫРАЗИТЬ(ТаблицаТовары.Цена КАК ЧИСЛО(14, 2))
	|	КОНЕЦ КАК Цена,
	|	""5"" КАК ПризнакПроисхождения,
	|	"""" КАК НомерЗаявленияВРамкахТС,
	|	"""" КАК ИдентификаторТовара,
	|	"""" КАК НомерПозицииВДекларацииИлиЗаявлении,
	|	ЗНАЧЕНИЕ(Справочник.ИсточникиПроисхождения.ПустаяСсылка) КАК ИсточникПроисхождения,
	|	""Товары"" КАК ИмяТабличнойЧасти,
	|	""ПоступлениеТоваровУслуг"" КАК ИмяДокумента,
	|	ЛОЖЬ КАК ЗапрещеноРазбиватьДокумент,
	|	ЛОЖЬ КАК РаспределятьТоварыПоИП,
	|	"""" КАК ПрефиксВидаДокумента,
	|	"""" КАК НомерУчетногоДокумента,
	|	"""" КАК НомерПакета,
	|	ЗНАЧЕНИЕ(Справочник.СтавкиАкциза.ПустаяСсылка) КАК СтавкаАкциза,
	|	0 КАК СуммаАкциза,
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.СтавкаНДС <> ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка)
	|			ТОГДА ТаблицаТовары.СтавкаНДС.ДляОсвобожденногоОборота
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК БезНДС,
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваровУслуг.УчитыватьНДС
	|			ТОГДА ТаблицаТовары.СтавкаНДС
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка)
	|	КОНЕЦ КАК СтавкаНДС,
	|	ТаблицаТовары.СуммаНДС,
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваровУслуг.УчитыватьНДС
	|				И ПоступлениеТоваровУслуг.СуммаВключаетНДС
	|			ТОГДА ТаблицаТовары.Сумма - ТаблицаТовары.СуммаНДС
	|		ИНАЧЕ ТаблицаТовары.Сумма
	|	КОНЕЦ КАК ОборотПоРеализации,
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваровУслуг.УчитыватьНДС
	|				И ПоступлениеТоваровУслуг.СуммаВключаетНДС
	|			ТОГДА ТаблицаТовары.Сумма - ТаблицаТовары.СуммаНДС
	|		ИНАЧЕ ТаблицаТовары.Сумма
	|	КОНЕЦ КАК СуммаБезНалогов,
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваровУслуг.УчитыватьНДС
	|				И ПоступлениеТоваровУслуг.СуммаВключаетНДС
	|			ТОГДА ТаблицаТовары.Сумма
	|		ИНАЧЕ ТаблицаТовары.Сумма + ТаблицаТовары.СуммаНДС
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР
	|		КОГДА НЕ ПоступлениеТоваровУслуг.СтруктурноеПодразделение.УказыватьРеквизитыГоловнойОрганизации
	|			ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслуг.СтруктурноеПодразделение.ИдентификационныйНомер, """")
	|		КОГДА ПоступлениеТоваровУслуг.Организация.УказыватьРеквизитыГоловнойОрганизацииВСчетеФактуре
	|			ТОГДА ЕСТЬNULL(ОрганизацияГоловная.ИдентификационныйНомер, """")	
	|		ИНАЧЕ ЕСТЬNULL(Организации.ИдентификационныйНомер, """")
	|	КОНЕЦ КАК ПолучательИдентификатор,
	|	ВЫБОР
	|		КОГДА НЕ ПоступлениеТоваровУслуг.СтруктурноеПодразделение.УказыватьРеквизитыГоловнойОрганизации
	|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ПоступлениеТоваровУслуг.СтруктурноеПодразделение.НаименованиеПолное, """") КАК СТРОКА(200))
	|		КОГДА ПоступлениеТоваровУслуг.Организация.УказыватьРеквизитыГоловнойОрганизацииВСчетеФактуре
	|			ТОГДА ЕСТЬNULL(ВЫРАЗИТЬ(ОрганизацияГоловная.НаименованиеПолное КАК СТРОКА(200)), """")	
	|		ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(Организации.НаименованиеПолное, """") КАК СТРОКА(200))
	|	КОНЕЦ КАК ПолучательНаименование,
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваровУслуг.СтруктурноеПодразделение.УказыватьРеквизитыГоловнойОрганизации
	|			ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслуг.СтруктурноеПодразделение.ИдентификационныйНомер, """")
	|		КОГДА ПоступлениеТоваровУслуг.Организация.УказыватьРеквизитыГоловнойОрганизацииВСчетеФактуре
	|			ТОГДА ЕСТЬNULL(Организации.ИдентификационныйНомер, """")	
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ПолучательБИНСтруктурногоПодразделения,
	|	"""" КАК ПоставщикБИНСтруктурногоПодразделения,
	|	ЛОЖЬ КАК ПолучательНерезидент,
	|	ЛОЖЬ КАК ПолучательРозничнаяРеализация,
	|	ЛОЖЬ КАК ПолучательРозничныйРеализатор,
	|	ЛОЖЬ КАК ПолучательМалаяТорговаяТочка,
	|	""KZ"" КАК ПолучательКодСтраны,
	|	""KZ"" КАК ПолучательКодСтраныДоставки,
	|	ВЫБОР
	|		КОГДА НЕ ПоступлениеТоваровУслуг.СтруктурноеПодразделение.УказыватьРеквизитыГоловнойОрганизации
	|			ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслуг.СтруктурноеПодразделение, """")
	|		ИНАЧЕ ПоступлениеТоваровУслуг.Организация
	|	КОНЕЦ КАК Грузополучатель,
	|	ВЫБОР
	|		КОГДА НЕ ПоступлениеТоваровУслуг.СтруктурноеПодразделение.УказыватьРеквизитыГоловнойОрганизации
	|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ПоступлениеТоваровУслуг.СтруктурноеПодразделение.НаименованиеПолное, """") КАК СТРОКА(200))
	|		ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(Организации.НаименованиеПолное, """") КАК СТРОКА(200))
	|	КОНЕЦ КАК ГрузополучательНаименование,
	|	ВЫБОР
	|		КОГДА НЕ ПоступлениеТоваровУслуг.СтруктурноеПодразделение.УказыватьРеквизитыГоловнойОрганизации
	|			ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслуг.СтруктурноеПодразделение.ИдентификационныйНомер, """")
	|		ИНАЧЕ ЕСТЬNULL(Организации.ИдентификационныйНомер, """")
	|	КОНЕЦ КАК ГрузополучательИдентификатор,
	|	ЛОЖЬ КАК ГрузополучательНерезидент,
	|	ПоступлениеТоваровУслуг.Контрагент КАК Грузоотправитель,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(Контрагенты.НаименованиеПолное КАК СТРОКА(200))) <> """"
	|			ТОГДА ВЫРАЗИТЬ(Контрагенты.НаименованиеПолное КАК СТРОКА(200))
	|		ИНАЧЕ Контрагенты.Наименование
	|	КОНЕЦ КАК ГрузоотправительНаименование,
	|	ВЫБОР
	|		КОГДА КлассификаторСтранМира.КодАльфа2 <> ""KZ""
	|				И КлассификаторСтранМира.УчастникТаможенногоСоюза <> ЗНАЧЕНИЕ(Справочник.СтраныУчастникиТаможенногоСоюза.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(Контрагенты.НомерНалоговойРегистрацииВСтранеРезидентства, Контрагенты.ИдентификационныйКодЛичности)// ЕРП - РегистрационныйНомер
	|		КОГДА КлассификаторСтранМира.КодАльфа2 <> ""KZ""
	|				И КлассификаторСтранМира.УчастникТаможенногоСоюза = ЗНАЧЕНИЕ(Справочник.СтраныУчастникиТаможенногоСоюза.ПустаяСсылка)
	|			ТОГДА """"
	|		ИНАЧЕ ЕСТЬNULL(Контрагенты.ИдентификационныйКодЛичности, """")
	|	КОНЕЦ КАК ГрузоотправительИдентификатор,
	|	ВЫБОР
	|		КОГДА КлассификаторСтранМира.КодАльфа2 = ""KZ""
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ГрузоотправительНерезидент,
	|	""KZ"" КАК ГрузополучательКодСтраныОтправки,
	|	ВЫБОР
	|		КОГДА КлассификаторСтранМира.КодАльфа2 <> ""KZ""
	|			ТОГДА """"
	|		ИНАЧЕ ЕСТЬNULL(Контрагенты.ИдентификационныйКодЛичности, """")
	|	КОНЕЦ КАК ПоставщикИдентификатор,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(Контрагенты.НаименованиеПолное КАК СТРОКА(200))) <> """"
	|			ТОГДА ВЫРАЗИТЬ(Контрагенты.НаименованиеПолное КАК СТРОКА(200))
	|		ИНАЧЕ Контрагенты.Наименование
	|	КОНЕЦ КАК ПоставщикНаименование,
	|	КлассификаторСтранМира.КодАльфа2 КАК ПоставщикКодСтраны,
	|	КлассификаторСтранМира.КодАльфа2 КАК ПоставщикКодСтраныОтправки,
	|	КлассификаторСтранМира.КодАльфа2 КАК ГрузоотправительКодСтраныОтправки,
	|	ВЫБОР
	|		КОГДА КлассификаторСтранМира.КодАльфа2 = ""KZ""
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ПоставщикНерезидент,
	|	ЛОЖЬ КАК ПоставщикРозничнаяРеализация,
	|	ЛОЖЬ КАК ПоставщикМалаяТорговаяТочка,
	|	"""" КАК АдресДоставки,
	|	"""" КАК АдресОтправки,
	|	ПоступлениеТоваровУслуг.ДоговорКонтрагента КАК ДоговорПоставки,
	|	ВЫБОР
	|		КОГДА ДоговорыКонтрагентов.НомерДоговора <> """"
	|				И ДоговорыКонтрагентов.ДатаДоговора <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК БезДоговора,
	|	ВЫБОР
	|		КОГДА КлассификаторСтранМира.КодАльфа2 <> ""KZ"" 
	|				И (ДоговорыКонтрагентов.НомерДоговора <> """" И ДоговорыКонтрагентов.ДатаДоговора <> ДАТАВРЕМЯ(1, 1, 1))
	|			ТОГДА ДоговорыКонтрагентов.УникальныйНомерВалютногоКонтроля
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК УникальныйНомерВалютногоКонтроля,
	|	ЛОЖЬ КАК УчитыватьАкциз,
	|	ПоступлениеТоваровУслуг.УчитыватьНДС,
	|	ПоступлениеТоваровУслуг.СуммаВключаетНДС,
	|	ЛОЖЬ КАК СуммаВключаетАкциз,
	|	ДоговорыКонтрагентов.НомерДоговора КАК ДоговорПоставкиНомер,
	|	ДоговорыКонтрагентов.ДатаДоговора КАК ДоговорПоставкиДата,
	|	ДоговорыКонтрагентов.УсловияОплаты КАК ДоговорПоставкиУсловияОплаты,
	|	ДоговорыКонтрагентов.УсловияПоставки КАК ДоговорПоставкиУсловияПоставки,
	|	ВЫБОР
	|		КОГДА &ЭтоИсправленнаяСНТ
	|			ТОГДА ПоступлениеТоваровУслуг.Ссылка
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ПервичныйДокументОснование,
	|	&ЭтоИсправленнаяСНТ КАК ЭтоИсправленнаяСНТ,
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваровУслуг.УчитыватьНДС
	|			ТОГДА СтавкиНДС.Ставка
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СтавкаНДСЧисло,
	|	0 КАК СтавкаАкцизаЧисло,
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваровУслуг.Контрагент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	|				И НЕ ПоступлениеТоваровУслуг.Контрагент.ИндивидуальныйПредпринимательАдвокатЧастныйНотариус
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПоставщикФизическоеЛицо,
	|	ЛОЖЬ КАК ПолучательФизическоеЛицо,
	|	НЕОПРЕДЕЛЕНО КАК НомерДоверенностиОтпуск,
	|	НЕОПРЕДЕЛЕНО КАК ДатаДоверенностиОтпуск,
	|	ТаблицаТовары.НомерСтроки,
	|	ЛОЖЬ КАК ПолучательУчастникСРП,
	|	ЛОЖЬ КАК ПолучательУчастникСовместнойДеятельности,
	|	ВЫРАЗИТЬ(СправочникНоменклатура.ВесНетто * ТаблицаТовары.Количество КАК ЧИСЛО(15, 3)) КАК ВесНетто
	|ПОМЕСТИТЬ вт_ДанныеДокумента
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Товары КАК ТаблицаТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК ОрганизацияГоловная
	|				ПО Организации.ГоловнаяОрганизация = ОрганизацияГоловная.Ссылка
	|			ПО ПоступлениеТоваровУслуг.Организация = Организации.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|			ПО ПоступлениеТоваровУслуг.Контрагент = Контрагенты.Ссылка
	|		ПО ТаблицаТовары.Ссылка = ПоступлениеТоваровУслуг.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК КлассификаторСтранМира
	|		ПО (Контрагенты.СтранаРезидентства = КлассификаторСтранМира.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО ТаблицаТовары.Номенклатура = СправочникНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
	|		ПО ТаблицаТовары.ЕдиницаИзмерения = КлассификаторЕдиницИзмерения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО (ПоступлениеТоваровУслуг.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтавкиНДС КАК СтавкиНДС
	|		ПО ТаблицаТовары.СтавкаНДС = СтавкиНДС.Ссылка
	|ГДЕ
	|	ПоступлениеТоваровУслуг.Ссылка В(&МассивДокументов)";

	
	Если Не ПервыйЗапрос Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПОМЕСТИТЬ вт_ДанныеДокумента", "");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РАЗРЕШЕННЫЕ", "");
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции	

#КонецОбласти

#Область ОбщиеФункцииПоЗапросам

Функция ПолучитьТекстЗапросаДляМассива(МассивВидовДокумента)
	
	ТекстЗапроса = "";
	ЕстьЭСФ = Ложь;
	УникальныеТипыЭлементов = Новый Массив;
	Для Каждого ЭлементМассива Из МассивВидовДокумента Цикл
		//Проверка ниже необходима так как сейчас в функцию передается массив документов вместо массива типов документов.
		//Это связано с тем, что для одного типа документа - Реализация товаров и услуг возможны два запроса из-за вида операции - Передача структурному подразделению.
		ТипТекущегоЭлемента = Строка(ТипЗнч(ЭлементМассива));
		Если ТипЗнч(ЭлементМассива) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			Если ЭлементМассива.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРеализацияТоваров.ПередачаСтруктурномуПодразделению") Тогда
				ТипТекущегоЭлемента = ТипТекущегоЭлемента + ".ПередачаСтруктурномуПодразделению";
			КонецЕсли;
		КонецЕсли;
		Если УникальныеТипыЭлементов.Найти(ТипТекущегоЭлемента) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		УникальныеТипыЭлементов.Добавить(ТипТекущегоЭлемента);
		
		ТекстЗапросаДокумента = "";
		Если ТипЗнч(ЭлементМассива) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
			ТекстЗапросаДокумента = ТекстЗапросаПеремещениеТоваров(ТекстЗапроса = "");
		ИначеЕсли ТипЗнч(ЭлементМассива) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			Если ЭлементМассива.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРеализацияТоваров.ПередачаСтруктурномуПодразделению") Тогда
				ТекстЗапросаДокумента = ТекстЗапросаРеализацияТоваровУслугПередачаСтруктурномуПодразделению(ТекстЗапроса = "");
			Иначе
				ТекстЗапросаДокумента = ТекстЗапросаРеализацияТоваровУслуг(ТекстЗапроса = "");
			КонецЕсли;
		ИначеЕсли ТипЗнч(ЭлементМассива) = Тип("ДокументСсылка.ВозвратТоваровПоставщику") Тогда
			ТекстЗапроса = ТекстЗапросаВозвратТоваровПоставщику(ТекстЗапроса = "");
		ИначеЕсли ТипЗнч(ЭлементМассива) = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя") Тогда
			ТекстЗапроса = ТекстЗапросаВозвратТоваровОтПокупателей(ТекстЗапроса = "");
		ИначеЕсли ТипЗнч(ЭлементМассива) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
			ТекстЗапроса = ТекстЗапросаПоступлениеТоваровУслугИмпорт(ТекстЗапроса = "");
		ИначеЕсли ТипЗнч(ЭлементМассива) = Тип("ДокументСсылка.ОтчетОРозничныхПродажах") Тогда
			ТекстЗапроса = ТекстЗапросаОтчетОРозничныхПродажах(ТекстЗапроса = "");
		КонецЕсли;
		
		Если ТекстЗапроса <> "" И ТекстЗапросаДокумента <> "" Тогда
			ТекстЗапроса = ТекстЗапроса + "
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|";
		КонецЕсли;
		
		ТекстЗапроса = ТекстЗапроса + ТекстЗапросаДокумента;
		
	КонецЦикла;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПодготовитьТекстЗапросаДляЗаполненияСНТ(ПараметрыЗаполнения) Экспорт
	
	ДокументыОснования = ПараметрыЗаполнения.МассивДокументов;
	МассивВидовДокумента = ПараметрыЗаполнения.МассивВидовДокумента;

	Если ТипЗнч(ДокументыОснования) = Тип("Массив") Тогда
		ТекстЗапроса = ПолучитьТекстЗапросаДляМассива(ДокументыОснования);
		Если ТекстЗапроса = "" Тогда
			Возврат Неопределено;
		КонецЕсли;	
	ИначеЕсли ТипЗнч(ДокументыОснования) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		ТекстЗапроса = ТекстЗапросаПеремещениеТоваров();
	ИначеЕсли ТипЗнч(ДокументыОснования) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		Если ДокументыОснования.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРеализацияТоваров.ПередачаСтруктурномуПодразделению") Тогда
			ТекстЗапроса = ТекстЗапросаРеализацияТоваровУслугПередачаСтруктурномуПодразделению();
		Иначе
			ТекстЗапроса = ТекстЗапросаРеализацияТоваровУслуг();
		КонецЕсли;
	ИначеЕсли ТипЗнч(ДокументыОснования) = Тип("ДокументСсылка.ВозвратТоваровПоставщику") Тогда
		ТекстЗапроса = ТекстЗапросаВозвратТоваровПоставщику();
	ИначеЕсли ТипЗнч(ДокументыОснования) = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя") Тогда
		ТекстЗапроса = ТекстЗапросаВозвратТоваровОтПокупателей();
	ИначеЕсли ТипЗнч(ДокументыОснования) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда //БК
		ТекстЗапроса = ТекстЗапросаПоступлениеТоваровУслугИмпорт();
	ИначеЕсли ТипЗнч(ДокументыОснования) = Тип("ДокументСсылка.ОтчетОРозничныхПродажах") Тогда
		ТекстЗапроса = ТекстЗапросаОтчетОРозничныхПродажах();	
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + "
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	СкладОтправитель";
		
	ТекстЗапроса =  ТекстЗапроса + ПолучитьТекстЗапросаКонтактнаяИнформация() + ПолучитьТекстЗапросаЦена(ПараметрыЗаполнения);
	
	Возврат ТекстЗапроса;
	
КонецФункции

//Функция возвращает текст запроса для получени контактной информации Организаций
//
Функция ПолучитьТекстЗапросаКонтактнаяИнформация()
	
	ТекстЗапросаКонтактнаяИнформация = 
	"
	|;
	|
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Организации.Ссылка КАК Объект,
	|	ВЫБОР
	|		КОГДА Организации.Ссылка ССЫЛКА Справочник.Организации
	|			ТОГДА ВЫБОР
	|					КОГДА Организации.Ссылка.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	|						ТОГДА Организации.Ссылка.ИндивидуальныйПредприниматель
	|					ИНАЧЕ Организации.Ссылка
	|				КОНЕЦ
	|		ИНАЧЕ Организации.Ссылка
	|	КОНЕЦ КАК ОбъектДляПоискаАдреса,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(Организации.НаименованиеПолное КАК СТРОКА(200))) <> """"""""
	|			ТОГДА ВЫРАЗИТЬ(Организации.НаименованиеПолное КАК СТРОКА(200))
	|		ИНАЧЕ Организации.Наименование
	|	КОНЕЦ КАК Наименование,
	|	Организации.ИдентификационныйНомер
	|ПОМЕСТИТЬ ОбъектыДляПоискаАдресов
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.Ссылка В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				вт_ДанныеДокумента.Организация
	|			ИЗ
	|				вт_ДанныеДокумента КАК вт_ДанныеДокумента
	|		
	|)
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПодразделенияОрганизаций.Ссылка,
	|	ПодразделенияОрганизаций.Ссылка,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(ПодразделенияОрганизаций.НаименованиеПолное КАК СТРОКА(200))) <> """"
	|			ТОГДА ВЫРАЗИТЬ(ПодразделенияОрганизаций.НаименованиеПолное КАК СТРОКА(200))
	|		ИНАЧЕ ПодразделенияОрганизаций.Наименование
	|	КОНЕЦ,
	|	ПодразделенияОрганизаций.ИдентификационныйНомер
	|ИЗ
	|	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
	|ГДЕ
	|	ПодразделенияОрганизаций.Ссылка В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				вт_ДанныеДокумента.СтруктурноеПодразделение
	|			ИЗ
	|				вт_ДанныеДокумента КАК вт_ДанныеДокумента
	|		
	|)
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Контрагент.Ссылка,
	|	Контрагент.Ссылка,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(Контрагент.НаименованиеПолное КАК СТРОКА(200))) <> """"
	|			ТОГДА ВЫРАЗИТЬ(Контрагент.НаименованиеПолное КАК СТРОКА(200))
	|		ИНАЧЕ Контрагент.Наименование
	|	КОНЕЦ,
	|	""""
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагент
	|ГДЕ
	|	Контрагент.Ссылка В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					ВЫБОР 
	|						КОГДА вт_ДанныеДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСНТ.Ввоз)
	|							ТОГДА вт_ДанныеДокумента.Поставщик
	|						ИНАЧЕ вт_ДанныеДокумента.Получатель
	|					КОНЕЦ
	|				
	|			ИЗ
	|				вт_ДанныеДокумента КАК вт_ДанныеДокумента
	|		
	|			)
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ОбъектыДляПоискаАдресов.Объект КАК Организация,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(КонтактнаяИнформация.Представление КАК СТРОКА(400)),"""") КАК АдресОрганизации,
	|	ОбъектыДляПоискаАдресов.Наименование,
	|	ОбъектыДляПоискаАдресов.ИдентификационныйНомер
	|ПОМЕСТИТЬ вт_КонтактнаяИнформация
	|ИЗ
	|	ОбъектыДляПоискаАдресов КАК ОбъектыДляПоискаАдресов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ПО (КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|			И ОбъектыДляПоискаАдресов.ОбъектДляПоискаАдреса = КонтактнаяИнформация.Объект
	|			И (КонтактнаяИнформация.Вид В (ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресКонтрагента), ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресОрганизации), ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресФизЛица)))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация"; 
	
	Возврат ТекстЗапросаКонтактнаяИнформация;
	
КонецФункции

Функция ПолучитьДополнительныеПереопределяемыеПоля() Экспорт
	
	ТекстЗапроса = ",
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(вт_ДанныеДокумента.ДокументОснование) В (&ТипыДокументовВозвратаКлиента)
	|			И вт_ДанныеДокумента.ТипСНТ = ЗНАЧЕНИЕ(Перечисление.ТипыСНТ.ВозвратТоваров)
	|		ТОГДА ВЫБОР
	|			КОГДА СвязанныйСНТ.ПолучательМалаяТорговаяТочка
	|				ТОГДА ЕСТЬNULL(ВиртуальныеСкладыКонтрагентаСправочник.ИдентификаторСклада,0)
	|			КОГДА СвязанныйСНТ.ПолучательФизическоеЛицо
	|				ТОГДА СвязанныйСНТ.СкладДоставкиИдентификатор
	|			КОНЕЦ
	|		ИНАЧЕ ЕСТЬNULL(СоответствиеСкладовДляОтправителя.ВиртуальныйСклад.ИдентификаторСклада, 0)
	|	КОНЕЦ КАК СкладОтправкиИдентификатор,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(вт_ДанныеДокумента.ДокументОснование) В (&ТипыДокументовВозвратаКлиента)
	|			И вт_ДанныеДокумента.ТипСНТ = ЗНАЧЕНИЕ(Перечисление.ТипыСНТ.ВозвратТоваров)
	|		ТОГДА ВЫБОР
	|			КОГДА СвязанныйСНТ.ПолучательМалаяТорговаяТочка
	|				ТОГДА ЕСТЬNULL(ВиртуальныеСкладыКонтрагентаСправочник.Адрес, """") 
	|			КОГДА СвязанныйСНТ.ПолучательФизическоеЛицо ИЛИ СвязанныйСНТ.ПолучательНерезидент
	|				ТОГДА СвязанныйСНТ.АдресДоставки
	|			КОНЕЦ
	|		КОГДА вт_ДанныеДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСНТ.Ввоз)
	|			ТОГДА ЕСТЬNULL(КонтактнаяИнформацияКонтрагента.АдресОрганизации, """")
	|		ИНАЧЕ ЕСТЬNULL(СоответствиеСкладовДляОтправителя.ВиртуальныйСклад.Адрес, """")
	|	КОНЕЦ КАК АдресОтправки,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(вт_ДанныеДокумента.ДокументОснование) В (&ТипыДокументовСЗаполнениемВСКонтрагента)
	|			ТОГДА ЕСТЬNULL(ВиртуальныеСкладыКонтрагента.ВиртуальныйСкладКонтрагента.ИдентификаторСклада, """")
	|		ИНАЧЕ ЕСТЬNULL(СоответствиеСкладовДляПолучателя.ВиртуальныйСклад.ИдентификаторСклада, """")
	|	КОНЕЦ КАК СкладДоставкиИдентификатор,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(вт_ДанныеДокумента.ДокументОснование) В (&ТипыДокументовСЗаполнениемВСКонтрагента)
	|				И вт_ДанныеДокумента.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСНТ.Вывоз)
	|		ТОГДА ЕСТЬNULL(ВиртуальныеСкладыКонтрагента.ВиртуальныйСкладКонтрагента.Адрес, """")
	|		КОГДА вт_ДанныеДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСНТ.Вывоз)
	|			ТОГДА ЕСТЬNULL(КонтактнаяИнформацияКонтрагента.АдресОрганизации, """")
	|		ИНАЧЕ ЕСТЬNULL(СоответствиеСкладовДляПолучателя.ВиртуальныйСклад.Адрес, """")
	|	КОНЕЦ КАК АдресДоставки,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(вт_ДанныеДокумента.ДокументОснование) В (&ТипыДокументовВозвратаКлиента)
	|			И вт_ДанныеДокумента.ТипСНТ = ЗНАЧЕНИЕ(Перечисление.ТипыСНТ.ВозвратТоваров)
	|			И СвязанныйСНТ.ПолучательНерезидент
	|		ТОГДА СвязанныйСНТ.АвтомобильныйТранспорт
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК АвтомобильныйТранспорт,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(вт_ДанныеДокумента.ДокументОснование) В (&ТипыДокументовВозвратаКлиента)
	|			И вт_ДанныеДокумента.ТипСНТ = ЗНАЧЕНИЕ(Перечисление.ТипыСНТ.ВозвратТоваров)
	|			И СвязанныйСНТ.ПолучательНерезидент
	|		ТОГДА СвязанныйСНТ.НомерТС
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК НомерТС,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(вт_ДанныеДокумента.ДокументОснование) В (&ТипыДокументовВозвратаКлиента)
	|			И вт_ДанныеДокумента.ТипСНТ = ЗНАЧЕНИЕ(Перечисление.ТипыСНТ.ВозвратТоваров)
	|			И СвязанныйСНТ.ПолучательНерезидент
	|		ТОГДА СвязанныйСНТ.ГосномерПрицепа
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ГосномерПрицепа,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(вт_ДанныеДокумента.ДокументОснование) В (&ТипыДокументовВозвратаКлиента)
	|			И вт_ДанныеДокумента.ТипСНТ = ЗНАЧЕНИЕ(Перечисление.ТипыСНТ.ВозвратТоваров)
	|			И СвязанныйСНТ.ПолучательНерезидент
	|		ТОГДА СвязанныйСНТ.ЖелезнодорожныйТранспорт 
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЖелезнодорожныйТранспорт,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(вт_ДанныеДокумента.ДокументОснование) В (&ТипыДокументовВозвратаКлиента)
	|			И вт_ДанныеДокумента.ТипСНТ = ЗНАЧЕНИЕ(Перечисление.ТипыСНТ.ВозвратТоваров)
	|			И СвязанныйСНТ.ПолучательНерезидент
	|		ТОГДА СвязанныйСНТ.НомерВагона
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК НомерВагона,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(вт_ДанныеДокумента.ДокументОснование) В (&ТипыДокументовВозвратаКлиента)
	|			И вт_ДанныеДокумента.ТипСНТ = ЗНАЧЕНИЕ(Перечисление.ТипыСНТ.ВозвратТоваров)
	|			И СвязанныйСНТ.ПолучательНерезидент
	|		ТОГДА СвязанныйСНТ.ВоздушныйТранспорт
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВоздушныйТранспорт,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(вт_ДанныеДокумента.ДокументОснование) В (&ТипыДокументовВозвратаКлиента)
	|			И вт_ДанныеДокумента.ТипСНТ = ЗНАЧЕНИЕ(Перечисление.ТипыСНТ.ВозвратТоваров)
	|			И СвязанныйСНТ.ПолучательНерезидент
	|		ТОГДА СвязанныйСНТ.НомерБорта
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК НомерБорта,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(вт_ДанныеДокумента.ДокументОснование) В (&ТипыДокументовВозвратаКлиента)
	|			И вт_ДанныеДокумента.ТипСНТ = ЗНАЧЕНИЕ(Перечисление.ТипыСНТ.ВозвратТоваров)
	|			И СвязанныйСНТ.ПолучательНерезидент
	|		ТОГДА СвязанныйСНТ.МорскойТранспорт
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК МорскойТранспорт,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(вт_ДанныеДокумента.ДокументОснование) В (&ТипыДокументовВозвратаКлиента)
	|			И вт_ДанныеДокумента.ТипСНТ = ЗНАЧЕНИЕ(Перечисление.ТипыСНТ.ВозвратТоваров)
	|			И СвязанныйСНТ.ПолучательНерезидент
	|		ТОГДА СвязанныйСНТ.НомерСудна
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК НомерСудна,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(вт_ДанныеДокумента.ДокументОснование) В (&ТипыДокументовВозвратаКлиента)
	|			И вт_ДанныеДокумента.ТипСНТ = ЗНАЧЕНИЕ(Перечисление.ТипыСНТ.ВозвратТоваров)
	|			И СвязанныйСНТ.ПолучательНерезидент
	|		ТОГДА СвязанныйСНТ.Трубопровод
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Трубопровод,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(вт_ДанныеДокумента.ДокументОснование) В (&ТипыДокументовВозвратаКлиента)
	|			И вт_ДанныеДокумента.ТипСНТ = ЗНАЧЕНИЕ(Перечисление.ТипыСНТ.ВозвратТоваров)
	|			И СвязанныйСНТ.ПолучательНерезидент
	|		ТОГДА СвязанныйСНТ.Мультимодальный 
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Мультимодальный
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПолучитьЕдиницуИзмеренияОтбора(СтрокаТЧ) Экспорт 
	
	ЕдиницаИзмеренияОтбора = СтрокаТЧ.ЕдиницаИзмерения;	
	
	Возврат ЕдиницаИзмеренияОтбора;
	
КонецФункции

Функция ПолучитьСтавкуАкциза(СтавкаАкциза) Экспорт 
	
	Возврат УчетНДСиАкцизаВызовСервераПовтИсп.ПолучитьСтавкуАкциза(СтавкаАкциза);
	
КонецФункции

Процедура ДополнитьСтавкуАкцизаИзСправочника(СтавкаАкцизаСсылка, СтавкаАкцизаЧисло) Экспорт
	
	СтавкаАкцизаЧисло = ПолучитьСтавкуАкциза(СтавкаАкцизаСсылка);
	
КонецПроцедуры

Функция ПолучитьСтавкуНДС(СтавкаНДС) Экспорт 
	
	Возврат УчетНДСиАкцизаВызовСервераПовтИсп.ПолучитьСтавкуНДС(СтавкаНДС);
	
КонецФункции

Процедура ЗаполнитьСоответсвиеИменРеквизитовПолейЗапросов(СоответсвиеИменРеквизитовПолейЗапросов) Экспорт
	
	Для Каждого ЭлементСоответсвия Из СоответсвиеИменРеквизитовПолейЗапросов Цикл
		Значение = "";
		Если ЭлементСоответсвия.Ключ = "%СчетФактураДата" Тогда
			Значение = "Дата"
			
		ИначеЕсли ЭлементСоответсвия.Ключ = "%ТекстПоляУслуга"	Тогда
			Значение = "ВЫБОР 
											|		КОГДА ОстаткиГТД.Номенклатура ССЫЛКА Справочник.Номенклатура
											|			ТОГДА ОстаткиГТД.Номенклатура.Услуга
											|		ИНАЧЕ ЛОЖЬ
											|	КОНЕЦ КАК Услуга";
											
		ИначеЕсли ЭлементСоответсвия.Ключ = "%ТекстПоляУслугаСпрНоменклатура" Тогда
			Значение = "ЕСТЬNULL(СпрНоменклатура.Услуга, Ложь) КАК Услуга";  						
							
		ИначеЕсли ЭлементСоответсвия.Ключ = "%ТекстПоляТипИзмеряемойВеличины"	Тогда	
			Если ТипЗнч(ЭлементСоответсвия.Значение) = Тип("Структура")
				И ЭлементСоответсвия.Значение.Свойство("ЕдиницаИзмерения")	 Тогда
				Значение = ЭлементСоответсвия.Значение.ЕдиницаИзмерения;
			Иначе
				Значение = "ТаблицаТовары.ЕдиницаИзмерения";
			КонецЕсли;
			
		ИначеЕсли ЭлементСоответсвия.Ключ = "%ТекстПоляПодразделениеОрганизацииСНТ"	Тогда	
			Значение = "ВЫБОР
											|		КОГДА ТоварыИсправляемогоСНТ.Ссылка.Поставщик ССЫЛКА Справочник.ПодразделенияОрганизаций
											|			ТОГДА ТоварыИсправляемогоСНТ.Ссылка.Поставщик 
											|		ИНАЧЕ &ПодразделенияОрганизацийПустаяСсылка
											|	КОНЕЦ ";
			
		ИначеЕсли ЭлементСоответсвия.Ключ = "%ТекстПоляПодразделениеОрганизацииЭСФ"	Тогда	
			Значение = "ВЫБОР
											|		КОГДА ТоварыЭСФ.Ссылка.СтруктурноеПодразделение ССЫЛКА Справочник.ПодразделенияОрганизаций
											|			ТОГДА ТоварыЭСФ.Ссылка.СтруктурноеПодразделение 
											|		ИНАЧЕ &ПодразделенияОрганизацийПустаяСсылка
											|	КОНЕЦ";

			
		ИначеЕсли ЭлементСоответсвия.Ключ = "%ДанныеДокументаЕдиницаИзмерения" Тогда	
			Значение = "вт_ДанныеДокумента.ЕдиницаИзмерения";
			
		ИначеЕсли ЭлементСоответсвия.Ключ = "%ЭСФТекстПоляТипИзмеряемойВеличины"	Тогда	
			Значение = "Товары.ЕдиницаИзмерения";
			
		ИначеЕсли ЭлементСоответсвия.Ключ = "%ЭДВСТекстПоляЕдиницаИзмеренияИсходныеТовары" Тогда	
			Значение = "ИсходныеТовары.ЕдиницаИзмерения";
			
		ИначеЕсли ЭлементСоответсвия.Ключ = "%ЭДВСТекстПоляЕдиницаИзмеренияТовары" Тогда	
			Значение = "Товары.ЕдиницаИзмерения";
			
		ИначеЕсли ЭлементСоответсвия.Ключ = "%СтруктурнаяЕдиницаИдентификационныйНомер"	Тогда	
			Значение = "ИдентификационныйНомер";
			
		ИначеЕсли ЭлементСоответсвия.Ключ = "%КонтрагентИНН"	Тогда	
			Значение = "ИдентификационныйКодЛичности";
			
		ИначеЕсли ЭлементСоответсвия.Ключ = "%ОрганизацияИНН"	Тогда	
			Значение = "ИдентификационныйНомер";
			
		ИначеЕсли ЭлементСоответсвия.Ключ = "%БуквенныйКодВалюты"	Тогда	
			Значение = "БуквенныйКод";
			
		ИначеЕсли ЭлементСоответсвия.Ключ = "%ИмяРеквизитаВладелецДоговора"	Тогда	
			Значение = "Владелец";
			
		ИначеЕсли ЭлементСоответсвия.Ключ = "%ДоговорНомер"	Тогда	
			Значение = "НомерДоговора";
			
		ИначеЕсли ЭлементСоответсвия.Ключ = "%ДоговорДата"	Тогда	
			Значение = "ДатаДоговора";
			
		ИначеЕсли ЭлементСоответсвия.Ключ = "%ЭСФДоговорПоставкиУчастникСРП"	Тогда	
			Значение = "СНТ.ДоговорПоставки.УчастникСРП ";
			
		ИначеЕсли ЭлементСоответсвия.Ключ = "%КлассификаторЕдиницИзмерения"	Тогда	
			Значение = "Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка";
			
		ИначеЕсли ЭлементСоответсвия.Ключ = "%УсловиеДоговорыКонтрагентовУчастникСРП"	Тогда	
			Значение = "И ДоговорыКонтрагентов.УчастникСРП = &УчастникСРП";
			
		ИначеЕсли ЭлементСоответсвия.Ключ = "%Получатель_УчастникСРП"	Тогда	
			Значение = "ЕСТЬNULL(ДоговорыКонтрагентов.УчастникСРП, ЛОЖЬ)";
			
		ИначеЕсли ЭлементСоответсвия.Ключ = "%ЭСФДоговорКонтрагентаУчастникСРП"	Тогда	
			Значение = "ЕСТЬNULL(СчетФактураВыданный.ДоговорКонтрагента.УчастникСРП, ЛОЖЬ)";
			
		ИначеЕсли ЭлементСоответсвия.Ключ = "%ЭСФПоверенныйОператор"	Тогда	
			Значение = "ЕСТЬNULL(СчетФактураВыданный.ДоговорКонтрагента.ПоверенныйОператор, Значение(Справочник.Контрагенты.ПустаяСсылка))";
			
		ИначеЕсли ЭлементСоответсвия.Ключ = "%ЭСФПоверенныйПокупателяБИН"	Тогда	
			Значение = "ДанныеСчетовФактур.ПоверенныйОператор.ИдентификационныйКодЛичности";
			
		ИначеЕсли ЭлементСоответсвия.Ключ = "%ЭСФПоверенныйПокупателяНаименование"	Тогда	
			Значение = "ВЫБОР
							|		КОГДА (ВЫРАЗИТЬ(ДанныеСчетовФактур.ПоверенныйОператор.НаименованиеПолное КАК СТРОКА(400))) <> """"
							|			ТОГДА ВЫРАЗИТЬ(ДанныеСчетовФактур.ПоверенныйОператор.НаименованиеПолное КАК СТРОКА(400))
							|		ИНАЧЕ ДанныеСчетовФактур.ПоверенныйОператор.Наименование
							|	КОНЕЦ";
			
		ИначеЕСли ЭлементСоответсвия.Ключ = "%ЭСФТоварыКоэффициент"	Тогда
			Значение = "1";
			
		КонецЕсли;
		
		СоответсвиеИменРеквизитовПолейЗапросов.Вставить(ЭлементСоответсвия.Ключ, Значение);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСоответсвиеИменРеквизитовПолейЗапросовКоличество(СоответсвиеИменРеквизитовПолейЗапросов, ИмяТабличнойЧасти) Экспорт
	
	Для Каждого ЭлементСоответсвия Из СоответсвиеИменРеквизитовПолейЗапросов Цикл
		
		Если ЭлементСоответсвия.Ключ = "%Количество" Тогда
			
			Значение = "Количество";
			СоответсвиеИменРеквизитовПолейЗапросов.Вставить(ЭлементСоответсвия.Ключ, Значение);
			
		КонецЕсли;
		
		Если ЭлементСоответсвия.Ключ = "%ЕдиницаИзмеренияКод" Тогда
			
			Если ИмяТабличнойЧасти = "Товары" ИЛИ ИмяТабличнойЧасти = "ТоварыВС" Тогда
				
				Значение = "ТаблицаТовары.ЕдиницаИзмеренияКод";
			Иначе
				
				Значение = "0";
				
			КонецЕсли;
			СоответсвиеИменРеквизитовПолейЗапросов.Вставить(ЭлементСоответсвия.Ключ, Значение);		
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьРеквизитыОрганизацииКонтрагента(Ссылка, Реквизит) Экспорт
	
	СтруктураДанных = Новый Структура;
	
	СтруктураДанных.Вставить(Реквизит+"Наименование", "");
	СтруктураДанных.Вставить(Реквизит+"Идентификатор", "");
	СтруктураДанных.Вставить(Реквизит+"ЯвляетсяСП", "");
	СтруктураДанных.Вставить(Реквизит+"Нерезидент", "");
	СтруктураДанных.Вставить("АдресОтправки", "");
	СтруктураДанных.Вставить(Реквизит+"КодСтраныДоставки", "");
	СтруктураДанных.Вставить(Реквизит+"КодСтраныОтправки", "");
	СтруктураДанных.Вставить(Реквизит+"КодСтраны", "");
	СтруктураДанных.Вставить(Реквизит+"БИНСтруктурногоПодразделения", "");
	СтруктураДанных.Вставить("Получатель", ?(Реквизит = "Получатель", Ссылка, ""));
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА Таблица.УказыватьРеквизитыГоловнойОрганизации
	|			ТОГДА РеквизитыГоловнаяОрганизация.Ссылка
	|		ИНАЧЕ Таблица.Ссылка
	|	КОНЕЦ КАК Объект,
	|	Таблица.ЯвляетсяСтруктурнымПодразделением КАК ЯвляетсяСП,
	|	ЛОЖЬ КАК Нерезидент,
	|	ЕСТЬNULL(Таблица.МестныйБюджет.СтранаРезидентства, """") КАК СтранаРегистрации,
	|	ВЫБОР
	|		КОГДА Таблица.УказыватьРеквизитыГоловнойОрганизации
	|			ТОГДА Таблица.ИдентификационныйНомер
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК БИНСтруктурногоПодразделения,
	|	ВЫБОР
	|		КОГДА Таблица.УказыватьРеквизитыГоловнойОрганизации
	|			ТОГДА ВЫБОР
	|					КОГДА (ВЫРАЗИТЬ(РеквизитыГоловнаяОрганизация.НаименованиеПолное КАК СТРОКА(200))) <> """"""""
	|						ТОГДА ВЫРАЗИТЬ(РеквизитыГоловнаяОрганизация.НаименованиеПолное КАК СТРОКА(200))
	|					ИНАЧЕ РеквизитыГоловнаяОрганизация.Наименование
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА (ВЫРАЗИТЬ(Таблица.НаименованиеПолное КАК СТРОКА(200))) <> """"""""
	|					ТОГДА ВЫРАЗИТЬ(Таблица.НаименованиеПолное КАК СТРОКА(200))
	|				ИНАЧЕ Таблица.Наименование
	|			КОНЕЦ
	|	КОНЕЦ КАК Наименование,
	|	ВЫБОР
	|		КОГДА Таблица.УказыватьРеквизитыГоловнойОрганизации
	|			ТОГДА ЕСТЬNULL(РеквизитыГоловнаяОрганизация.ИдентификационныйНомер, """""""")
	|		ИНАЧЕ ЕСТЬNULL(Таблица.ИдентификационныйНомер, """""""")
	|	КОНЕЦ КАК Идентификатор
	|ПОМЕСТИТЬ ДанныеПоОбъектам
	|ИЗ
	|	Справочник.ПодразделенияОрганизаций КАК Таблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК РеквизитыГоловнаяОрганизация
	|		ПО Таблица.Владелец = РеквизитыГоловнаяОрганизация.Ссылка
	|ГДЕ
	|	Таблица.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Таблица.УказыватьРеквизитыГоловнойОрганизацииВСчетеФактуре
	|			ТОГДА РеквизитыГоловнаяОрганизация.Ссылка
	|		ИНАЧЕ Таблица.Ссылка
	|	КОНЕЦ,
	|	ЛОЖЬ,
	|	ВЫБОР
	|		КОГДА КлассификаторСтранМира.КодАльфа2 <> ""KZ""
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Таблица.СтранаРегистрации <> ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)
	|			ТОГДА КлассификаторСтранМира.КодАльфа2
	|		ИНАЧЕ ""KZ""
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Таблица.УказыватьРеквизитыГоловнойОрганизацииВСчетеФактуре
	|			ТОГДА Таблица.ИдентификационныйНомер
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Таблица.УказыватьРеквизитыГоловнойОрганизацииВСчетеФактуре
	|			ТОГДА ВЫБОР
	|					КОГДА (ВЫРАЗИТЬ(РеквизитыГоловнаяОрганизация.НаименованиеПолное КАК СТРОКА(200))) <> """"""""
	|						ТОГДА ВЫРАЗИТЬ(РеквизитыГоловнаяОрганизация.НаименованиеПолное КАК СТРОКА(200))
	|					ИНАЧЕ РеквизитыГоловнаяОрганизация.Наименование
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА (ВЫРАЗИТЬ(Таблица.НаименованиеПолное КАК СТРОКА(200))) <> """"""""
	|					ТОГДА ВЫРАЗИТЬ(Таблица.НаименованиеПолное КАК СТРОКА(200))
	|				ИНАЧЕ Таблица.Наименование
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Таблица.УказыватьРеквизитыГоловнойОрганизацииВСчетеФактуре
	|			ТОГДА ЕСТЬNULL(РеквизитыГоловнаяОрганизация.ИдентификационныйНомер, """")
	|		КОГДА Таблица.ИностраннаяОрганизация
	|				И КлассификаторСтранМира.КодАльфа2 <> ""KZ""
	|				И КлассификаторСтранМира.УчастникТаможенногоСоюза <> ЗНАЧЕНИЕ(Справочник.СтраныУчастникиТаможенногоСоюза.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(Таблица.КодВСтранеРегистрации, """")
	|		КОГДА Таблица.ИностраннаяОрганизация
	|				И КлассификаторСтранМира.КодАльфа2 <> ""KZ""
	|				И КлассификаторСтранМира.УчастникТаможенногоСоюза = ЗНАЧЕНИЕ(Справочник.СтраныУчастникиТаможенногоСоюза.ПустаяСсылка)
	|			ТОГДА """"
	|		ИНАЧЕ ЕСТЬNULL(Таблица.ИдентификационныйНомер, """")
	|	КОНЕЦ
	|ИЗ
	|	Справочник.Организации КАК Таблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК КлассификаторСтранМира
	|		ПО Таблица.СтранаРегистрации = КлассификаторСтранМира.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК РеквизитыГоловнаяОрганизация
	|		ПО Таблица.ГоловнаяОрганизация = РеквизитыГоловнаяОрганизация.Ссылка
	|ГДЕ
	|	Таблица.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Таблица.УказыватьРеквизитыГоловнойОрганизацииВСчетеФактуре
	|			ТОГДА РеквизитыГоловнойКонтрагент.Ссылка
	|		ИНАЧЕ Таблица.Ссылка
	|	КОНЕЦ,
	|	ЛОЖЬ,
	|	ВЫБОР
	|		КОГДА КлассификаторСтранМира.КодАльфа2 <> ""KZ""
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Таблица.СтранаРезидентства <> ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)
	|			ТОГДА КлассификаторСтранМира.КодАльфа2
	|		ИНАЧЕ ""KZ""
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Таблица.УказыватьРеквизитыГоловнойОрганизацииВСчетеФактуре
	|			ТОГДА Таблица.ИдентификационныйКодЛичности
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Таблица.УказыватьРеквизитыГоловнойОрганизацииВСчетеФактуре
	|			ТОГДА ВЫБОР
	|					КОГДА (ВЫРАЗИТЬ(РеквизитыГоловнойКонтрагент.НаименованиеПолное КАК СТРОКА(200))) <> """"""""
	|						ТОГДА ВЫРАЗИТЬ(РеквизитыГоловнойКонтрагент.НаименованиеПолное КАК СТРОКА(200))
	|					ИНАЧЕ РеквизитыГоловнойКонтрагент.Наименование
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА (ВЫРАЗИТЬ(Таблица.НаименованиеПолное КАК СТРОКА(200))) <> """"""""
	|					ТОГДА ВЫРАЗИТЬ(Таблица.НаименованиеПолное КАК СТРОКА(200))
	|				ИНАЧЕ Таблица.Наименование
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Таблица.УказыватьРеквизитыГоловнойОрганизацииВСчетеФактуре
	|			ТОГДА ЕСТЬNULL(РеквизитыГоловнойКонтрагент.ИдентификационныйКодЛичности, """")
	|		КОГДА КлассификаторСтранМира.КодАльфа2 <> ""KZ""
	|				И КлассификаторСтранМира.УчастникТаможенногоСоюза <> ЗНАЧЕНИЕ(Справочник.СтраныУчастникиТаможенногоСоюза.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(Таблица.НомерНалоговойРегистрацииВСтранеРезидентства, """")
	|		КОГДА КлассификаторСтранМира.КодАльфа2 <> ""KZ""
	|				И КлассификаторСтранМира.УчастникТаможенногоСоюза = ЗНАЧЕНИЕ(Справочник.СтраныУчастникиТаможенногоСоюза.ПустаяСсылка)
	|			ТОГДА """"
	|		ИНАЧЕ ЕСТЬNULL(Таблица.ИдентификационныйКодЛичности, """")
	|	КОНЕЦ
	|ИЗ
	|	Справочник.Контрагенты КАК Таблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК КлассификаторСтранМира
	|		ПО Таблица.СтранаРезидентства = КлассификаторСтранМира.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК РеквизитыГоловнойКонтрагент
	|		ПО Таблица.ГоловнойКонтрагент = РеквизитыГоловнойКонтрагент.Ссылка
	|ГДЕ
	|	Таблица.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ОбъектыДляПоискаАдресов.Объект КАК Объект,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(КонтактнаяИнформация.Представление КАК СТРОКА(400)), """") КАК Адрес
	|ПОМЕСТИТЬ Адреса
	|ИЗ
	|	ДанныеПоОбъектам КАК ОбъектыДляПоискаАдресов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ПО (КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|			И ОбъектыДляПоискаАдресов.Объект = КонтактнаяИнформация.Объект
	|			И (КонтактнаяИнформация.Вид В (ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресКонтрагента), ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресОрганизации), ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресФизЛица)))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеПоОбъектам.Объект,
	|	ДанныеПоОбъектам.Наименование,
	|	ДанныеПоОбъектам.ЯвляетсяСП,
	|	ДанныеПоОбъектам.Нерезидент,
	|	ДанныеПоОбъектам.Идентификатор,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(АдресаПоставщиков.Адрес КАК СТРОКА(400)), """") КАК АдресОтправки,
	|	ДанныеПоОбъектам.СтранаРегистрации,
	|	ДанныеПоОбъектам.БИНСтруктурногоПодразделения
	|ИЗ
	|	ДанныеПоОбъектам КАК ДанныеПоОбъектам
	|		ЛЕВОЕ СОЕДИНЕНИЕ Адреса КАК АдресаПоставщиков
	|		ПО ДанныеПоОбъектам.Объект = АдресаПоставщиков.Объект";
	
	РезультатЗапроса		= Запрос.Выполнить();
	ВыборкаДетальныеЗаписи	= РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий()Тогда 
		СтруктураДанных.Вставить(Реквизит+"Наименование", ВыборкаДетальныеЗаписи.Наименование);
		СтруктураДанных.Вставить(Реквизит+"Идентификатор", ВыборкаДетальныеЗаписи.Идентификатор);
		СтруктураДанных.Вставить(Реквизит+"ЯвляетсяСП", ВыборкаДетальныеЗаписи.ЯвляетсяСП);
		СтруктураДанных.Вставить("АдресОтправки", ВыборкаДетальныеЗаписи.АдресОтправки);
		
		СтруктураДанных.Вставить(Реквизит+"КодСтраны", ВыборкаДетальныеЗаписи.СтранаРегистрации);
		Если Реквизит = "Поставщик" Тогда
			СтруктураДанных.Вставить(Реквизит+"КодСтраныОтправки", ВыборкаДетальныеЗаписи.СтранаРегистрации);
		ИначеЕсли Реквизит = "Получатель" Тогда
			СтруктураДанных.Вставить(Реквизит+"КодСтраныДоставки", ВыборкаДетальныеЗаписи.СтранаРегистрации);
			СтруктураДанных.Вставить("Получатель", ВыборкаДетальныеЗаписи.Объект);
		КонецЕсли;
		
		Если ВыборкаДетальныеЗаписи.Нерезидент Тогда
			СтруктураДанных.Вставить(Реквизит+"Нерезидент", Истина);
		Иначе 
			СтруктураДанных.Вставить(Реквизит+"Нерезидент", Ложь);
		КонецЕсли;
		
		СтруктураДанных.Вставить(Реквизит+"БИНСтруктурногоПодразделения", ВыборкаДетальныеЗаписи.БИНСтруктурногоПодразделения);
				
	КонецЕсли;
	
	Возврат СтруктураДанных;
	
КонецФункции

Функция ПолучитьРеквизитыДоговора(Ссылка, Реквизит) Экспорт
	
	СтруктураДанных = Новый Структура;
	
	СтруктураДанных.Вставить(Реквизит+"Номер", "");
	СтруктураДанных.Вставить(Реквизит+"Дата", "");
	СтруктураДанных.Вставить(Реквизит+"УсловияОплаты", "");
	СтруктураДанных.Вставить(Реквизит+"УсловияПоставки", "");
	СтруктураДанных.Вставить("УникальныйНомерВалютногоКонтроля", "");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДоговорыКонтрагентов.Ссылка КАК Объект,
	|	ДоговорыКонтрагентов.НомерДоговора КАК Номер,
	|	ДоговорыКонтрагентов.ДатаДоговора КАК Дата,
	|	ДоговорыКонтрагентов.УсловияОплаты КАК УсловияОплаты,
	|	ДоговорыКонтрагентов.УсловияПоставки КАК УсловияПоставки,
	|	ВЫБОР
	|		КОГДА ДоговорыКонтрагентов.НомерДоговора <> """" И ДоговорыКонтрагентов.ДатаДоговора <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ДоговорыКонтрагентов.УникальныйНомерВалютногоКонтроля
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК УникальныйНомерВалютногоКонтроля
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Ссылка = &Ссылка";
	
	РезультатЗапроса		= Запрос.Выполнить();
	ВыборкаДетальныеЗаписи	= РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий()Тогда
		СтруктураДанных.Вставить(Реквизит+"Номер", ВыборкаДетальныеЗаписи.Номер);
		СтруктураДанных.Вставить(Реквизит+"Дата", ВыборкаДетальныеЗаписи.Дата);
		СтруктураДанных.Вставить(Реквизит+"УсловияОплаты", ВыборкаДетальныеЗаписи.УсловияОплаты);
		СтруктураДанных.Вставить(Реквизит+"УсловияПоставки", ВыборкаДетальныеЗаписи.УсловияПоставки);
		СтруктураДанных.Вставить("УникальныйНомерВалютногоКонтроля", ВыборкаДетальныеЗаписи.УникальныйНомерВалютногоКонтроля);
	КонецЕсли;
	
	Возврат СтруктураДанных;
	
КонецФункции

Функция ПолучитьОрганизациюПоПодразделению(СтруктурноеПодразделение) Экспорт
	
	ДанныеОрганизации = Новый Структура;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПодразделенияОрганизаций.Владелец КАК Организация
	|ПОМЕСТИТЬ вт_СП
	|ИЗ
	|	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
	|ГДЕ
	|	ПодразделенияОрганизаций.Ссылка = &СтруктурноеПодразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПодразделенияОрганизаций.Организация,
	|	Организации.ИдентификационныйНомер
	|ИЗ
	|	Справочник.Организации КАК Организации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_СП КАК ПодразделенияОрганизаций
	|		ПО (ПодразделенияОрганизаций.Организация = Организации.Ссылка)";
	
	Запрос.УстановитьПараметр("СтруктурноеПодразделение", СтруктурноеПодразделение);
	
	ТаблицаСЕ = Запрос.Выполнить().Выгрузить();
	Если ТаблицаСЕ.Количество() = 0 Тогда
		Возврат Справочники.Организации.ПустаяСсылка();
	Иначе
		ДанныеОрганизации.Вставить("Организация", ТаблицаСЕ[0].Организация);
		ДанныеОрганизации.Вставить("Идентификатор", ТаблицаСЕ[0].ИдентификационныйНомер);
		Возврат ДанныеОрганизации;//ТаблицаСЕ[0].Организация;
	КонецЕсли;

КонецФункции

Функция ПолучитьТипДокументаВозвратОтПокупателя()Экспорт
	Возврат Тип("ДокументСсылка.ВозвратТоваровОтПокупателя");//БК	//Возврат Тип("ДокументСсылка.ВозвратКлиента"); //УПК
КонецФункции

Функция ПолучитьТипДокументаВозвратПоставщику()Экспорт
	Возврат Тип("ДокументСсылка.ВозвратТоваровПоставщику");//БК
КонецФункции

Функция ПолучитьТипПодразделенияОрганизаций()Экспорт
	Возврат Тип("СправочникСсылка.ПодразделенияОрганизаций");
КонецФункции

Функция ПолучитьТипКонтрагенты()Экспорт
	Возврат Тип("СправочникСсылка.Контрагенты");
КонецФункции

Процедура ЗаполнитьСтруктурноеПодразделениеВПараметрах(Объект, Параметры) Экспорт
	
	СтруктурноеПодразделение =  Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
	Если НЕ ВССерверПереопределяемый.ПоддерживаетсяРаботаСоСтруктурнымиПодразделениями() Тогда
		Параметры.Вставить("СтруктурноеПодразделение", СтруктурноеПодразделение);
		Возврат;
	КонецЕсли;
	
	Если Объект.Направление = ПредопределенноеЗначение("Перечисление.НаправленияСНТ.Входящий") ИЛИ Объект.ВидОперации = Перечисления.ВидыОперацийСНТ.Ввоз Тогда
		Если ТипЗнч(Объект.Получатель) =  Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда
			СтруктурноеПодразделение = Объект.Получатель;
		КонецЕсли;
	ИначеЕсли Объект.Направление = ПредопределенноеЗначение("Перечисление.НаправленияСНТ.Исходящий") И НЕ Объект.ВидОперации = Перечисления.ВидыОперацийСНТ.Ввоз Тогда
		Если ТипЗнч(Объект.Поставщик) =  Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда
			СтруктурноеПодразделение = Объект.Поставщик;
		КонецЕсли;
	КонецЕсли;
	
	Параметры.Вставить("СтруктурноеПодразделение", СтруктурноеПодразделение);
	
КонецПроцедуры

Функция ПолучитьСтрануПроисхожденияТовараПоКодуАльфа(КодАльфа) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КлассификаторСтранМира.Ссылка
	|ИЗ
	|	Справочник.КлассификаторСтранМира КАК КлассификаторСтранМира
	|ГДЕ
	|	КлассификаторСтранМира.КодАльфа2 = &КодАльфа";
	
	Запрос.УстановитьПараметр("КодАльфа", КодАльфа);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СсылкаСтранаПроисхожденияТовара = Справочники.КлассификаторСтранМира.ПустаяСсылка();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		СсылкаСтранаПроисхожденияТовара = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;
	
	Возврат СсылкаСтранаПроисхожденияТовара;
	
КонецФункции

Функция ПолучитьТипыДокументовСЗаполнениемВСКонтрагента() Экспорт 
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("ДокументСсылка.РеализацияТоваровУслуг"));
	Возврат МассивТипов;

КонецФункции

//возвращает сообщение о том был ли расход по товару из подтверждённой СНТ на импорт,
//если расход был или оформлен и принят успешно сервером, то аннулировать подтверждение такой СНТ нельзя.
Функция ПолучитьРасходПоСНТнаИмпорт(СНТ, ТаблицаТоваров)Экспорт
		
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ТаблицаТоваров", ТаблицаТоваров);
	Запрос.УстановитьПараметр("Организация", СНТ.Организация);
	Запрос.УстановитьПараметр("СтруктурноеПодразделение", СНТ.СтруктурноеПодразделение);
	Запрос.УстановитьПараметр("Склад", СНТ.СкладПолучатель);
	Запрос.УстановитьПараметр("ДатаОтгрузки", СНТ.ДатаОтгрузкиТовара);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	&СтруктурноеПодразделение КАК СтруктурноеПодразделение,
	|	ТаблицаТоваров.Товар КАК Номенклатура,
	|	ТаблицаТоваров.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ТаблицаТоваров.ИсточникПроисхождения КАК ИсточникПроисхождения,
	|	&Склад КАК Склад
	|ПОМЕСТИТЬ ТоварыДокумента
	|ИЗ
	|	&ТаблицаТоваров КАК ТаблицаТоваров
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	СтруктурноеПодразделение,
	|	Номенклатура,
	|	ЕдиницаИзмерения,
	|	ИсточникПроисхождения,
	|	Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ТоварыНаВиртуальныхСкладахОбороты.КоличествоРасход, 0) КАК ТоварВРасходе,
	|	0 КАК ТоварыВРезерве,
	|	ЗНАЧЕНИЕ(Справочник.ИсточникиПроисхождения.ПустаяСсылка) КАК ИсточникПроисхожденияДоСопоставления
	|ПОМЕСТИТЬ вт_РезультатРасхода
	|ИЗ
	|	РегистрНакопления.ТоварыНаВиртуальныхСкладах.Обороты(
	|			&ДатаОтгрузки,
	|			,
	|			,
	|			(Организация, СтруктурноеПодразделение, Номенклатура, ЕдиницаИзмерения, ИсточникПроисхождения, Склад) В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					Товары.Организация,
	|					Товары.СтруктурноеПодразделение,
	|					Товары.Номенклатура,
	|					Товары.ЕдиницаИзмерения,
	|					Товары.ИсточникПроисхождения,
	|					Товары.Склад
	|				ИЗ
	|					ТоварыДокумента КАК Товары)) КАК ТоварыНаВиртуальныхСкладахОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыДокумента КАК ТоварыДокумента
	|		ПО (ТоварыДокумента.Организация = ТоварыНаВиртуальныхСкладахОбороты.Организация)
	|			И (ТоварыДокумента.СтруктурноеПодразделение = ТоварыНаВиртуальныхСкладахОбороты.СтруктурноеПодразделение)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	0,
	|	ЕСТЬNULL(ТоварыВиртуальногоСкладаВРезервеОбороты.КоличествоПриход, 0),
	|	ЗНАЧЕНИЕ(Справочник.ИсточникиПроисхождения.ПустаяСсылка)
	|ИЗ
	|	РегистрНакопления.ТоварыВиртуальногоСкладаВРезерве.Обороты(
	|			&ДатаОтгрузки,
	|			,
	|			,
	|			(Организация, СтруктурноеПодразделение, Номенклатура, ЕдиницаИзмерения, ИсточникПроисхождения, Склад) В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					Товары.Организация,
	|					Товары.СтруктурноеПодразделение,
	|					Товары.Номенклатура,
	|					Товары.ЕдиницаИзмерения,
	|					Товары.ИсточникПроисхождения,
	|					Товары.Склад
	|				ИЗ
	|					ТоварыДокумента КАК Товары)) КАК ТоварыВиртуальногоСкладаВРезервеОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыДокумента КАК ТоварыДокумента
	|		ПО (ТоварыДокумента.Организация = ТоварыВиртуальногоСкладаВРезервеОбороты.Организация)
	|			И (ТоварыДокумента.СтруктурноеПодразделение = ТоварыВиртуальногоСкладаВРезервеОбороты.СтруктурноеПодразделение)
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	0,
	|	0,
	|	ЕСТЬNULL(СопоставленныеИсточникиПроисхождения.ИсточникПроисхожденияПослеСопоставления, ЗНАЧЕНИЕ(Справочник.ИсточникиПроисхождения.ПустаяСсылка))
	|ИЗ
	|	ТоварыДокумента КАК ТоварыДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СопоставленныеИсточникиПроисхождения КАК СопоставленныеИсточникиПроисхождения
	|		ПО (СопоставленныеИсточникиПроисхождения.ИсточникПроисхожденияДоСопоставления = ТоварыДокумента.ИсточникПроисхождения)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ЕСТЬNULL(вт_РезультатРасхода.ТоварВРасходе, 0)) КАК ТоварВРасходе,
	|	СУММА(ЕСТЬNULL(вт_РезультатРасхода.ТоварыВРезерве, 0)) КАК ТоварыВРезерве,
	|	МАКСИМУМ(ЕСТЬNULL(вт_РезультатРасхода.ИсточникПроисхожденияДоСопоставления, ЗНАЧЕНИЕ(Справочник.ИсточникиПроисхождения.ПустаяСсылка))) КАК ТоварыСопоставлены
	|ИЗ
	|	вт_РезультатРасхода КАК вт_РезультатРасхода";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	
	ТекстСообщения = Неопределено;
	
	Если ВыборкаДетальныеЗаписи.ТоварыСопоставлены <> ПредопределенноеЗначение("Справочник.ИсточникиПроисхождения.ПустаяСсылка") Тогда
		ТекстСообщения = НСтр("ru = 'Аннулирование «Подтверждения» СНТ невозможно при наличии формы ""Сопоставление СНТ и ФНО 328.00""'");
	ИначеЕсли ВыборкаДетальныеЗаписи.ТоварВРасходе <> 0 Тогда	
		ТекстСообщения = НСтр("ru = 'Аннулирование «Подтверждения» СНТ невозможно, так как было осуществлено движение по товарам'");
	ИначеЕсли ВыборкаДетальныеЗаписи.ТоварыВРезерве <> 0 Тогда
		ТекстСообщения = НСтр("ru = 'Недостаточно товаров на Складе'")
	КонецЕсли;
	
	Возврат ТекстСообщения;
	
КонецФункции
 
#КонецОбласти

#Область Печать
// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "СНТ";
	КомандаПечати.Представление = НСтр("ru = 'Сопроводительная накладная на товары'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.ПроверкаПроведенияПередПечатью = НЕ ПользователиБКВызовСервераПовтИсп.РазрешитьПечатьНепроведенныхДокументов();
	КомандаПечати.Порядок = 50;
	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура ПечатьСНТ(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СНТ") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"СНТ",
			НСтр("ru = 'Сопроводительная накладная на товары'"),
			Документы.СНТ.ПечатьСНТ(МассивОбъектов, ОбъектыПечати),
			,
			"Обработка.ОбменСНТ.ПФ_MXL_СНТ");
		КонецЕсли;
	
КонецПроцедуры  
	
	// См. СНТСервер ПолучитьQRКод
//
Функция ПолучитьQRКод(QRСтрока, УровеньКоррекции, Размер) Экспорт
	
	Возврат УправлениеПечатью.ДанныеQRКода(QRСтрока, УровеньКоррекции, Размер);
	
КонецФункции

// См. СНТСервер ЕстьРеквизитОбъекта
Функция ЕстьРеквизитОбъекта(Объект, ИмяРеквизита) Экспорт
	
	Возврат ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, ИмяРеквизита);
	
КонецФункции
  #КонецОбласти 

#Область ЗаполнениеПТУ

Функция ПолучитьТекстЗапросаДляМассиваПервичныхДокументов(МассивВидовДокумента)
	
	ТекстЗапроса = "";
	
			ТекстЗапроса = ТекстЗапросаПоступлениеТоваровУслуг(ТекстЗапроса = "");
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаПоступлениеТоваровУслуг(ПервыйЗапрос = Истина)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СНТТовары.Ссылка КАК Ссылка,
	|	СНТТовары.Товар КАК Товар,
	|	СНТТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СНТТовары.Количество КАК Количество,
	|	1 КАК Коэффициент,
	|	СНТТовары.Цена КАК Цена,
	|	СНТТовары.СуммаБезНалогов КАК СуммаБезНалогов,
	|	СНТТовары.СтавкаНДС КАК СтавкаНДС,
	|	СНТТовары.СуммаНДС КАК СуммаНДС,
	|	СНТТовары.СтавкаАкциза КАК СтавкаАкциза,
	|	СНТТовары.СуммаАкциза КАК СуммаАкциза,
	|	СНТТовары.Сумма КАК Сумма,
	|	""Товары"" КАК ИмяТабличнойЧасти,
	|	ВЫБОР
	|		КОГДА СНТТовары.БезНДС
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК ЕстьНДС,
	|	ВЫБОР
	|		КОГДА СНТТовары.СуммаАкциза = 0
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК ЕстьАкциз,
	|	СНТТовары.ЕдиницаИзмеренияКод,
	|	СНТТовары.НомерСтроки КАК НомерСтроки,
	|	0 КАК НомерРазделаТЧ
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	Документ.СНТ.Товары КАК СНТТовары
	|ГДЕ
	|	СНТТовары.Ссылка В(&МассивСНТДляСозданияПервичныхДокументов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СНТТовары.Ссылка,
	|	СНТТовары.Товар,
	|	ВЫБОР
	|		КОГДА СНТТовары.ЕдиницаИзмерения <> СНТТовары.ЕдиницаИзмеренияХраненияОстатков
	|				И СНТТовары.ЕдиницаИзмеренияХраненияОстатков <> Значение(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка) 
	|			ТОГДА СНТТовары.ЕдиницаИзмеренияХраненияОстатков
	|		ИНАЧЕ СНТТовары.ЕдиницаИзмерения
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СНТТовары.КоэффициентПересчета <> 1
	|				И СНТТовары.КоэффициентПересчета <> 0
	|			ТОГДА СНТТовары.Количество * СНТТовары.КоэффициентПересчета
	|		ИНАЧЕ СНТТовары.Количество
	|	КОНЕЦ,
	|	1,
	|	ВЫБОР
	|		КОГДА СНТТовары.КоэффициентПересчета <> 1
	|				И СНТТовары.КоэффициентПересчета <> 0
	|				И СНТТовары.Количество <> 0
	|			ТОГДА ВЫРАЗИТЬ(СНТТовары.СуммаБезНалогов / (СНТТовары.Количество * СНТТовары.КоэффициентПересчета) КАК ЧИСЛО(12, 2))
	|		ИНАЧЕ СНТТовары.Цена
	|	КОНЕЦ,
	|	СНТТовары.СуммаБезНалогов,
	|	СНТТовары.СтавкаНДС,
	|	СНТТовары.СуммаНДС,
	|	СНТТовары.СтавкаАкциза,
	|	СНТТовары.СуммаАкциза,
	|	СНТТовары.Сумма,
	|	""Товары"",
	|	ВЫБОР
	|		КОГДА СНТТовары.БезНДС
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СНТТовары.СуммаАкциза = 0
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СНТТовары.КоэффициентПересчета <> 1
	|			ТОГДА СНТТовары.ЕдиницаИзмеренияХраненияОстатков.Код
	|		ИНАЧЕ СНТТовары.ЕдиницаИзмеренияКод
	|	КОНЕЦ,
	|	СНТТовары.НомерСтроки,
	|	1
	|ИЗ
	|	Документ.СНТ.ТоварыВС КАК СНТТовары
	|ГДЕ
	|	СНТТовары.Ссылка В(&МассивСНТДляСозданияПервичныхДокументов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СНТЭтиловыйСпирт.Ссылка,
	|	СНТЭтиловыйСпирт.Товар,
	|	ВЫБОР
	|		КОГДА СНТЭтиловыйСпирт.ЕдиницаИзмерения <> СНТЭтиловыйСпирт.ЕдиницаИзмеренияХраненияОстатков
	|				И СНТЭтиловыйСпирт.ЕдиницаИзмеренияХраненияОстатков <> Значение(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА СНТЭтиловыйСпирт.ЕдиницаИзмеренияХраненияОстатков
	|		ИНАЧЕ СНТЭтиловыйСпирт.ЕдиницаИзмерения
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СНТЭтиловыйСпирт.КоэффициентПересчета <> 1
	|				И СНТЭтиловыйСпирт.КоэффициентПересчета <> 0
	|			ТОГДА СНТЭтиловыйСпирт.Количество * СНТЭтиловыйСпирт.КоэффициентПересчета
	|		ИНАЧЕ СНТЭтиловыйСпирт.Количество
	|	КОНЕЦ,
	|	1,
	|	ВЫБОР
	|		КОГДА СНТЭтиловыйСпирт.КоэффициентПересчета <> 1
	|				И СНТЭтиловыйСпирт.КоэффициентПересчета <> 0
	|				И СНТЭтиловыйСпирт.Количество <> 0
	|			ТОГДА ВЫРАЗИТЬ(СНТЭтиловыйСпирт.СуммаБезНалогов / (СНТЭтиловыйСпирт.Количество * СНТЭтиловыйСпирт.КоэффициентПересчета) КАК ЧИСЛО(12, 2))
	|		ИНАЧЕ СНТЭтиловыйСпирт.Цена
	|	КОНЕЦ,
	|	СНТЭтиловыйСпирт.СуммаБезНалогов,
	|	СНТЭтиловыйСпирт.СтавкаНДС,
	|	СНТЭтиловыйСпирт.СуммаНДС,
	|	СНТЭтиловыйСпирт.СтавкаАкциза,
	|	СНТЭтиловыйСпирт.СуммаАкциза,
	|	СНТЭтиловыйСпирт.Сумма,
	|	""ЭтиловыйСпирт"",
	|	ВЫБОР
	|		КОГДА СНТЭтиловыйСпирт.БезНДС
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СНТЭтиловыйСпирт.СуммаАкциза = 0
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СНТЭтиловыйСпирт.КоэффициентПересчета <> 1
	|			ТОГДА СНТЭтиловыйСпирт.ЕдиницаИзмеренияХраненияОстатков.Код
	|		ИНАЧЕ ""112""
	|	КОНЕЦ,
	|	СНТЭтиловыйСпирт.НомерСтроки,
	|	2
	|ИЗ
	|	Документ.СНТ.ЭтиловыйСпирт КАК СНТЭтиловыйСпирт
	|ГДЕ
	|	СНТЭтиловыйСпирт.Ссылка В(&МассивСНТДляСозданияПервичныхДокументов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СНТВиноматериал.Ссылка,
	|	СНТВиноматериал.Товар,
	|	ВЫБОР
	|		КОГДА СНТВиноматериал.ЕдиницаИзмерения <> СНТВиноматериал.ЕдиницаИзмеренияХраненияОстатков
	|				И СНТВиноматериал.ЕдиницаИзмеренияХраненияОстатков <> Значение(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка) 
	|			ТОГДА СНТВиноматериал.ЕдиницаИзмеренияХраненияОстатков
	|		ИНАЧЕ СНТВиноматериал.ЕдиницаИзмерения
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СНТВиноматериал.КоэффициентПересчета <> 1
	|				И СНТВиноматериал.КоэффициентПересчета <> 0
	|			ТОГДА СНТВиноматериал.Количество * СНТВиноматериал.КоэффициентПересчета
	|		ИНАЧЕ СНТВиноматериал.Количество
	|	КОНЕЦ,
	|	1,
	|	ВЫБОР
	|		КОГДА СНТВиноматериал.КоэффициентПересчета <> 1
	|				И СНТВиноматериал.КоэффициентПересчета <> 0
	|				И СНТВиноматериал.Количество <> 0
	|			ТОГДА ВЫРАЗИТЬ(СНТВиноматериал.СуммаБезНалогов / (СНТВиноматериал.Количество * СНТВиноматериал.КоэффициентПересчета) КАК ЧИСЛО(12, 2))
	|		ИНАЧЕ СНТВиноматериал.Цена
	|	КОНЕЦ,
	|	СНТВиноматериал.СуммаБезНалогов,
	|	СНТВиноматериал.СтавкаНДС,
	|	СНТВиноматериал.СуммаНДС,
	|	СНТВиноматериал.СтавкаАкциза,
	|	СНТВиноматериал.СуммаАкциза,
	|	СНТВиноматериал.Сумма,
	|	""Виноматериал"",
	|	ВЫБОР
	|		КОГДА СНТВиноматериал.БезНДС
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СНТВиноматериал.СуммаАкциза = 0
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СНТВиноматериал.КоэффициентПересчета <> 1
	|			ТОГДА СНТВиноматериал.ЕдиницаИзмеренияХраненияОстатков.Код
	|		ИНАЧЕ ""112""
	|	КОНЕЦ,
	|	СНТВиноматериал.НомерСтроки,
	|	3
	|ИЗ
	|	Документ.СНТ.Виноматериал КАК СНТВиноматериал
	|ГДЕ
	|	СНТВиноматериал.Ссылка В(&МассивСНТДляСозданияПервичныхДокументов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СНТПивоПивныеНапитки.Ссылка,
	|	СНТПивоПивныеНапитки.Товар,
	|	ВЫБОР
	|		КОГДА СНТПивоПивныеНапитки.ЕдиницаИзмерения <> СНТПивоПивныеНапитки.ЕдиницаИзмеренияХраненияОстатков
	|				И СНТПивоПивныеНапитки.ЕдиницаИзмеренияХраненияОстатков <> Значение(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка) 
	|			ТОГДА СНТПивоПивныеНапитки.ЕдиницаИзмеренияХраненияОстатков
	|		ИНАЧЕ СНТПивоПивныеНапитки.ЕдиницаИзмерения
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СНТПивоПивныеНапитки.КоэффициентПересчета <> 1
	|				И СНТПивоПивныеНапитки.КоэффициентПересчета <> 0
	|			ТОГДА СНТПивоПивныеНапитки.КоличествоУпаковок * СНТПивоПивныеНапитки.КоэффициентПересчета
	|		ИНАЧЕ СНТПивоПивныеНапитки.КоличествоУпаковок
	|	КОНЕЦ,
	|	1,
	|	ВЫБОР
	|		КОГДА СНТПивоПивныеНапитки.КоэффициентПересчета <> 1
	|				И СНТПивоПивныеНапитки.КоэффициентПересчета <> 0
	|				И СНТПивоПивныеНапитки.КоличествоУпаковок <> 0
	|			ТОГДА ВЫРАЗИТЬ(СНТПивоПивныеНапитки.СуммаБезНалогов / (СНТПивоПивныеНапитки.Количество * СНТПивоПивныеНапитки.КоэффициентПересчета) КАК ЧИСЛО(12, 2))
	|		ИНАЧЕ СНТПивоПивныеНапитки.Цена
	|	КОНЕЦ,
	|	СНТПивоПивныеНапитки.СуммаБезНалогов,
	|	СНТПивоПивныеНапитки.СтавкаНДС,
	|	СНТПивоПивныеНапитки.СуммаНДС,
	|	СНТПивоПивныеНапитки.СтавкаАкциза,
	|	СНТПивоПивныеНапитки.СуммаАкциза,
	|	СНТПивоПивныеНапитки.Сумма,
	|	""ПивоПивныеНапитки"",
	|	ВЫБОР
	|		КОГДА СНТПивоПивныеНапитки.БезНДС
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СНТПивоПивныеНапитки.СуммаАкциза = 0
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СНТПивоПивныеНапитки.КоэффициентПересчета <> 1
	|			ТОГДА СНТПивоПивныеНапитки.ЕдиницаИзмеренияХраненияОстатков.Код
	|		ИНАЧЕ ""112""
	|	КОНЕЦ,
	|	СНТПивоПивныеНапитки.НомерСтроки,
	|	4
	|ИЗ
	|	Документ.СНТ.ПивоПивныеНапитки КАК СНТПивоПивныеНапитки
	|ГДЕ
	|	СНТПивоПивныеНапитки.Ссылка В(&МассивСНТДляСозданияПервичныхДокументов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СНТАлкогольнаяпродукцияКромеПива.Ссылка,
	|	СНТАлкогольнаяпродукцияКромеПива.Товар,
	|	ВЫБОР
	|		КОГДА СНТАлкогольнаяпродукцияКромеПива.ЕдиницаИзмерения <> СНТАлкогольнаяпродукцияКромеПива.ЕдиницаИзмеренияХраненияОстатков
	|				И СНТАлкогольнаяпродукцияКромеПива.ЕдиницаИзмеренияХраненияОстатков <> Значение(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка) 
	|			ТОГДА СНТАлкогольнаяпродукцияКромеПива.ЕдиницаИзмеренияХраненияОстатков
	|		ИНАЧЕ СНТАлкогольнаяпродукцияКромеПива.ЕдиницаИзмерения
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СНТАлкогольнаяпродукцияКромеПива.КоэффициентПересчета <> 1
	|				И СНТАлкогольнаяпродукцияКромеПива.КоэффициентПересчета <> 0
	|			ТОГДА СНТАлкогольнаяпродукцияКромеПива.КоличествоБутылок * СНТАлкогольнаяпродукцияКромеПива.КоэффициентПересчета
	|		ИНАЧЕ СНТАлкогольнаяпродукцияКромеПива.КоличествоБутылок
	|	КОНЕЦ,
	|	1,
	|	ВЫБОР
	|		КОГДА СНТАлкогольнаяпродукцияКромеПива.КоэффициентПересчета <> 1
	|				И СНТАлкогольнаяпродукцияКромеПива.КоэффициентПересчета <> 0
	|				И СНТАлкогольнаяпродукцияКромеПива.КоличествоБутылок <> 0
	|			ТОГДА ВЫРАЗИТЬ(СНТАлкогольнаяпродукцияКромеПива.СуммаБезНалогов / (СНТАлкогольнаяпродукцияКромеПива.Количество * СНТАлкогольнаяпродукцияКромеПива.КоэффициентПересчета) КАК ЧИСЛО(12, 2))
	|		ИНАЧЕ СНТАлкогольнаяпродукцияКромеПива.Цена
	|	КОНЕЦ,
	|	СНТАлкогольнаяпродукцияКромеПива.СуммаБезНалогов,
	|	СНТАлкогольнаяпродукцияКромеПива.СтавкаНДС,
	|	СНТАлкогольнаяпродукцияКромеПива.СуммаНДС,
	|	СНТАлкогольнаяпродукцияКромеПива.СтавкаАкциза,
	|	СНТАлкогольнаяпродукцияКромеПива.СуммаАкциза,
	|	СНТАлкогольнаяпродукцияКромеПива.Сумма,
	|	""АлкогольнаяпродукцияКромеПива"",
	|	ВЫБОР
	|		КОГДА СНТАлкогольнаяпродукцияКромеПива.БезНДС
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СНТАлкогольнаяпродукцияКромеПива.СуммаАкциза = 0
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СНТАлкогольнаяпродукцияКромеПива.КоэффициентПересчета <> 1
	|			ТОГДА СНТАлкогольнаяпродукцияКромеПива.ЕдиницаИзмеренияХраненияОстатков.Код
	|		ИНАЧЕ ""112""
	|	КОНЕЦ,
	|	СНТАлкогольнаяпродукцияКромеПива.НомерСтроки,
	|	5
	|ИЗ
	|	Документ.СНТ.АлкогольнаяПродукцияКромеПива КАК СНТАлкогольнаяпродукцияКромеПива
	|ГДЕ
	|	СНТАлкогольнаяпродукцияКромеПива.Ссылка В(&МассивСНТДляСозданияПервичныхДокументов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СНТДанныеПоНефтепродуктам.Ссылка,
	|	СНТДанныеПоНефтепродуктам.Товар,
	|	ВЫБОР
	|		КОГДА СНТДанныеПоНефтепродуктам.ЕдиницаИзмерения <> СНТДанныеПоНефтепродуктам.ЕдиницаИзмеренияХраненияОстатков
	|				И СНТДанныеПоНефтепродуктам.ЕдиницаИзмеренияХраненияОстатков <> Значение(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка) 
	|			ТОГДА СНТДанныеПоНефтепродуктам.ЕдиницаИзмеренияХраненияОстатков
	|		ИНАЧЕ СНТДанныеПоНефтепродуктам.ЕдиницаИзмерения
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СНТДанныеПоНефтепродуктам.КоэффициентПересчета <> 1
	|				И СНТДанныеПоНефтепродуктам.КоэффициентПересчета <> 0
	|			ТОГДА СНТДанныеПоНефтепродуктам.Количество * СНТДанныеПоНефтепродуктам.КоэффициентПересчета
	|		ИНАЧЕ СНТДанныеПоНефтепродуктам.Количество
	|	КОНЕЦ,
	|	1,
	|	ВЫБОР
	|		КОГДА СНТДанныеПоНефтепродуктам.КоэффициентПересчета <> 1
	|				И СНТДанныеПоНефтепродуктам.КоэффициентПересчета <> 0
	|				И СНТДанныеПоНефтепродуктам.Количество <> 0
	|			ТОГДА ВЫРАЗИТЬ(СНТДанныеПоНефтепродуктам.СуммаБезНалогов / (СНТДанныеПоНефтепродуктам.Количество * СНТДанныеПоНефтепродуктам.КоэффициентПересчета) КАК ЧИСЛО(12, 2))
	|		ИНАЧЕ СНТДанныеПоНефтепродуктам.Цена
	|	КОНЕЦ,
	|	СНТДанныеПоНефтепродуктам.СуммаБезНалогов,
	|	СНТДанныеПоНефтепродуктам.СтавкаНДС,
	|	СНТДанныеПоНефтепродуктам.СуммаНДС,
	|	СНТДанныеПоНефтепродуктам.СтавкаАкциза,
	|	СНТДанныеПоНефтепродуктам.СуммаАкциза,
	|	СНТДанныеПоНефтепродуктам.Сумма,
	|	""ДанныеПоНефтепродуктам"",
	|	ВЫБОР
	|		КОГДА СНТДанныеПоНефтепродуктам.БезНДС
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СНТДанныеПоНефтепродуктам.СуммаАкциза = 0
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СНТДанныеПоНефтепродуктам.КоэффициентПересчета <> 1
	|			ТОГДА СНТДанныеПоНефтепродуктам.ЕдиницаИзмеренияХраненияОстатков.Код
	|		ИНАЧЕ ""168""
	|	КОНЕЦ,
	|	СНТДанныеПоНефтепродуктам.НомерСтроки,
	|	6
	|ИЗ
	|	Документ.СНТ.ДанныеПоНефтепродуктам КАК СНТДанныеПоНефтепродуктам
	|ГДЕ
	|	СНТДанныеПоНефтепродуктам.Ссылка В(&МассивСНТДляСозданияПервичныхДокументов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СНТДанныеПоБиотопливу.Ссылка,
	|	СНТДанныеПоБиотопливу.Товар,
	|	ВЫБОР
	|		КОГДА СНТДанныеПоБиотопливу.ЕдиницаИзмерения <> СНТДанныеПоБиотопливу.ЕдиницаИзмеренияХраненияОстатков
	|				И СНТДанныеПоБиотопливу.ЕдиницаИзмеренияХраненияОстатков <> Значение(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка) 
	|			ТОГДА СНТДанныеПоБиотопливу.ЕдиницаИзмеренияХраненияОстатков
	|		ИНАЧЕ СНТДанныеПоБиотопливу.ЕдиницаИзмерения
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СНТДанныеПоБиотопливу.КоэффициентПересчета <> 1
	|				И СНТДанныеПоБиотопливу.КоэффициентПересчета <> 0
	|			ТОГДА СНТДанныеПоБиотопливу.Количество * СНТДанныеПоБиотопливу.КоэффициентПересчета
	|		ИНАЧЕ СНТДанныеПоБиотопливу.Количество
	|	КОНЕЦ,
	|	1,
	|	ВЫБОР
	|		КОГДА СНТДанныеПоБиотопливу.КоэффициентПересчета <> 1
	|				И СНТДанныеПоБиотопливу.КоэффициентПересчета <> 0
	|				И СНТДанныеПоБиотопливу.Количество <> 0
	|			ТОГДА ВЫРАЗИТЬ(СНТДанныеПоБиотопливу.СуммаБезНалогов / (СНТДанныеПоБиотопливу.Количество * СНТДанныеПоБиотопливу.КоэффициентПересчета) КАК ЧИСЛО(12, 2))
	|		ИНАЧЕ СНТДанныеПоБиотопливу.Цена
	|	КОНЕЦ,
	|	СНТДанныеПоБиотопливу.СуммаБезНалогов,
	|	СНТДанныеПоБиотопливу.СтавкаНДС,
	|	СНТДанныеПоБиотопливу.СуммаНДС,
	|	СНТДанныеПоБиотопливу.СтавкаАкциза,
	|	СНТДанныеПоБиотопливу.СуммаАкциза,
	|	СНТДанныеПоБиотопливу.Сумма,
	|	""ДанныеПоБиотопливу"",
	|	ВЫБОР
	|		КОГДА СНТДанныеПоБиотопливу.БезНДС
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СНТДанныеПоБиотопливу.СуммаАкциза = 0
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СНТДанныеПоБиотопливу.КоэффициентПересчета <> 1
	|			ТОГДА СНТДанныеПоБиотопливу.ЕдиницаИзмеренияХраненияОстатков.Код
	|		ИНАЧЕ ""168""
	|	КОНЕЦ,
	|	СНТДанныеПоБиотопливу.НомерСтроки,
	|	7
	|ИЗ
	|	Документ.СНТ.ДанныеПоБиотопливу КАК СНТДанныеПоБиотопливу
	|ГДЕ
	|	СНТДанныеПоБиотопливу.Ссылка В(&МассивСНТДляСозданияПервичныхДокументов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СНТТабачнаяПродукция.Ссылка,
	|	СНТТабачнаяПродукция.Товар,
	|	ВЫБОР
	|		КОГДА СНТТабачнаяПродукция.ЕдиницаИзмерения <> СНТТабачнаяПродукция.ЕдиницаИзмеренияХраненияОстатков
	|				И СНТТабачнаяПродукция.ЕдиницаИзмеренияХраненияОстатков <> Значение(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка) 
	|			ТОГДА СНТТабачнаяПродукция.ЕдиницаИзмеренияХраненияОстатков
	|		ИНАЧЕ СНТТабачнаяПродукция.ЕдиницаИзмерения
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СНТТабачнаяПродукция.КоэффициентПересчета <> 1
	|				И СНТТабачнаяПродукция.КоэффициентПересчета <> 0
	|			ТОГДА СНТТабачнаяПродукция.КоличествоПачек * СНТТабачнаяПродукция.КоэффициентПересчета
	|		ИНАЧЕ СНТТабачнаяПродукция.КоличествоПачек
	|	КОНЕЦ,
	|	1,
	|	ВЫБОР
	|		КОГДА СНТТабачнаяПродукция.КоэффициентПересчета <> 1
	|				И СНТТабачнаяПродукция.КоэффициентПересчета <> 0
	|				И СНТТабачнаяПродукция.КоличествоПачек <> 0
	|			ТОГДА ВЫРАЗИТЬ(СНТТабачнаяПродукция.СуммаБезНалогов / (СНТТабачнаяПродукция.Количество * СНТТабачнаяПродукция.КоэффициентПересчета) КАК ЧИСЛО(12, 2))
	|		ИНАЧЕ СНТТабачнаяПродукция.Цена
	|	КОНЕЦ,
	|	СНТТабачнаяПродукция.СуммаБезНалогов,
	|	СНТТабачнаяПродукция.СтавкаНДС,
	|	СНТТабачнаяПродукция.СуммаНДС,
	|	СНТТабачнаяПродукция.СтавкаАкциза,
	|	СНТТабачнаяПродукция.СуммаАкциза,
	|	СНТТабачнаяПродукция.Сумма,
	|	""ТабачнаяПродукция"",
	|	ВЫБОР
	|		КОГДА СНТТабачнаяПродукция.БезНДС
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СНТТабачнаяПродукция.СуммаАкциза = 0
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СНТТабачнаяПродукция.КоэффициентПересчета <> 1
	|			ТОГДА СНТТабачнаяПродукция.ЕдиницаИзмеренияХраненияОстатков.Код
	|		ИНАЧЕ СНТТабачнаяПродукция.ЕдиницаИзмеренияКод
	|	КОНЕЦ,
	|	СНТТабачнаяПродукция.НомерСтроки,
	|	8
	|ИЗ
	|	Документ.СНТ.ТабачнаяПродукция КАК СНТТабачнаяПродукция
	|ГДЕ
	|	СНТТабачнаяПродукция.Ссылка В(&МассивСНТДляСозданияПервичныхДокументов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СНТДругиеТоварыЦифроваяМаркировка.Ссылка,
	|	СНТДругиеТоварыЦифроваяМаркировка.Товар,
	|	ВЫБОР
	|		КОГДА СНТДругиеТоварыЦифроваяМаркировка.ЕдиницаИзмерения <> СНТДругиеТоварыЦифроваяМаркировка.ЕдиницаИзмеренияХраненияОстатков
	|				И СНТДругиеТоварыЦифроваяМаркировка.ЕдиницаИзмеренияХраненияОстатков <> Значение(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка) 
	|			ТОГДА СНТДругиеТоварыЦифроваяМаркировка.ЕдиницаИзмеренияХраненияОстатков
	|		ИНАЧЕ СНТДругиеТоварыЦифроваяМаркировка.ЕдиницаИзмерения
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СНТДругиеТоварыЦифроваяМаркировка.КоэффициентПересчета <> 1
	|				И СНТДругиеТоварыЦифроваяМаркировка.КоэффициентПересчета <> 0
	|			ТОГДА СНТДругиеТоварыЦифроваяМаркировка.Количество * СНТДругиеТоварыЦифроваяМаркировка.КоэффициентПересчета
	|		ИНАЧЕ СНТДругиеТоварыЦифроваяМаркировка.Количество
	|	КОНЕЦ,
	|	1,
	|	ВЫБОР
	|		КОГДА СНТДругиеТоварыЦифроваяМаркировка.КоэффициентПересчета <> 1
	|				И СНТДругиеТоварыЦифроваяМаркировка.КоэффициентПересчета <> 0
	|				И СНТДругиеТоварыЦифроваяМаркировка.Количество <> 0
	|			ТОГДА ВЫРАЗИТЬ(СНТДругиеТоварыЦифроваяМаркировка.СуммаБезНалогов / (СНТДругиеТоварыЦифроваяМаркировка.Количество * СНТДругиеТоварыЦифроваяМаркировка.КоэффициентПересчета) КАК ЧИСЛО(12, 2))
	|		ИНАЧЕ СНТДругиеТоварыЦифроваяМаркировка.Цена
	|	КОНЕЦ,
	|	СНТДругиеТоварыЦифроваяМаркировка.СуммаБезНалогов,
	|	СНТДругиеТоварыЦифроваяМаркировка.СтавкаНДС,
	|	СНТДругиеТоварыЦифроваяМаркировка.СуммаНДС,
	|	СНТДругиеТоварыЦифроваяМаркировка.СтавкаАкциза,
	|	СНТДругиеТоварыЦифроваяМаркировка.СуммаАкциза,
	|	СНТДругиеТоварыЦифроваяМаркировка.Сумма,
	|	""ДругиеТоварыЦифроваяМаркировка"",
	|	ВЫБОР
	|		КОГДА СНТДругиеТоварыЦифроваяМаркировка.БезНДС
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СНТДругиеТоварыЦифроваяМаркировка.СуммаАкциза = 0
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СНТДругиеТоварыЦифроваяМаркировка.КоэффициентПересчета <> 1
	|			ТОГДА СНТДругиеТоварыЦифроваяМаркировка.ЕдиницаИзмеренияХраненияОстатков.Код
	|		ИНАЧЕ СНТДругиеТоварыЦифроваяМаркировка.ЕдиницаИзмеренияКод
	|	КОНЕЦ,
	|	СНТДругиеТоварыЦифроваяМаркировка.НомерСтроки,
	|	9
	|ИЗ
	|	Документ.СНТ.ДругиеТоварыЦифроваяМаркировка КАК СНТДругиеТоварыЦифроваяМаркировка
	|ГДЕ
	|	СНТДругиеТоварыЦифроваяМаркировка.Ссылка В(&МассивСНТДляСозданияПервичныхДокументов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СНТТоварыЭкспортныйКонтроль.Ссылка,
	|	СНТТоварыЭкспортныйКонтроль.Товар,
	|	ВЫБОР
	|		КОГДА СНТТоварыЭкспортныйКонтроль.ЕдиницаИзмерения <> СНТТоварыЭкспортныйКонтроль.ЕдиницаИзмеренияХраненияОстатков
	|				И СНТТоварыЭкспортныйКонтроль.ЕдиницаИзмеренияХраненияОстатков <> Значение(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка) 
	|			ТОГДА СНТТоварыЭкспортныйКонтроль.ЕдиницаИзмеренияХраненияОстатков
	|		ИНАЧЕ СНТТоварыЭкспортныйКонтроль.ЕдиницаИзмерения
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СНТТоварыЭкспортныйКонтроль.КоэффициентПересчета <> 1
	|				И СНТТоварыЭкспортныйКонтроль.КоэффициентПересчета <> 0
	|			ТОГДА СНТТоварыЭкспортныйКонтроль.Количество * СНТТоварыЭкспортныйКонтроль.КоэффициентПересчета
	|		ИНАЧЕ СНТТоварыЭкспортныйКонтроль.Количество
	|	КОНЕЦ,
	|	1,
	|	ВЫБОР
	|		КОГДА СНТТоварыЭкспортныйКонтроль.КоэффициентПересчета <> 1
	|				И СНТТоварыЭкспортныйКонтроль.КоэффициентПересчета <> 0
	|				И СНТТоварыЭкспортныйКонтроль.Количество <> 0
	|			ТОГДА ВЫРАЗИТЬ(СНТТоварыЭкспортныйКонтроль.СуммаБезНалогов / (СНТТоварыЭкспортныйКонтроль.Количество * СНТТоварыЭкспортныйКонтроль.КоэффициентПересчета) КАК ЧИСЛО(12, 2))
	|		ИНАЧЕ СНТТоварыЭкспортныйКонтроль.Цена
	|	КОНЕЦ,
	|	СНТТоварыЭкспортныйКонтроль.СуммаБезНалогов,
	|	СНТТоварыЭкспортныйКонтроль.СтавкаНДС,
	|	СНТТоварыЭкспортныйКонтроль.СуммаНДС,
	|	СНТТоварыЭкспортныйКонтроль.СтавкаАкциза,
	|	СНТТоварыЭкспортныйКонтроль.СуммаАкциза,
	|	СНТТоварыЭкспортныйКонтроль.Сумма,
	|	""ТоварыЭкспортныйКонтроль"",
	|	ВЫБОР
	|		КОГДА СНТТоварыЭкспортныйКонтроль.БезНДС
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СНТТоварыЭкспортныйКонтроль.СуммаАкциза = 0
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СНТТоварыЭкспортныйКонтроль.КоэффициентПересчета <> 1
	|			ТОГДА СНТТоварыЭкспортныйКонтроль.ЕдиницаИзмеренияХраненияОстатков.Код
	|		ИНАЧЕ СНТТоварыЭкспортныйКонтроль.ЕдиницаИзмеренияКод
	|	КОНЕЦ,
	|	СНТТоварыЭкспортныйКонтроль.НомерСтроки,
	|	10
	|ИЗ
	|	Документ.СНТ.ТоварыЭкспортныйКонтроль КАК СНТТоварыЭкспортныйКонтроль
	|ГДЕ
	|	СНТТоварыЭкспортныйКонтроль.Ссылка В(&МассивСНТДляСозданияПервичныхДокументов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыСНТ.Ссылка КАК Ссылка,
	|	ТоварыСНТ.Товар КАК Товар,
	|	ТоварыСНТ.Количество КАК Количество,
	|	ТоварыСНТ.Коэффициент КАК Коэффициент,
	|	ТоварыСНТ.Цена КАК Цена,
	|	ТоварыСНТ.СуммаБезНалогов КАК СуммаБезНалогов,
	|	ТоварыСНТ.СтавкаНДС КАК СтавкаНДС,
	|	ТоварыСНТ.СуммаНДС КАК СуммаНДС,
	|	ТоварыСНТ.СтавкаАкциза КАК СтавкаАкциза,
	|	ТоварыСНТ.СуммаАкциза КАК СуммаАкциза,
	|	ТоварыСНТ.Сумма КАК Сумма,
	|	ТоварыСНТ.ИмяТабличнойЧасти КАК ИмяТабличнойЧасти,
	|	СНТ.Ссылка КАК ДокументОснование,
	|	СНТ.Валюта КАК Валюта,
	|	ВЫБОР
	|		КОГДА СНТ.КурсВалюты = 0
	|			ТОГДА 1
	|		ИНАЧЕ СНТ.КурсВалюты
	|	КОНЕЦ КАК КурсВалюты,
	|	СНТ.Дата КАК Дата,
	|	СНТ.ДатаРегистрацииИСЭСФ КАК ДатаРегистрацииИСЭСФ,
	|	СНТ.Номер КАК Номер,
	|	СНТ.НомерСНТ КАК НомерСНТ,
	|	СНТ.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА СНТ.ТипСНТ = ЗНАЧЕНИЕ(Перечисление.ТипыСНТ.ВозвратТоваров)
	|				И СНТ.ПоставщикМалаяТорговаяТочка
	|				И ТоварыСНТ.ИмяТабличнойЧасти = ""ТоварыВС""
	|			ТОГДА СНТ.Получатель
	|		ИНАЧЕ СНТ.Контрагент
	|	КОНЕЦ КАК Контрагент,
	|	ВЫБОР
	|		КОГДА СНТ.ТипСНТ = ЗНАЧЕНИЕ(Перечисление.ТипыСНТ.ВозвратТоваров)
	|				И СНТ.ПоставщикМалаяТорговаяТочка
	|				И ТоварыСНТ.ИмяТабличнойЧасти = ""ТоварыВС""
	|			ТОГДА СНТ.СкладОтправитель
	|		ИНАЧЕ СНТ.СкладПолучатель
	|	КОНЕЦ КАК СкладПолучатель,
	|	""СНТ"" КАК ВидВходящегоДокумента,
	|	СНТ.ДатаОтгрузкиТовара КАК ДатаОтгрузкиТовара,
	|	СНТ.ДоговорПоставки КАК ДоговорПоставки,
	|	СНТ.Автор КАК Ответственный,
	|	ВЫБОР
	|		КОГДА СНТ.ВидВвоза = ЗНАЧЕНИЕ(Перечисление.ВидыВвозаСНТ.ПустаяССылка)
	|				ИЛИ СНТ.ТипСНТ = ЗНАЧЕНИЕ(Перечисление.ТипыСНТ.ВозвратТоваров)
	|					И СНТ.ПоставщикМалаяТорговаяТочка
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеТоваровУслуг.ПокупкаКомисия)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеТоваровУслуг.Импорт)
	|	КОНЕЦ КАК ВидОперации,
	|	ВЫБОР
	|		КОГДА ТоварыСНТ.ЕстьНДС > 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЕстьНДС,
	|	ТоварыСНТ.ЕстьАкциз КАК ЕстьАкциз,
	|	ТоварыСНТ.ЕдиницаИзмеренияКод КАК ЕдиницаИзмеренияКод,
	|	ВЫБОР
	|		КОГДА ТоварыСНТ.ЕдиницаИзмерения <> ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА ТоварыСНТ.ЕдиницаИзмерения
	|		ИНАЧЕ КлассификаторЕдиницИзмерения.Ссылка
	|	КОНЕЦ КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(СНТ.СвязанныйСНТ, НЕОПРЕДЕЛЕНО) КАК СвязанныйСНТ,
	|	СНТ.РегистрационныйНомерСвязанногоСНТ КАК РегистрационныйНомерСвязанногоСНТ,
	|	ЕСТЬNULL(СНТ.СвязанныйСНТ.ДокументОснование, НЕОПРЕДЕЛЕНО) КАК ДокументОснованиеСвязанногоСНТ,
	|	ТоварыСНТ.НомерСтроки КАК НомерСтроки,
	|	ТоварыСНТ.НомерРазделаТЧ КАК НомерРазделаТЧ
	|ПОМЕСТИТЬ вт_ДанныеДокументаПромежуточный
	|ИЗ
	|	ВТ_Товары КАК ТоварыСНТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СНТ КАК СНТ
	|		ПО ТоварыСНТ.Ссылка = СНТ.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
	|		ПО ТоварыСНТ.ЕдиницаИзмерения = КлассификаторЕдиницИзмерения.Ссылка
	|			И (КлассификаторЕдиницИзмерения.ПометкаУдаления <> ИСТИНА)
	|ГДЕ
	|	СНТ.Ссылка В(&МассивСНТДляСозданияПервичныхДокументов)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_ДанныеДокументаПромежуточный.Ссылка КАК Ссылка,
	|	вт_ДанныеДокументаПромежуточный.Товар КАК Товар,
	|	вт_ДанныеДокументаПромежуточный.Количество КАК Количество,
	|	вт_ДанныеДокументаПромежуточный.Коэффициент КАК Коэффициент,
	|	вт_ДанныеДокументаПромежуточный.Цена КАК Цена,
	|	вт_ДанныеДокументаПромежуточный.СуммаБезНалогов КАК СуммаБезНалогов,
	|	вт_ДанныеДокументаПромежуточный.СтавкаНДС КАК СтавкаНДС,
	|	вт_ДанныеДокументаПромежуточный.СуммаНДС КАК СуммаНДС,
	|	вт_ДанныеДокументаПромежуточный.СтавкаАкциза КАК СтавкаАкциза,
	|	вт_ДанныеДокументаПромежуточный.СуммаАкциза КАК СуммаАкциза,
	|	вт_ДанныеДокументаПромежуточный.Сумма КАК Сумма,
	|	вт_ДанныеДокументаПромежуточный.ИмяТабличнойЧасти КАК ИмяТабличнойЧасти,
	|	вт_ДанныеДокументаПромежуточный.ДокументОснование КАК ДокументОснование,
	|	вт_ДанныеДокументаПромежуточный.Валюта КАК Валюта,
	|	вт_ДанныеДокументаПромежуточный.КурсВалюты КАК КурсВалюты,
	|	вт_ДанныеДокументаПромежуточный.Дата КАК Дата,
	|	вт_ДанныеДокументаПромежуточный.ДатаРегистрацииИСЭСФ КАК ДатаРегистрацииИСЭСФ,
	|	вт_ДанныеДокументаПромежуточный.Номер КАК Номер,
	|	вт_ДанныеДокументаПромежуточный.НомерСНТ КАК НомерСНТ,
	|	вт_ДанныеДокументаПромежуточный.Организация КАК Организация,
	|	вт_ДанныеДокументаПромежуточный.Контрагент КАК Контрагент,
	|	вт_ДанныеДокументаПромежуточный.СкладПолучатель КАК СкладПолучатель,
	|	вт_ДанныеДокументаПромежуточный.ВидВходящегоДокумента КАК ВидВходящегоДокумента,
	|	вт_ДанныеДокументаПромежуточный.ДатаОтгрузкиТовара КАК ДатаОтгрузкиТовара,
	|	вт_ДанныеДокументаПромежуточный.ДоговорПоставки КАК ДоговорПоставки,
	|	вт_ДанныеДокументаПромежуточный.Ответственный КАК Ответственный,
	|	вт_ДанныеДокументаПромежуточный.ВидОперации КАК ВидОперации,
	|	вт_ДанныеДокументаПромежуточный.ЕстьНДС КАК ЕстьНДС,
	|	вт_ДанныеДокументаПромежуточный.ЕстьАкциз КАК ЕстьАкциз,
	|	вт_ДанныеДокументаПромежуточный.ЕдиницаИзмеренияКод КАК ЕдиницаИзмеренияКод,
	|	вт_ДанныеДокументаПромежуточный.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	вт_ДанныеДокументаПромежуточный.СвязанныйСНТ КАК СвязанныйСНТ,
	|	вт_ДанныеДокументаПромежуточный.РегистрационныйНомерСвязанногоСНТ КАК РегистрационныйНомерСвязанногоСНТ,
	|	вт_ДанныеДокументаПромежуточный.ДокументОснованиеСвязанногоСНТ КАК ДокументОснованиеСвязанногоСНТ,
	|	вт_ДанныеДокументаПромежуточный.НомерСтроки КАК НомерСтроки,
	|	вт_ДанныеДокументаПромежуточный.НомерРазделаТЧ КАК НомерРазделаТЧ
	|ПОМЕСТИТЬ вт_ДанныеДокумента
	|ИЗ
	|	вт_ДанныеДокументаПромежуточный КАК вт_ДанныеДокументаПромежуточный";
	
	Если Не ПервыйЗапрос Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПОМЕСТИТЬ вт_ДанныеДокумента", "");	
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РАЗРЕШЕННЫЕ", "");
	КонецЕсли;
	
	Возврат ТекстЗапроса;

КонецФункции	

Функция ПодготовитьТекстЗапросаДляЗаполненияПервичныхДокументов(ПараметрыЗаполнения) Экспорт
	
	ДокументыОснования 	 = ПараметрыЗаполнения.МассивСНТДляСозданияПервичныхДокументов;
	
	ТекстЗапроса = ТекстЗапросаПоступлениеТоваровУслуг();
		
	ТекстЗапроса = ТекстЗапроса + "
	|
	| ИНДЕКСИРОВАТЬ ПО
	|	Организация
	|";
			
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ДополнитьТекстЗапросЗаполненияПТУ(ТекстЗапроса) Экспорт
		
	ТекстЗапроса = ТекстЗапроса + "
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|//так как для ВС может быть установлено несколько элементов спр. Склады, то возьмем только один из них
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Организация КАК Организация,
	|	ДанныеДокумента.СкладПолучатель КАК СкладПолучатель,
	|	МАКСИМУМ(ЕСТЬNULL(СоответствиеСкладовДляПолучателя.Склад, ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка))) КАК Склад
	|ПОМЕСТИТЬ вт_СоответствиеСкладов
	|
	|ИЗ
	|	вт_ДанныеДокумента КАК ДанныеДокумента
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеСкладовИВиртуальныхСкладов КАК СоответствиеСкладовДляПолучателя
	|		ПО ДанныеДокумента.Организация = СоответствиеСкладовДляПолучателя.Организация
	|		И ДанныеДокумента.СкладПолучатель = СоответствиеСкладовДляПолучателя.ВиртуальныйСклад
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Организация,
	|	ДанныеДокумента.СкладПолучатель
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|	ВЫБРАТЬ
	|	вт_ДанныеДокумента.Организация КАК Организация,
	|	вт_ДанныеДокумента.Контрагент КАК Контрагент,
	|	вт_ДанныеДокумента.ДокументОснование КАК ДокументОснование,
	|	вт_ДанныеДокумента.Валюта КАК ВалютаДокумента,
	|	вт_ДанныеДокумента.КурсВалюты КАК КурсВзаиморасчетов,
	|	1 КАК КратностьВзаиморасчетов,
	|	вт_ДанныеДокумента.ЕстьНДС КАК УчитыватьНДС,
	|	ЛОЖЬ КАК СуммаВключаетНДС,
	|	вт_ДанныеДокумента.Дата КАК ДатаВходящегоДокумента,
	|	вт_ДанныеДокумента.Дата КАК Дата,
	|	вт_ДанныеДокумента.ДатаРегистрацииИСЭСФ КАК ДатаРегистрацииИСЭСФ,
	|	вт_ДанныеДокумента.ВидОперации КАК ВидОперации,
	|	вт_ДанныеДокумента.ДоговорПоставки КАК ДоговорКонтрагента,
	|	вт_ДанныеДокумента.НомерСНТ КАК НомерВходящегоДокумента,
	|	вт_ДанныеДокумента.ВидВходящегоДокумента КАК ВидВходящегоДокумента,
	|	ЕСТЬNULL(СоответствиеСкладов.Склад, ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)) КАК Склад,
	|	вт_ДанныеДокумента.ДоговорПоставки,
	|	вт_ДанныеДокумента.Ответственный,
	|	вт_ДанныеДокумента.Товар КАК Номенклатура,
	|	вт_ДанныеДокумента.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	вт_ДанныеДокумента.Количество КАК Количество,
	|	вт_ДанныеДокумента.Коэффициент КАК Коэффициент,
	|	вт_ДанныеДокумента.СуммаБезНалогов КАК Сумма,
	|	вт_ДанныеДокумента.Цена КАК Цена,
	|	вт_ДанныеДокумента.СтавкаНДС КАК СтавкаНДС,
	|	вт_ДанныеДокумента.СуммаНДС КАК СуммаНДС,
	|	вт_ДанныеДокумента.СтавкаАкциза КАК СтавкаАкциза,
	|	вт_ДанныеДокумента.СуммаАкциза КАК СуммаАкциза,
	|	вт_ДанныеДокумента.ЕстьАкциз КАК УчитыватьАкциз,
	|	ЛОЖЬ КАК СуммаВключаетАкциз,
	|	вт_ДанныеДокумента.ИмяТабличнойЧасти КАК ИмяТабличнойЧасти,
	|	вт_ДанныеДокумента.ДокументОснованиеСвязанногоСНТ КАК ДОСвязанногоСНТ,
	|	вт_ДанныеДокумента.НомерСтроки КАК НомерСтроки,
	|	вт_ДанныеДокумента.НомерРазделаТЧ КАК НомерРазделаТЧ
	|ПОМЕСТИТЬ вт_ДанныеДляЗаполнения
	|ИЗ
	|	вт_ДанныеДокумента КАК вт_ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_СоответствиеСкладов КАК СоответствиеСкладов
	|		ПО вт_ДанныеДокумента.Организация = СоответствиеСкладов.Организация
	|			И вт_ДанныеДокумента.СкладПолучатель = СоответствиеСкладов.СкладПолучатель
	|ГДЕ
	|	вт_ДанныеДокумента.Количество > 0";

	Возврат ТекстЗапроса + ПолучитьТекстПакетовЗапросаДляЗаполненияПервичныхДокументов();
КонецФункции

Функция ПолучитьТекстПакетовЗапросаДляЗаполненияПервичныхДокументов() Экспорт
	
	СтруктураДокумента = ПолучитьПустуюСтруктуруДокументаПТУ();
	
	ТекстЗапроса = "";
	Для Каждого ЭлементСтруктуры Из СтруктураДокумента Цикл 
			
		ТекстЗапроса = ТекстЗапроса + "
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|
		|ВЫБРАТЬ" + ?(ЭлементСтруктуры.Ключ = "Реквизиты",  " РАЗЛИЧНЫЕ", "") + " 
		|";
		
		
		КолонкиТЧ			= ЭлементСтруктуры.Значение.Колонки;
		НомерКолонки		= 0;
		КоличествоКолонок	= КолонкиТЧ.Количество();
		Для Каждого КолонкаТЧ Из КолонкиТЧ Цикл
			НомерКолонки = НомерКолонки + 1;
			ТекстЗапроса = ТекстЗапроса + "
					|вт_ДанныеДляЗаполнения." + КолонкаТЧ.Имя + ?(НомерКолонки = КоличествоКолонок, "", ",");
		КонецЦикла;	
		ТекстЗапроса = ТекстЗапроса + "
			|
			|ИЗ вт_ДанныеДляЗаполнения КАК вт_ДанныеДляЗаполнения";
		
		
		ТекстЗапроса = ТекстЗапроса + "
			|					
			|	УПОРЯДОЧИТЬ ПО
			|		ДокументОснование,
			|		НомерРазделаТЧ,
			|		НомерСтроки";
			
	КонецЦикла;
	
		Возврат ТекстЗапроса;
		
КонецФункции

Функция ПолучитьПустуюСтруктуруДокументаПТУ() Экспорт
	
	СтруктураДокумента = Новый Структура;
	
	// Подготовка таблицы шапки документа
	СписокОбязательныхКолонок =
	"Организация,"
	+ "Контрагент,"
	+ "ВидОперации,"
	+ "ДоговорКонтрагента,"
	+ "ВидВходящегоДокумента,"
	+ "ДатаВходящегоДокумента,"
	+ "Дата,"
	+ "ДатаРегистрацииИСЭСФ,"
	+ "ДокументОснование,"
	+ "ВалютаДокумента,"
	+ "КратностьВзаиморасчетов,"
	+ "Склад,"
	+ "НомерВходящегоДокумента,"
	+ "КурсВзаиморасчетов,"
	+ "СуммаВключаетНДС,"
	+ "УчитыватьНДС,"
	+ "Ответственный,"
	+ "ДОСвязанногоСНТ,"
	+ "НомерСтроки,"
	+ "НомерРазделаТЧ"
	;
	
	СтруктураДокумента.Вставить("Реквизиты", ВСВызовСервера.ПолучитьТаблицуПараметров(СписокОбязательныхКолонок));
	
	СписокОбязательныхКолонок = 
	"Организация,"
	+ "УчитыватьНДС,"
	+ "СуммаВключаетНДС,"
	+ "Номенклатура,"
	+ "ДокументОснование,"

	+ "ЕдиницаИзмерения,"
	+ "Количество,"
	+ "Коэффициент,"
	+ "Сумма,"
	+ "Цена,"
	+ "СтавкаНДС,"
	+ "СуммаНДС,"
	+ "СтавкаАкциза,"
	+ "СуммаАкциза,"
	+ "УчитыватьАкциз,"
	+ "НомерСтроки,"
	+ "НомерРазделаТЧ"
	;
	
	СтруктураДокумента.Вставить("Товары", ВСВызовСервера.ПолучитьТаблицуПараметров(СписокОбязательныхКолонок));
	//СтруктураДокумента.Вставить("ТоварыВС", ВСВызовСервера.ПолучитьТаблицуПараметров(СписокОбязательныхКолонок));
	//СтруктураДокумента.Вставить("ИсходныеТовары", ВСВызовСервера.ПолучитьТаблицуПараметров(СписокОбязательныхКолонок));
	//СтруктураДокумента.Вставить("ИсходныеТоварыВС", ВСВызовСервера.ПолучитьТаблицуПараметров(СписокОбязательныхКолонок));
	Возврат СтруктураДокумента;
	
КонецФункции	

Процедура ЗаполнитьМассивПервичныхДокументов(ПараметрыСоздания, МассивДанныхДляЗаполнения, СписокПервичныхДокументов, Отказ, ВидДвижения = "") Экспорт
	
	ПроводитьСозданныеДокументы	= ПараметрыСоздания.ПроводитьСозданныеДокументы;
	ФормироватьСписокДокументов = ПараметрыСоздания.ФормироватьСписокДокументов;

	Для каждого ЭлементМассива Из МассивДанныхДляЗаполнения Цикл
		ДокументСНТ = ЭлементМассива.Реквизиты[0].ДокументОснование;
		
		Если ДокументСНТ.ТипСНТ = Перечисления.ТипыСНТ.ВозвратТоваров И ДокументСНТ.Направление = Перечисления.НаправленияСНТ.Входящий 
				И НЕ (ДокументСНТ.ПоставщикМалаяТорговаяТочка И ДокументСНТ.ТоварыВС.Количество() = 0
						И ДокументСНТ.ЭтиловыйСпирт.Количество() <> 0 И ДокументСНТ.Виноматериал.Количество() <> 0 И ДокументСНТ.ПивоПивныеНапитки.Количество() <> 0
						И ДокументСНТ.АлкогольнаяПродукцияКромеПива.Количество() <> 0 И ДокументСНТ.ДанныеПоНефтепродуктам.Количество() <> 0 И ДокументСНТ.ДанныеПоБиотопливу.Количество() <> 0
						И ДокументСНТ.ТабачнаяПродукция.Количество() <> 0 И ДокументСНТ.ДругиеТоварыЦифроваяМаркировка.Количество() <> 0 И ДокументСНТ.ТоварыЭкспортныйКонтроль.Количество() <> 0)Тогда
			ПервичныйДокумент = Документы.ВозвратТоваровОтПокупателя.СоздатьДокумент();
			ИмяДокумента = "ВозвратТоваровОтПокупателя";
		ИначеЕсли ДокументСНТ.ТипСНТ = Перечисления.ТипыСНТ.ВозвратТоваров И ДокументСНТ.Направление = Перечисления.НаправленияСНТ.Входящий 
				И ДокументСНТ.ПоставщикМалаяТорговаяТочка И ДокументСНТ.ТоварыВС.Количество() > 0 Тогда
			ПервичныйДокумент = Документы.ВозвратТоваровПоставщику.СоздатьДокумент();
			ИмяДокумента = "ВозвратТоваровПоставщику";
		Иначе
			ПервичныйДокумент = Документы.ПоступлениеТоваровУслуг.СоздатьДокумент();
			ИмяДокумента = "ПоступлениеТоваровУслуг";
		КонецЕсли;
		
		//Заполняем шапку документа
		ЗаполнитьЗначенияСвойств(ПервичныйДокумент, ЭлементМассива.Реквизиты[0]);
		
		Если ИмяДокумента = "ВозвратТоваровОтПокупателя" И ЭлементМассива.Реквизиты[0].ДатаРегистрацииИСЭСФ <> Дата(1,1,1) Тогда 
			ПервичныйДокумент.Дата = ЭлементМассива.Реквизиты[0].ДатаРегистрацииИСЭСФ; 
			ПервичныйДокумент.ВидОперации = Перечисления.ВидыОперацийВозвратТоваровОтПокупателя.ВозвратТоваров;
		КонецЕсли;
		
		ПервичныйДокумент.ДокументОснование = ЭлементМассива.Реквизиты[0].ДОСвязанногоСНТ;
		
		// Получаем данные по организации, является ли плательщиком налога на прибыль.
		ПроцедурыНалоговогоУчета.ПриИзмененииПризнакаОтраженияВНалоговомУчете(ПервичныйДокумент.Организация, ПервичныйДокумент.Дата, ПервичныйДокумент.УчитыватьКПН, Истина);
		// Заполняем реквизит "ВидУчетаНУ".
		ПроцедурыНалоговогоУчета.ЗаполнитьВидУчетаНУ(ПервичныйДокумент.УчитыватьКПН, ПервичныйДокумент.ВидУчетаНУ);
		
		Документы[ИмяДокумента].ЗаполнитьСчетаУчетаРасчетов(ПервичныйДокумент);
		
		ДанныеОбъекта = Новый Структура("Дата, Организация, ВидОперации, УчитыватьКПН, УчитыватьНДС");
		ЗаполнитьЗначенияСвойств(ДанныеОбъекта, ПервичныйДокумент);
		//Заполняем табличную часть "Товары"
		
		ПлательщикНДС = ПроцедурыНалоговогоУчета.ПолучитьПризнакПлательщикаНДС(ПервичныйДокумент.Организация, ПервичныйДокумент.Дата);
		ПервичныйДокумент.УчитыватьНДС = ПлательщикНДС;

		Если НЕ ПлательщикНДС И ЭлементМассива.Реквизиты[0].УчитыватьНДС И НЕ ЭлементМассива.Реквизиты[0].СуммаВключаетНДС Тогда
			ПервичныйДокумент.СуммаВключаетНДС = Истина;
			УчестьСуммуНДС = Истина;
		Иначе
			УчестьСуммуНДС = Ложь;
		КонецЕсли;
		
		СуммаВключаетАкциз = Ложь;
		УчитыватьАкциз     = ЭлементМассива.Товары.Итог("УчитыватьАкциз") <> 0;  // В СНТ есть строки с суммой акциза
		ПлательщикАкциза   = ПроцедурыНалоговогоУчета.ПолучитьПризнакПлательщикаАкциза(ПервичныйДокумент.Организация, ПервичныйДокумент.Дата);
		ДокументСАкцизом   = ОбщегоНазначенияБК.ЕстьРеквизитДокумента("УчитыватьАкциз", ПервичныйДокумент.Метаданные());
		
		Если ДокументСАкцизом И УчитыватьАкциз Тогда
			ПервичныйДокумент.УчитыватьАкциз = УчитыватьАкциз;
			ПервичныйДокумент.СуммаВключаетАкциз = СуммаВключаетАкциз;
			УчестьСуммуАкциза = Ложь;  // СуммаАкциза НЕ учитывается в Цене и Сумме в строке документа
			
		Иначе
			// Если документ без акциза или в СНТ нет строк с суммой акциза,
			// тогда СуммаАкциза учитывается в Цене и Сумме в строке документа
			УчестьСуммуАкциза = Истина;
		КонецЕсли;
		
		Для Каждого СтрокаТЧ Из ЭлементМассива.Товары Цикл
			
			НоваяСтрокаТЧ = ПервичныйДокумент.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаТЧ,СтрокаТЧ);
			
			Документы[ИмяДокумента].ЗаполнитьРеквизитыНалоговогоУчета(ПервичныйДокумент, НоваяСтрокаТЧ, "Товары");
			СчетаУчета = ПроцедурыБухгалтерскогоУчета.ПолучитьСчетаУчетаНоменклатуры(ПервичныйДокумент.Организация, НоваяСтрокаТЧ.Номенклатура, ПервичныйДокумент.Дата);
			Документы[ИмяДокумента].ЗаполнитьСчетаУчетаВСтрокеТабличнойЧасти(ДанныеОбъекта, НоваяСтрокаТЧ, "Товары", СчетаУчета);
			
			Если УчестьСуммуНДС Тогда
				НоваяСтрокаТЧ.Сумма = НоваяСтрокаТЧ.Сумма + НоваяСтрокаТЧ.СуммаНДС;
				НоваяСтрокаТЧ.СуммаНДС = 0;
				НоваяСтрокаТЧ.Цена = Окр(?(НоваяСтрокаТЧ.Количество = 0, НоваяСтрокаТЧ.Сумма, НоваяСтрокаТЧ.Сумма / НоваяСтрокаТЧ.Количество),2);
			КонецЕсли;
			
			Если УчестьСуммуАкциза И СтрокаТЧ.СуммаАкциза <> 0 Тогда
				НоваяСтрокаТЧ.Сумма = НоваяСтрокаТЧ.Сумма + СтрокаТЧ.СуммаАкциза;
				НоваяСтрокаТЧ.Цена = Окр(?(НоваяСтрокаТЧ.Количество = 0, НоваяСтрокаТЧ.Сумма, НоваяСтрокаТЧ.Сумма / НоваяСтрокаТЧ.Количество),2);
				Если ДокументСАкцизом Тогда
					НоваяСтрокаТЧ.СуммаАкциза = 0;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
		Попытка 
			ПервичныйДокумент.Записать(РежимЗаписиДокумента.Запись);
		Исключение
			ТекстСообщения = НСтр("ru = 'При записи документа ""%1"" произошла ошибка: %2'");
			ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			
			ТекстСообщения = ЭСФКлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(ТекстСообщения, ПервичныйДокумент, ПодробноеПредставлениеОшибки);
			ЭСФКлиентСерверПереопределяемый.СообщитьПользователю(ТекстСообщения);
			Продолжить;
		КонецПопытки;
		
		Если ПроводитьСозданныеДокументы Тогда  
			
			Попытка 
				ПервичныйДокумент.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				Отказ = Истина;
			КонецПопытки;
			
			Если Отказ Тогда
				ТекстСообщения = НСтр("ru = 'При проведении документа ""%1"" произошла ошибка. Выполнение ввода документов СНТ прервано'");
				ТекстСообщения = ЭСФКлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(ТекстСообщения, ПервичныйДокумент);
				ЭСФКлиентСерверПереопределяемый.СообщитьПользователю(ТекстСообщения);
				Прервать;
			КонецЕсли;
		КонецЕсли;
		
		Попытка
			Если ЗначениеЗаполнено(ДокументСНТ) Тогда
				
				СНТОбъект = ДокументСНТ.ПолучитьОбъект();
				
				СНТОбъект.ДокументОснование = ПервичныйДокумент.Ссылка;
				СНТОбъект.Записать();
				
			КонецЕсли;
		Исключение
			
			ТекстСообщения = ЭСФКлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(
			НСтр("ru='Ошибка при записи %1: %2.'"),
			ЭлементМассива.Реквизиты[0].ДокументОснование,
			ИнформацияОбОшибке().Описание);
			
			ЭСФКлиентСерверПереопределяемый.СообщитьПользователю(ТекстСообщения);
			Прервать;
		КонецПопытки;
		
		Если ФормироватьСписокДокументов Тогда
			СписокПервичныхДокументов.Добавить(ПервичныйДокумент.Ссылка);
		КонецЕсли;		
		
	КонецЦикла;
	
КонецПроцедуры	

Функция ИспользуетсяРазделениеДанных() Экспорт
	
	ИспользуетсяРазделениеДанных = Ложь;
	
	ИспользуетсяРазделениеДанных = ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных()
  		И ОбщегоНазначения.РазделениеВключено();	
		
	Возврат ИспользуетсяРазделениеДанных;
	
КонецФункции

//Функция возвращает текст запроса для получени цены для подстановки в СНТ с определенными видами операций
Функция ПолучитьТекстЗапросаЦена(ПараметрыЗаполнения)
	
	Если ПараметрыЗаполнения.Свойство("СпособЗаполненияЦены") Тогда
		СпособЗаполненияЦены 	= ПараметрыЗаполнения.СпособЗаполненияЦены;
	Иначе
		СпособЗаполненияЦены 	= Перечисления.СпособЗаполненияЦеныЭДВС.ПоСебестоимости;
	КонецЕсли;
	
	Если ПараметрыЗаполнения.Свойство("СебестоимостьПоСкладам") Тогда
		СебестоимостьПоСкладам 	= ПараметрыЗаполнения.СебестоимостьПоСкладам;
	Иначе
		СебестоимостьПоСкладам 	= Ложь;
	КонецЕсли;
	
	Если ПараметрыЗаполнения.Свойство("ВестиСкладскойУчетБУ") Тогда
		ВестиСкладскойУчетБУ 	= ПараметрыЗаполнения.ВестиСкладскойУчетБУ;
	Иначе
		ВестиСкладскойУчетБУ 	= Ложь;
	КонецЕсли;
	
	Если ПараметрыЗаполнения.Свойство("ПоДвижениямДокумента") Тогда
		ПоДвижениямДокумента 	= ПараметрыЗаполнения.ПоДвижениямДокумента;
	Иначе
		ПоДвижениямДокумента 	= Ложь;
	КонецЕсли;
	
	Если СпособЗаполненияЦены = Перечисления.СпособЗаполненияЦеныЭДВС.ФиксированнымЗначением ИЛИ Не ПараметрыЗаполнения.ЗаполнятьЦены Тогда
		ТекстЗапросаЦена = 
		"
		|;
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	вт_ДанныеДокумента.Товар КАК Номенклатура,
		|	&ЗначениеЦены КАК ЦенаНоменклатуры
		|ПОМЕСТИТЬ вт_ЦеныНоменклатуры
		|ИЗ
		|	вт_ДанныеДокумента КАК вт_ДанныеДокумента
		|ГДЕ
		|	вт_ДанныеДокумента.ВидОперации В(&ВидыОперацийЦены)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура";
	ИначеЕсли  СпособЗаполненияЦены = Перечисления.СпособЗаполненияЦеныЭДВС.ПоТипуЦены Тогда
		ТекстЗапросаЦена =
		"
		|;
		|ВЫБРАТЬ
		|	ЦеныНоменклатуры.Организация КАК Организация,
		|	ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
		|	ЦеныНоменклатуры.Цена КАК ЦенаНоменклатуры
		|ПОМЕСТИТЬ вт_ЦеныНоменклатуры
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|			&ДатаСреза,
		|			(Организация, Номенклатура) В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						вт_ДанныеДокумента.Организация,
		|						вт_ДанныеДокумента.Товар
		|					ИЗ
		|						вт_ДанныеДокумента КАК вт_ДанныеДокумента)
		|				И ТипЦен = &ТипЦены) КАК ЦеныНоменклатуры
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Организация,
		|	Номенклатура"
	ИначеЕсли  СпособЗаполненияЦены = Перечисления.СпособЗаполненияЦеныЭДВС.ПоСебестоимости Тогда
		Если ПоДвижениямДокумента Тогда
			Если СебестоимостьПоСкладам Тогда
				ТекстЗапросаЦена =
				"
				|;
				|//////////////////////////////////
				|
				|ВЫБРАТЬ
				|	ТиповойОбороты.Организация,
				|	ТиповойОбороты.СтруктурноеПодразделение,
				|	ТиповойОбороты.Субконто1 КАК Номенклатура,
				|	ЕСТЬNULL(СоответствиеСкладовИВиртуальныхСкладов.ВиртуальныйСклад, ЗНАЧЕНИЕ(Справочник.ВиртуальныеСклады.ПустаяСсылка)) КАК Склад,
				|	СУММА(ТиповойОбороты.КоличествоОборот) КАК Количество,
				|	СУММА(ТиповойОбороты.СуммаОборот) КАК Сумма,
				|	ТиповойОбороты.Регистратор
				|ПОМЕСТИТЬ вт_ЦеныНоменклатурыГруппировка
				|ИЗ
				|	РегистрБухгалтерии.Типовой.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, Счет В ИЕРАРХИИ (&МассивСчетовБУ), &ВидыСубконто, , , ) КАК ТиповойОбороты
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеСкладовИВиртуальныхСкладов КАК СоответствиеСкладовИВиртуальныхСкладов
				|		ПО ТиповойОбороты.Субконто2 = СоответствиеСкладовИВиртуальныхСкладов.Склад
				//|			И ТиповойОбороты.Организация = СоответствиеСкладовИВиртуальныхСкладов.Организация
				|			И (ВЫБОР КОГДА ТиповойОбороты.СтруктурноеПодразделение = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
				|			ТОГДА ТиповойОбороты.Организация = СоответствиеСкладовИВиртуальныхСкладов.Организация
				|			ИНАЧЕ ТиповойОбороты.СтруктурноеПодразделение = СоответствиеСкладовИВиртуальныхСкладов.Организация КОНЕЦ) 				
				|ГДЕ
				|	ТиповойОбороты.Регистратор В
				|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
				|				вт_ДанныеДокументаЦена.ДокументОснование
				|			ИЗ
				|				вт_ДанныеДокумента КАК вт_ДанныеДокументаЦена)
				|
				|СГРУППИРОВАТЬ ПО
				|	ЕСТЬNULL(СоответствиеСкладовИВиртуальныхСкладов.ВиртуальныйСклад, ЗНАЧЕНИЕ(Справочник.ВиртуальныеСклады.ПустаяСсылка)),
				|	ТиповойОбороты.Субконто1,
				|	ТиповойОбороты.Организация,
				|	ТиповойОбороты.СтруктурноеПодразделение,
				|	ТиповойОбороты.Регистратор";	
			Иначе
				ТекстЗапросаЦена =
				"
				|;
				|//////////////////////////////////
				|
				|ВЫБРАТЬ
				|	ТиповойОбороты.Организация,
				|	ТиповойОбороты.СтруктурноеПодразделение,
				|	ТиповойОбороты.Субконто1 КАК Номенклатура,
				|	СУММА(ТиповойОбороты.КоличествоОборот) КАК Количество,
				|	СУММА(ТиповойОбороты.СуммаОборот) КАК Сумма,
				|	ТиповойОбороты.Регистратор
				|ПОМЕСТИТЬ вт_ЦеныНоменклатурыГруппировка
				|ИЗ
				|	РегистрБухгалтерии.Типовой.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, Счет В ИЕРАРХИИ (&МассивСчетовБУ), &ВидыСубконтоНоменклатура, , , ) КАК ТиповойОбороты
				|ГДЕ
				|	ТиповойОбороты.Регистратор В (ВЫБРАТЬ РАЗЛИЧНЫЕ
				|						вт_ДанныеДокументаЦена.ДокументОснование
				|					ИЗ
				|						вт_ДанныеДокумента КАК вт_ДанныеДокументаЦена)
				|
				|СГРУППИРОВАТЬ ПО
				|	ТиповойОбороты.Субконто1,
				|	ТиповойОбороты.Организация,
				|	ТиповойОбороты.СтруктурноеПодразделение,
				|	ТиповойОбороты.Регистратор";
			КонецЕсли;	
		ИначеЕсли СебестоимостьПоСкладам Тогда
			ТекстЗапросаЦена = 
			"
			|;
			|
			|ВЫБРАТЬ
			|	ТиповойОстатки.Организация КАК Организация,
			|	ТиповойОстатки.СтруктурноеПодразделение КАК СтруктурноеПодразделение,
			|	ЕСТЬNULL(СоответствиеСкладовИВиртуальныхСкладов.ВиртуальныйСклад, ЗНАЧЕНИЕ(Справочник.ВиртуальныеСклады.ПустаяСсылка)) КАК Склад, 
			|	ТиповойОстатки.Субконто1 КАК Номенклатура,
			|	СУММА(ТиповойОстатки.СуммаОстаток) КАК Сумма,
			|	СУММА(ТиповойОстатки.КоличествоОстаток) КАК Количество
			|ПОМЕСТИТЬ вт_ЦеныНоменклатурыГруппировка
			|ИЗ
			|	РегистрБухгалтерии.Типовой.Остатки(
			|			&ДатаОстатка,
			|			Счет В ИЕРАРХИИ (&МассивСчетовБУ),
			|			&ВидыСубконто,
			|			(Организация,СтруктурноеПодразделение Субконто2, Субконто1) В
			|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|						вт_ДанныеДокументаОстатки.Организация,
			|						вт_ДанныеДокументаОстатки.СтруктурноеПодразделение,
			|						вт_ДанныеДокументаОстатки.СкладОтправитель,
			|						вт_ДанныеДокументаОстатки.Товар
			|					ИЗ
			|						вт_ДанныеДокумента КАК вт_ДанныеДокументаОстатки)) КАК ТиповойОстатки
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеСкладовИВиртуальныхСкладов КАК СоответствиеСкладовИВиртуальныхСкладов
			|		ПО ТиповойОстатки.Субконто2 = СоответствиеСкладовИВиртуальныхСкладов.Склад
			|			И (ВЫБОР КОГДА ТиповойОстатки.СтруктурноеПодразделение = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
			|			ТОГДА ТиповойОстатки.Организация = СоответствиеСкладовИВиртуальныхСкладов.Организация
			|			ИНАЧЕ ТиповойОстатки.СтруктурноеПодразделение = СоответствиеСкладовИВиртуальныхСкладов.Организация КОНЕЦ)
			|ГДЕ
			|	ТиповойОстатки.КоличествоОстаток <> 0
			|
			|СГРУППИРОВАТЬ ПО
			|	ТиповойОстатки.Организация,
			|	ТиповойОстатки.СтруктурноеПодразделение КАК СтруктурноеПодразделение,
			|	ЕСТЬNULL(СоответствиеСкладовИВиртуальныхСкладов.ВиртуальныйСклад, ЗНАЧЕНИЕ(Справочник.ВиртуальныеСклады.ПустаяСсылка)),
			|	ТиповойОстатки.Субконто1
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ТиповойОстатки.Организация,
			|	ТиповойОстатки.СтруктурноеПодразделение КАК СтруктурноеПодразделение,
			|	ЕСТЬNULL(СоответствиеСкладовИВиртуальныхСкладов.ВиртуальныйСклад, ЗНАЧЕНИЕ(Справочник.ВиртуальныеСклады.ПустаяСсылка)),
			|	ТиповойОстатки.Субконто1,
			|	Сумма(ТиповойОстатки.СуммаОстаток),
			|	Сумма(ТиповойОстатки.КоличествоОстаток)
			|ИЗ
			|	РегистрБухгалтерии.Типовой.Остатки(
			|			&ДатаОстатка,
			|			Счет В ИЕРАРХИИ (&МассивСчетовПрочие),
			|			&ВидыСубконтоНоменклатура,
			|			(Организация, СтруктурноеПодразделение, Субконто1) В
			|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|						вт_ДанныеДокумента.Организация,
			|						вт_ДанныеДокумента.СтруктурноеПодразделение,
			|						вт_ДанныеДокумента.Товар
			|					ИЗ
			|						вт_ДанныеДокумента КАК вт_ДанныеДокумента)) КАК ТиповойОстатки
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеСкладовИВиртуальныхСкладов КАК СоответствиеСкладовИВиртуальныхСкладов
			|		ПО &СкладПоУмолчанию = СоответствиеСкладовИВиртуальныхСкладов.Склад
			|			И (ВЫБОР КОГДА ТиповойОстатки.СтруктурноеПодразделение = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
			|			ТОГДА ТиповойОстатки.Организация = СоответствиеСкладовИВиртуальныхСкладов.Организация
			|			ИНАЧЕ ТиповойОстатки.СтруктурноеПодразделение = СоответствиеСкладовИВиртуальныхСкладов.Организация КОНЕЦ)

			|ГДЕ
			|	ТиповойОстатки.КоличествоОстаток <> 0
			|
			|СГРУППИРОВАТЬ ПО
			|	ТиповойОстатки.Организация,
			|	ТиповойОстатки.СтруктурноеПодразделение КАК СтруктурноеПодразделение,
			|	ЕСТЬNULL(СоответствиеСкладовИВиртуальныхСкладов.ВиртуальныйСклад, ЗНАЧЕНИЕ(Справочник.ВиртуальныеСклады.ПустаяСсылка)),
			|	ТиповойОстатки.Субконто1";
		Иначе
			ТекстЗапросаЦена =
			"
			|;
			|
			|ВЫБРАТЬ
			|	ТиповойОстатки.Организация КАК Организация,
			|	ТиповойОстатки.СтруктурноеПодразделение КАК СтруктурноеПодразделение,
			|	ТиповойОстатки.Субконто1 КАК Номенклатура,
			|	СУММА(ТиповойОстатки.СуммаОстаток) КАК Сумма,
			|	СУММА(ТиповойОстатки.КоличествоОстаток) КАК Количество
			|ПОМЕСТИТЬ вт_ЦеныНоменклатурыГруппировка
			|ИЗ
			|	РегистрБухгалтерии.Типовой.Остатки(
			|			&ДатаОстатка,
			|			Счет В ИЕРАРХИИ (&МассивСчетовБУ),
			|			&ВидыСубконто,
			|			(Организация,СтруктурноеПодразделение, Субконто1) В
			|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|						вт_ДанныеДокументаОстатки.Организация,
			|						вт_ДанныеДокументаОстатки.СтруктурноеПодразделение,		
			|						вт_ДанныеДокументаОстатки.Товар
			|					ИЗ
			|						вт_ДанныеДокумента КАК вт_ДанныеДокументаОстатки)) КАК ТиповойОстатки
			|ГДЕ
			|	ТиповойОстатки.КоличествоОстаток <> 0
			|
			|СГРУППИРОВАТЬ ПО
			|	ТиповойОстатки.Организация,
			|	ТиповойОстатки.СтруктурноеПодразделение,
			|	ТиповойОстатки.Субконто1";
			
			Если ВестиСкладскойУчетБУ Тогда
				ТекстЗапросаЦена = ТекстЗапросаЦена +"
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	ТиповойОстатки.Организация,
				|	ТиповойОстатки.СтруктурноеПодразделение,
				|	ТиповойОстатки.Субконто1,
				|	СУММА(ТиповойОстатки.СуммаОстаток) КАК Сумма,
				|	СУММА(ТиповойОстатки.КоличествоОстаток) КАК Количество
				|ИЗ
				|	РегистрБухгалтерии.Типовой.Остатки(
				|			&ДатаОстатка,
				|			Счет В ИЕРАРХИИ (&МассивСчетовПрочие),
				|			&ВидыСубконтоНоменклатура,
				|			(Организация,СтруктурноеПодразделение, Субконто1) В
				|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
				|					вт_ДанныеДокумента.Организация,
				|					вт_ДанныеДокумента.СтруктурноеПодразделение, 
				|					вт_ДанныеДокумента.Товар
				|				ИЗ
				|					вт_ДанныеДокумента КАК вт_ДанныеДокумента)) КАК ТиповойОстатки
				|ГДЕ
				|	ТиповойОстатки.КоличествоОстаток <> 0
				|
				|СГРУППИРОВАТЬ ПО
				|	ТиповойОстатки.Организация,
				|	ТиповойОстатки.СтруктурноеПодразделение,
				|	ТиповойОстатки.Субконто1";
			КонецЕсли;	
		КонецЕсли;
		
		ТекстЗапросаЦена = ТекстЗапросаЦена + "
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЦеныНоменклатуры.Организация,
		|	ЦеныНоменклатуры.Склад,
		|	ЦеныНоменклатуры.Номенклатура,
		|	ЦеныНоменклатуры.Регистратор,
		|	МАКСИМУМ(ВЫБОР
		|		КОГДА ЕСТЬNULL(ЦеныНоменклатуры.Количество, 0) = 0
		|			ТОГДА 0
		|		ИНАЧЕ ВЫРАЗИТЬ(ЦеныНоменклатуры.Сумма / ЦеныНоменклатуры.Количество КАК ЧИСЛО(14, 2))
		|	КОНЕЦ) КАК ЦенаНоменклатуры
		|ПОМЕСТИТЬ вт_ЦеныНоменклатуры
		|ИЗ
		|	вт_ЦеныНоменклатурыГруппировка КАК ЦеныНоменклатуры
		|СГРУППИРОВАТЬ ПО
		| ЦеныНоменклатуры.Организация,
		| ЦеныНоменклатуры.Регистратор,
		| ЦеныНоменклатуры.Склад,	
		| ЦеныНоменклатуры.Номенклатура
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Организация,
		|	ПолеРегистратор,
		|	Склад,
		|	Номенклатура";
		
		Если Не СебестоимостьПоСкладам ИЛИ Не ВестиСкладскойУчетБУ Тогда
			ТекстЗапросаЦена = СтрЗаменить(ТекстЗапросаЦена, "ЦеныНоменклатуры.Склад,", "");
			ТекстЗапросаЦена = СтрЗаменить(ТекстЗапросаЦена, "Склад,", "");
			ТекстЗапросаЦена = СтрЗаменить(ТекстЗапросаЦена, "&ВидыСубконто,", "&ВидыСубконтоНоменклатура,");
		КонецЕсли;	
		Если ПоДвижениямДокумента Тогда
			ТекстЗапросаЦена = СтрЗаменить(ТекстЗапросаЦена, "ПолеРегистратор,", "Регистратор,");
		Иначе	
			ТекстЗапросаЦена = СтрЗаменить(ТекстЗапросаЦена, "ЦеныНоменклатуры.Регистратор,", "");
			ТекстЗапросаЦена = СтрЗаменить(ТекстЗапросаЦена, "ПолеРегистратор,", "");
		КонецЕсли;	
	КонецЕсли;	
	
	Возврат ТекстЗапросаЦена;

КонецФункции

Функция ПроверитьТипИмпортДокументаПТУПОСсылке(ДокументОснование) Экспорт
	
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
		Возврат ДокументОснование.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеТоваровУслуг.Импорт");
	Иначе 
		Возврат Ложь;
	КонецЕсли;

КонецФункции

#КонецОбласти

# Область ПараметрыДляЗаполнениеСНТ 
Функция ВидыОперацийСНТКоторыхУстанавливаютсяЦены() Экспорт 
	
	ВидыОперацийЦены = Новый Массив;
	ВидыОперацийЦены.Добавить(Перечисления.ВидыОперацийСНТ.Перемещение);
	ВидыОперацийЦены.Добавить(Перечисления.ВидыОперацийСНТ.ПеремещениеМеждуФилиалами);
	
	Возврат ВидыОперацийЦены;
	
КонецФункции

Функция ТабличныеЧастиДокументаСНТ() Экспорт
	
	ТабличныеЧастиВыбора = Новый СписокЗначений;	
	ТабличныеЧастиВыбора.Добавить("Товары", НСтр("ru='Товары'"));
	ТабличныеЧастиВыбора.Добавить("ТоварыВС", НСтр("ru='Товары виртуального склада'"));
	ТабличныеЧастиВыбора.Добавить("ЭтиловыйСпирт", НСтр("ru='Этиловый спирт'"));
	ТабличныеЧастиВыбора.Добавить("Виноматериал", НСтр("ru='Виноматериал'"));
	ТабличныеЧастиВыбора.Добавить("ПивоПивныеНапитки", НСтр("ru='Пиво и пивные напитки'"));
	ТабличныеЧастиВыбора.Добавить("АлкогольнаяПродукцияКромеПива", НСтр("ru='Алкогольная продукция (кроме пива и пивных напитков)'"));
	ТабличныеЧастиВыбора.Добавить("ДанныеПоНефтепродуктам", НСтр("ru='Нефтепродукты'"));
	ТабличныеЧастиВыбора.Добавить("ДанныеПоБиотопливу", НСтр("ru='Биотопливо"));
	ТабличныеЧастиВыбора.Добавить("ТабачнаяПродукция", НСтр("ru='Данные по табачной продукции (исключая цифровую маркировку)'"));
	ТабличныеЧастиВыбора.Добавить("ДругиеТоварыЦифроваяМаркировка", НСтр("ru='Данные по товарам, подлежащим маркировке средствами идентификации (цифровая маркировка)'"));
	ТабличныеЧастиВыбора.Добавить("ТоварыЭкспортныйКонтроль", НСтр("ru='Данные по товарам, подлежащим экспортному контролю (двойного назначения, военного назначения)'"));
	
	Возврат ТабличныеЧастиВыбора;	
	
КонецФункции

#КонецОбласти

#Область ОбработкаПроведения

Функция ТекстЗапросаТаблицаТоварыНаВС_СНТ(НомераТаблиц, Реквизиты, ПараметрыПроведения) Экспорт
	
	НомераТаблиц.Вставить("ТаблицаТоварыНаВС", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	СНТТовары.Товар КАК Номенклатура,
	|	СНТТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СНТТовары.Количество,
	|	СНТТовары.Цена,
	|	СНТТовары.ИсточникПроисхождения КАК ИсточникПроисхождения,
	|	ИсточникиПроисхождения.ДокументПартии КАК ДокументПартии,
	|	СНТТовары.НомерСтроки КАК НомерСтроки,
	|	Реквизиты.Склад КАК Склад,
	|	&ВидДвижения КАК ВидДвижения,
	|	""ТоварыВС"" КАК ИмяСписка
	|ИЗ
	|	Документ.СНТ.ТоварыВС КАК СНТТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Реквизиты КАК Реквизиты
	|		ПО СНТТовары.Ссылка = Реквизиты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИсточникиПроисхождения КАК ИсточникиПроисхождения
	|		ПО СНТТовары.ИсточникПроисхождения = ИсточникиПроисхождения.Ссылка
	|ГДЕ
	|	СНТТовары.ПризнакПроисхождения <> &ЗначениеУслуги
	|	И СНТТовары.ИсточникПроисхождения <> &ПустойИсточникПроисхождения
	|	И СНТТовары.Количество <> 0
	|	И СНТТовары.ИдентификаторТовара <> ""1""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СНТЭтиловыйСпирт.Товар,
	|	СНТЭтиловыйСпирт.ЕдиницаИзмерения,
	|	СНТЭтиловыйСпирт.Количество,
	|	СНТЭтиловыйСпирт.Цена,
	|	СНТЭтиловыйСпирт.ИсточникПроисхождения,
	|	ИсточникиПроисхождения.ДокументПартии,
	|	СНТЭтиловыйСпирт.НомерСтроки,
	|	Реквизиты.Склад,
	|	&ВидДвижения,
	|	""ЭтиловыйСпирт""
	|ИЗ
	|	Документ.СНТ.ЭтиловыйСпирт КАК СНТЭтиловыйСпирт
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Реквизиты КАК Реквизиты
	|		ПО СНТЭтиловыйСпирт.Ссылка = Реквизиты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИсточникиПроисхождения КАК ИсточникиПроисхождения
	|		ПО СНТЭтиловыйСпирт.ИсточникПроисхождения = ИсточникиПроисхождения.Ссылка
	|ГДЕ
	|	СНТЭтиловыйСпирт.ПризнакПроисхождения <> &ЗначениеУслуги
	|	И СНТЭтиловыйСпирт.ИсточникПроисхождения <> &ПустойИсточникПроисхождения
	|	И СНТЭтиловыйСпирт.Количество <> 0
	|	И СНТЭтиловыйСпирт.ИдентификаторТовара <> ""1""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СНТВиноматериал.Товар,
	|	СНТВиноматериал.ЕдиницаИзмерения,
	|	СНТВиноматериал.Количество,
	|	СНТВиноматериал.Цена,
	|	СНТВиноматериал.ИсточникПроисхождения,
	|	ИсточникиПроисхождения.ДокументПартии,
	|	СНТВиноматериал.НомерСтроки,
	|	Реквизиты.Склад,
	|	&ВидДвижения,
	|	""Виноматериал""
	|ИЗ
	|	Документ.СНТ.Виноматериал КАК СНТВиноматериал
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Реквизиты КАК Реквизиты
	|		ПО СНТВиноматериал.Ссылка = Реквизиты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИсточникиПроисхождения КАК ИсточникиПроисхождения
	|		ПО СНТВиноматериал.ИсточникПроисхождения = ИсточникиПроисхождения.Ссылка
	|ГДЕ
	|	СНТВиноматериал.ПризнакПроисхождения <> &ЗначениеУслуги
	|	И СНТВиноматериал.ИсточникПроисхождения <> &ПустойИсточникПроисхождения
	|	И СНТВиноматериал.Количество <> 0
	|	И СНТВиноматериал.ИдентификаторТовара <> ""1""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СНТПивоПивныеНапитки.Товар,
	|	СНТПивоПивныеНапитки.ЕдиницаИзмерения,
	|	СНТПивоПивныеНапитки.КоличествоУпаковок,
	|	СНТПивоПивныеНапитки.Цена,
	|	СНТПивоПивныеНапитки.ИсточникПроисхождения,
	|	ИсточникиПроисхождения.ДокументПартии,
	|	СНТПивоПивныеНапитки.НомерСтроки,
	|	Реквизиты.Склад,
	|	&ВидДвижения,
	|	""ПивоПивныеНапитки""
	|ИЗ
	|	Документ.СНТ.ПивоПивныеНапитки КАК СНТПивоПивныеНапитки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Реквизиты КАК Реквизиты
	|		ПО СНТПивоПивныеНапитки.Ссылка = Реквизиты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИсточникиПроисхождения КАК ИсточникиПроисхождения
	|		ПО СНТПивоПивныеНапитки.ИсточникПроисхождения = ИсточникиПроисхождения.Ссылка
	|ГДЕ
	|	СНТПивоПивныеНапитки.ПризнакПроисхождения <> &ЗначениеУслуги
	|	И СНТПивоПивныеНапитки.ИсточникПроисхождения <> &ПустойИсточникПроисхождения
	|	И СНТПивоПивныеНапитки.Количество <> 0
	|	И СНТПивоПивныеНапитки.ИдентификаторТовара <> ""1""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СНТАлкогольнаяпродукцияКромеПива.Товар,
	|	СНТАлкогольнаяпродукцияКромеПива.ЕдиницаИзмерения,
	|	СНТАлкогольнаяпродукцияКромеПива.КоличествоБутылок,
	|	СНТАлкогольнаяпродукцияКромеПива.Цена,
	|	СНТАлкогольнаяпродукцияКромеПива.ИсточникПроисхождения,
	|	ИсточникиПроисхождения.ДокументПартии,
	|	СНТАлкогольнаяпродукцияКромеПива.НомерСтроки,
	|	Реквизиты.Склад,
	|	&ВидДвижения,
	|	""АлкогольнаяПродукцияКромеПива""
	|ИЗ
	|	Документ.СНТ.АлкогольнаяПродукцияКромеПива КАК СНТАлкогольнаяпродукцияКромеПива
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Реквизиты КАК Реквизиты
	|		ПО СНТАлкогольнаяпродукцияКромеПива.Ссылка = Реквизиты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИсточникиПроисхождения КАК ИсточникиПроисхождения
	|		ПО СНТАлкогольнаяпродукцияКромеПива.ИсточникПроисхождения = ИсточникиПроисхождения.Ссылка
	|ГДЕ
	|	СНТАлкогольнаяпродукцияКромеПива.ПризнакПроисхождения <> &ЗначениеУслуги
	|	И СНТАлкогольнаяпродукцияКромеПива.ИсточникПроисхождения <> &ПустойИсточникПроисхождения
	|	И СНТАлкогольнаяпродукцияКромеПива.Количество <> 0
	|	И СНТАлкогольнаяпродукцияКромеПива.ИдентификаторТовара <> ""1""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СНТДанныеПоНефтепродуктам.Товар,
	|	СНТДанныеПоНефтепродуктам.ЕдиницаИзмерения,
	|	СНТДанныеПоНефтепродуктам.Количество,
	|	СНТДанныеПоНефтепродуктам.Цена,
	|	СНТДанныеПоНефтепродуктам.ИсточникПроисхождения,
	|	ИсточникиПроисхождения.ДокументПартии,
	|	СНТДанныеПоНефтепродуктам.НомерСтроки,
	|	Реквизиты.Склад,
	|	&ВидДвижения,
	|	""ДанныеПоНефтепродуктам""
	|ИЗ
	|	Документ.СНТ.ДанныеПоНефтепродуктам КАК СНТДанныеПоНефтепродуктам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Реквизиты КАК Реквизиты
	|		ПО СНТДанныеПоНефтепродуктам.Ссылка = Реквизиты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИсточникиПроисхождения КАК ИсточникиПроисхождения
	|		ПО СНТДанныеПоНефтепродуктам.ИсточникПроисхождения = ИсточникиПроисхождения.Ссылка
	|ГДЕ
	|	СНТДанныеПоНефтепродуктам.ПризнакПроисхождения <> &ЗначениеУслуги
	|	И СНТДанныеПоНефтепродуктам.ИсточникПроисхождения <> &ПустойИсточникПроисхождения
	|	И СНТДанныеПоНефтепродуктам.Количество <> 0
	|	И СНТДанныеПоНефтепродуктам.ИдентификаторТовара <> ""1""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СНТДанныеПоБиотопливу.Товар,
	|	СНТДанныеПоБиотопливу.ЕдиницаИзмерения,
	|	СНТДанныеПоБиотопливу.Количество,
	|	СНТДанныеПоБиотопливу.Цена,
	|	СНТДанныеПоБиотопливу.ИсточникПроисхождения,
	|	ИсточникиПроисхождения.ДокументПартии,
	|	СНТДанныеПоБиотопливу.НомерСтроки,
	|	Реквизиты.Склад,
	|	&ВидДвижения,
	|	""ДанныеПоБиотопливу""
	|ИЗ
	|	Документ.СНТ.ДанныеПоБиотопливу КАК СНТДанныеПоБиотопливу
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Реквизиты КАК Реквизиты
	|		ПО СНТДанныеПоБиотопливу.Ссылка = Реквизиты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИсточникиПроисхождения КАК ИсточникиПроисхождения
	|		ПО СНТДанныеПоБиотопливу.ИсточникПроисхождения = ИсточникиПроисхождения.Ссылка
	|ГДЕ
	|	СНТДанныеПоБиотопливу.ПризнакПроисхождения <> &ЗначениеУслуги
	|	И СНТДанныеПоБиотопливу.ИсточникПроисхождения <> &ПустойИсточникПроисхождения
	|	И СНТДанныеПоБиотопливу.Количество <> 0
	|	И СНТДанныеПоБиотопливу.ИдентификаторТовара <> ""1""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СНТТабачнаяПродукция.Товар,
	|	СНТТабачнаяПродукция.ЕдиницаИзмерения,
	|	СНТТабачнаяПродукция.КоличествоПачек,
	|	СНТТабачнаяПродукция.Цена,
	|	СНТТабачнаяПродукция.ИсточникПроисхождения,
	|	ИсточникиПроисхождения.ДокументПартии,
	|	СНТТабачнаяПродукция.НомерСтроки,
	|	Реквизиты.Склад,
	|	&ВидДвижения,
	|	""ТабачнаяПродукция""
	|ИЗ
	|	Документ.СНТ.ТабачнаяПродукция КАК СНТТабачнаяПродукция
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Реквизиты КАК Реквизиты
	|		ПО СНТТабачнаяПродукция.Ссылка = Реквизиты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИсточникиПроисхождения КАК ИсточникиПроисхождения
	|		ПО СНТТабачнаяПродукция.ИсточникПроисхождения = ИсточникиПроисхождения.Ссылка
	|ГДЕ
	|	СНТТабачнаяПродукция.ПризнакПроисхождения <> &ЗначениеУслуги
	|	И СНТТабачнаяПродукция.ИсточникПроисхождения <> &ПустойИсточникПроисхождения
	|	И СНТТабачнаяПродукция.Количество <> 0
	|	И СНТТабачнаяПродукция.ИдентификаторТовара <> ""1""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СНТДругиеТоварыЦифроваяМаркировка.Товар,
	|	СНТДругиеТоварыЦифроваяМаркировка.ЕдиницаИзмерения,
	|	СНТДругиеТоварыЦифроваяМаркировка.Количество,
	|	СНТДругиеТоварыЦифроваяМаркировка.Цена,
	|	СНТДругиеТоварыЦифроваяМаркировка.ИсточникПроисхождения,
	|	ИсточникиПроисхождения.ДокументПартии,
	|	СНТДругиеТоварыЦифроваяМаркировка.НомерСтроки,
	|	Реквизиты.Склад,
	|	&ВидДвижения,
	|	""ДругиеТоварыЦифроваяМаркировка""
	|ИЗ
	|	Документ.СНТ.ДругиеТоварыЦифроваяМаркировка КАК СНТДругиеТоварыЦифроваяМаркировка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Реквизиты КАК Реквизиты
	|		ПО СНТДругиеТоварыЦифроваяМаркировка.Ссылка = Реквизиты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИсточникиПроисхождения КАК ИсточникиПроисхождения
	|		ПО СНТДругиеТоварыЦифроваяМаркировка.ИсточникПроисхождения = ИсточникиПроисхождения.Ссылка
	|ГДЕ
	|	СНТДругиеТоварыЦифроваяМаркировка.ПризнакПроисхождения <> &ЗначениеУслуги
	|	И СНТДругиеТоварыЦифроваяМаркировка.ИсточникПроисхождения <> &ПустойИсточникПроисхождения
	|	И СНТДругиеТоварыЦифроваяМаркировка.Количество <> 0
	|	И СНТДругиеТоварыЦифроваяМаркировка.ИдентификаторТовара <> ""1""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СНТТоварыЭкспортныйКонтроль.Товар,
	|	СНТТоварыЭкспортныйКонтроль.ЕдиницаИзмерения,
	|	СНТТоварыЭкспортныйКонтроль.Количество,
	|	СНТТоварыЭкспортныйКонтроль.Цена,
	|	СНТТоварыЭкспортныйКонтроль.ИсточникПроисхождения,
	|	ИсточникиПроисхождения.ДокументПартии,
	|	СНТТоварыЭкспортныйКонтроль.НомерСтроки,
	|	Реквизиты.Склад,
	|	&ВидДвижения,
	|	""ТоварыЭкспортныйКонтроль""
	|ИЗ
	|	Документ.СНТ.ТоварыЭкспортныйКонтроль КАК СНТТоварыЭкспортныйКонтроль
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Реквизиты КАК Реквизиты
	|		ПО СНТТоварыЭкспортныйКонтроль.Ссылка = Реквизиты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИсточникиПроисхождения КАК ИсточникиПроисхождения
	|		ПО СНТТоварыЭкспортныйКонтроль.ИсточникПроисхождения = ИсточникиПроисхождения.Ссылка
	|ГДЕ
	|	СНТТоварыЭкспортныйКонтроль.ПризнакПроисхождения <> &ЗначениеУслуги
	|	И СНТТоварыЭкспортныйКонтроль.ИсточникПроисхождения <> &ПустойИсточникПроисхождения
	|	И СНТТоварыЭкспортныйКонтроль.Количество <> 0
	|	И СНТТоварыЭкспортныйКонтроль.ИдентификаторТовара <> ""1""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СНТТовары.Товар,
	|	СНТТовары.ЕдиницаИзмерения,
	|	СНТТовары.Количество,
	|	СНТТовары.Цена,
	|	ВЫБОР
	|		КОГДА СНТТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСНТ.ПеремещениеМеждуФилиалами)
	|			ТОГДА СНТТовары.ИсточникПроисхожденияПолучатель
	|		ИНАЧЕ СНТТовары.ИсточникПроисхождения
	|	КОНЕЦ,
	|	ИсточникиПроисхождения.ДокументПартии,
	|	СНТТовары.НомерСтроки,
	|	Реквизиты.СкладПолучатель,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	""ТоварыВС""
	|ИЗ
	|	Документ.СНТ.ТоварыВС КАК СНТТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Реквизиты КАК Реквизиты
	|		ПО СНТТовары.Ссылка = Реквизиты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИсточникиПроисхождения КАК ИсточникиПроисхождения
	|		ПО (ВЫБОР
	|				КОГДА СНТТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСНТ.ПеремещениеМеждуФилиалами)
	|					ТОГДА СНТТовары.ИсточникПроисхожденияПолучатель = ИсточникиПроисхождения.Ссылка
	|				ИНАЧЕ СНТТовары.ИсточникПроисхождения = ИсточникиПроисхождения.Ссылка
	|			КОНЕЦ)
	|ГДЕ
	|	СНТТовары.ПризнакПроисхождения <> &ЗначениеУслуги
	|	И (Реквизиты.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСНТ.Перемещение)
	|			ИЛИ Реквизиты.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСНТ.ПеремещениеМеждуФилиалами))
	|	И НЕ Реквизиты.ВидПеремещения = ЗНАЧЕНИЕ(Перечисление.ВидыПеремещенияСНТ.ВПределахОдногоЛицаЕАЭС)
	|	И НЕ Реквизиты.ВидПеремещения = ЗНАЧЕНИЕ(Перечисление.ВидыПеремещенияСНТ.ИноеПеремещение)
	|	И СНТТовары.ИсточникПроисхождения <> &ПустойИсточникПроисхождения
	|	И СНТТовары.Количество <> 0
	|	И СНТТовары.ИдентификаторТовара <> ""1""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СНТЭтиловыйСпирт.Товар,
	|	СНТЭтиловыйСпирт.ЕдиницаИзмерения,
	|	СНТЭтиловыйСпирт.Количество,
	|	СНТЭтиловыйСпирт.Цена,
	|	ВЫБОР
	|		КОГДА СНТЭтиловыйСпирт.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСНТ.ПеремещениеМеждуФилиалами)
	|			ТОГДА СНТЭтиловыйСпирт.ИсточникПроисхожденияПолучатель
	|		ИНАЧЕ СНТЭтиловыйСпирт.ИсточникПроисхождения
	|	КОНЕЦ,
	|	ИсточникиПроисхождения.ДокументПартии,
	|	СНТЭтиловыйСпирт.НомерСтроки,
	|	Реквизиты.СкладПолучатель,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	""ЭтиловыйСпирт""
	|ИЗ
	|	Документ.СНТ.ЭтиловыйСпирт КАК СНТЭтиловыйСпирт
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Реквизиты КАК Реквизиты
	|		ПО СНТЭтиловыйСпирт.Ссылка = Реквизиты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИсточникиПроисхождения КАК ИсточникиПроисхождения
	|		ПО (ВЫБОР
	|				КОГДА СНТЭтиловыйСпирт.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСНТ.ПеремещениеМеждуФилиалами)
	|					ТОГДА СНТЭтиловыйСпирт.ИсточникПроисхожденияПолучатель = ИсточникиПроисхождения.Ссылка
	|				ИНАЧЕ СНТЭтиловыйСпирт.ИсточникПроисхождения = ИсточникиПроисхождения.Ссылка
	|			КОНЕЦ)
	|ГДЕ
	|	СНТЭтиловыйСпирт.ПризнакПроисхождения <> &ЗначениеУслуги
	|	И (Реквизиты.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСНТ.Перемещение)
	|			ИЛИ Реквизиты.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСНТ.ПеремещениеМеждуФилиалами))
	|	И НЕ Реквизиты.ВидПеремещения = ЗНАЧЕНИЕ(Перечисление.ВидыПеремещенияСНТ.ВПределахОдногоЛицаЕАЭС)
	|	И НЕ Реквизиты.ВидПеремещения = ЗНАЧЕНИЕ(Перечисление.ВидыПеремещенияСНТ.ИноеПеремещение)
	|	И СНТЭтиловыйСпирт.ИсточникПроисхождения <> &ПустойИсточникПроисхождения
	|	И СНТЭтиловыйСпирт.Количество <> 0
	|	И СНТЭтиловыйСпирт.ИдентификаторТовара <> ""1""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СНТВиноматериал.Товар,
	|	СНТВиноматериал.ЕдиницаИзмерения,
	|	СНТВиноматериал.Количество,
	|	СНТВиноматериал.Цена,
	|	ВЫБОР
	|		КОГДА СНТВиноматериал.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСНТ.ПеремещениеМеждуФилиалами)
	|			ТОГДА СНТВиноматериал.ИсточникПроисхожденияПолучатель
	|		ИНАЧЕ СНТВиноматериал.ИсточникПроисхождения
	|	КОНЕЦ,
	|	ИсточникиПроисхождения.ДокументПартии,
	|	СНТВиноматериал.НомерСтроки,
	|	Реквизиты.СкладПолучатель,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	""Виноматериал""
	|ИЗ
	|	Документ.СНТ.Виноматериал КАК СНТВиноматериал
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Реквизиты КАК Реквизиты
	|		ПО СНТВиноматериал.Ссылка = Реквизиты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИсточникиПроисхождения КАК ИсточникиПроисхождения
	|		ПО (ВЫБОР
	|				КОГДА СНТВиноматериал.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСНТ.ПеремещениеМеждуФилиалами)
	|					ТОГДА СНТВиноматериал.ИсточникПроисхожденияПолучатель = ИсточникиПроисхождения.Ссылка
	|				ИНАЧЕ СНТВиноматериал.ИсточникПроисхождения = ИсточникиПроисхождения.Ссылка
	|			КОНЕЦ)
	|ГДЕ
	|	СНТВиноматериал.ПризнакПроисхождения <> &ЗначениеУслуги
	|	И (Реквизиты.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСНТ.Перемещение)
	|			ИЛИ Реквизиты.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСНТ.ПеремещениеМеждуФилиалами))
	|	И НЕ Реквизиты.ВидПеремещения = ЗНАЧЕНИЕ(Перечисление.ВидыПеремещенияСНТ.ВПределахОдногоЛицаЕАЭС)
	|	И НЕ Реквизиты.ВидПеремещения = ЗНАЧЕНИЕ(Перечисление.ВидыПеремещенияСНТ.ИноеПеремещение)
	|	И СНТВиноматериал.ИсточникПроисхождения <> &ПустойИсточникПроисхождения
	|	И СНТВиноматериал.Количество <> 0
	|	И СНТВиноматериал.ИдентификаторТовара <> ""1""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СНТПивоПивныеНапитки.Товар,
	|	СНТПивоПивныеНапитки.ЕдиницаИзмерения,
	|	СНТПивоПивныеНапитки.КоличествоУпаковок,
	|	СНТПивоПивныеНапитки.Цена,
	|	ВЫБОР
	|		КОГДА СНТПивоПивныеНапитки.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСНТ.ПеремещениеМеждуФилиалами)
	|			ТОГДА СНТПивоПивныеНапитки.ИсточникПроисхожденияПолучатель
	|		ИНАЧЕ СНТПивоПивныеНапитки.ИсточникПроисхождения
	|	КОНЕЦ,
	|	ИсточникиПроисхождения.ДокументПартии,
	|	СНТПивоПивныеНапитки.НомерСтроки,
	|	Реквизиты.СкладПолучатель,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	""ПивоПивныеНапитки""
	|ИЗ
	|	Документ.СНТ.ПивоПивныеНапитки КАК СНТПивоПивныеНапитки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Реквизиты КАК Реквизиты
	|		ПО СНТПивоПивныеНапитки.Ссылка = Реквизиты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИсточникиПроисхождения КАК ИсточникиПроисхождения
	|		ПО (ВЫБОР
	|				КОГДА СНТПивоПивныеНапитки.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСНТ.ПеремещениеМеждуФилиалами)
	|					ТОГДА СНТПивоПивныеНапитки.ИсточникПроисхожденияПолучатель = ИсточникиПроисхождения.Ссылка
	|				ИНАЧЕ СНТПивоПивныеНапитки.ИсточникПроисхождения = ИсточникиПроисхождения.Ссылка
	|			КОНЕЦ)
	|ГДЕ
	|	СНТПивоПивныеНапитки.ПризнакПроисхождения <> &ЗначениеУслуги
	|	И (Реквизиты.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСНТ.Перемещение)
	|			ИЛИ Реквизиты.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСНТ.ПеремещениеМеждуФилиалами))
	|	И НЕ Реквизиты.ВидПеремещения = ЗНАЧЕНИЕ(Перечисление.ВидыПеремещенияСНТ.ВПределахОдногоЛицаЕАЭС)
	|	И НЕ Реквизиты.ВидПеремещения = ЗНАЧЕНИЕ(Перечисление.ВидыПеремещенияСНТ.ИноеПеремещение)
	|	И СНТПивоПивныеНапитки.ИсточникПроисхождения <> &ПустойИсточникПроисхождения
	|	И СНТПивоПивныеНапитки.Количество <> 0
	|	И СНТПивоПивныеНапитки.ИдентификаторТовара <> ""1""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СНТАлкогольнаяпродукцияКромеПива.Товар,
	|	СНТАлкогольнаяпродукцияКромеПива.ЕдиницаИзмерения,
	|	СНТАлкогольнаяпродукцияКромеПива.КоличествоБутылок,
	|	СНТАлкогольнаяпродукцияКромеПива.Цена,
	|	ВЫБОР
	|		КОГДА СНТАлкогольнаяпродукцияКромеПива.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСНТ.ПеремещениеМеждуФилиалами)
	|			ТОГДА СНТАлкогольнаяпродукцияКромеПива.ИсточникПроисхожденияПолучатель
	|		ИНАЧЕ СНТАлкогольнаяпродукцияКромеПива.ИсточникПроисхождения
	|	КОНЕЦ,
	|	ИсточникиПроисхождения.ДокументПартии,
	|	СНТАлкогольнаяпродукцияКромеПива.НомерСтроки,
	|	Реквизиты.СкладПолучатель,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	""АлкогольнаяПродукцияКромеПива""
	|ИЗ
	|	Документ.СНТ.АлкогольнаяПродукцияКромеПива КАК СНТАлкогольнаяпродукцияКромеПива
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Реквизиты КАК Реквизиты
	|		ПО СНТАлкогольнаяпродукцияКромеПива.Ссылка = Реквизиты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИсточникиПроисхождения КАК ИсточникиПроисхождения
	|		ПО (ВЫБОР
	|				КОГДА СНТАлкогольнаяпродукцияКромеПива.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСНТ.ПеремещениеМеждуФилиалами)
	|					ТОГДА СНТАлкогольнаяпродукцияКромеПива.ИсточникПроисхожденияПолучатель = ИсточникиПроисхождения.Ссылка
	|				ИНАЧЕ СНТАлкогольнаяпродукцияКромеПива.ИсточникПроисхождения = ИсточникиПроисхождения.Ссылка
	|			КОНЕЦ)
	|ГДЕ
	|	СНТАлкогольнаяпродукцияКромеПива.ПризнакПроисхождения <> &ЗначениеУслуги
	|	И (Реквизиты.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСНТ.Перемещение)
	|			ИЛИ Реквизиты.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСНТ.ПеремещениеМеждуФилиалами))
	|	И НЕ Реквизиты.ВидПеремещения = ЗНАЧЕНИЕ(Перечисление.ВидыПеремещенияСНТ.ВПределахОдногоЛицаЕАЭС)
	|	И НЕ Реквизиты.ВидПеремещения = ЗНАЧЕНИЕ(Перечисление.ВидыПеремещенияСНТ.ИноеПеремещение)
	|	И СНТАлкогольнаяпродукцияКромеПива.ИсточникПроисхождения <> &ПустойИсточникПроисхождения
	|	И СНТАлкогольнаяпродукцияКромеПива.Количество <> 0
	|	И СНТАлкогольнаяпродукцияКромеПива.ИдентификаторТовара <> ""1""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СНТДанныеПоНефтепродуктам.Товар,
	|	СНТДанныеПоНефтепродуктам.ЕдиницаИзмерения,
	|	СНТДанныеПоНефтепродуктам.Количество,
	|	СНТДанныеПоНефтепродуктам.Цена,
	|	ВЫБОР
	|		КОГДА СНТДанныеПоНефтепродуктам.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСНТ.ПеремещениеМеждуФилиалами)
	|			ТОГДА СНТДанныеПоНефтепродуктам.ИсточникПроисхожденияПолучатель
	|		ИНАЧЕ СНТДанныеПоНефтепродуктам.ИсточникПроисхождения
	|	КОНЕЦ,
	|	ИсточникиПроисхождения.ДокументПартии,
	|	СНТДанныеПоНефтепродуктам.НомерСтроки,
	|	Реквизиты.СкладПолучатель,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	""ДанныеПоНефтепродуктам""
	|ИЗ
	|	Документ.СНТ.ДанныеПоНефтепродуктам КАК СНТДанныеПоНефтепродуктам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Реквизиты КАК Реквизиты
	|		ПО СНТДанныеПоНефтепродуктам.Ссылка = Реквизиты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИсточникиПроисхождения КАК ИсточникиПроисхождения
	|		ПО (ВЫБОР
	|				КОГДА СНТДанныеПоНефтепродуктам.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСНТ.ПеремещениеМеждуФилиалами)
	|					ТОГДА СНТДанныеПоНефтепродуктам.ИсточникПроисхожденияПолучатель = ИсточникиПроисхождения.Ссылка
	|				ИНАЧЕ СНТДанныеПоНефтепродуктам.ИсточникПроисхождения = ИсточникиПроисхождения.Ссылка
	|			КОНЕЦ)
	|ГДЕ
	|	СНТДанныеПоНефтепродуктам.ПризнакПроисхождения <> &ЗначениеУслуги
	|	И (Реквизиты.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСНТ.Перемещение)
	|			ИЛИ Реквизиты.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСНТ.ПеремещениеМеждуФилиалами))
	|	И НЕ Реквизиты.ВидПеремещения = ЗНАЧЕНИЕ(Перечисление.ВидыПеремещенияСНТ.ВПределахОдногоЛицаЕАЭС)
	|	И НЕ Реквизиты.ВидПеремещения = ЗНАЧЕНИЕ(Перечисление.ВидыПеремещенияСНТ.ИноеПеремещение)
	|	И СНТДанныеПоНефтепродуктам.ИсточникПроисхождения <> &ПустойИсточникПроисхождения
	|	И СНТДанныеПоНефтепродуктам.Количество <> 0
	|	И СНТДанныеПоНефтепродуктам.ИдентификаторТовара <> ""1""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СНТДанныеПоБиотопливу.Товар,
	|	СНТДанныеПоБиотопливу.ЕдиницаИзмерения,
	|	СНТДанныеПоБиотопливу.Количество,
	|	СНТДанныеПоБиотопливу.Цена,
	|	ВЫБОР
	|		КОГДА СНТДанныеПоБиотопливу.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСНТ.ПеремещениеМеждуФилиалами)
	|			ТОГДА СНТДанныеПоБиотопливу.ИсточникПроисхожденияПолучатель
	|		ИНАЧЕ СНТДанныеПоБиотопливу.ИсточникПроисхождения
	|	КОНЕЦ,
	|	ИсточникиПроисхождения.ДокументПартии,
	|	СНТДанныеПоБиотопливу.НомерСтроки,
	|	Реквизиты.СкладПолучатель,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	""ДанныеПоБиотопливу""
	|ИЗ
	|	Документ.СНТ.ДанныеПоБиотопливу КАК СНТДанныеПоБиотопливу
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Реквизиты КАК Реквизиты
	|		ПО СНТДанныеПоБиотопливу.Ссылка = Реквизиты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИсточникиПроисхождения КАК ИсточникиПроисхождения
	|		ПО (ВЫБОР
	|				КОГДА СНТДанныеПоБиотопливу.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСНТ.ПеремещениеМеждуФилиалами)
	|					ТОГДА СНТДанныеПоБиотопливу.ИсточникПроисхожденияПолучатель = ИсточникиПроисхождения.Ссылка
	|				ИНАЧЕ СНТДанныеПоБиотопливу.ИсточникПроисхождения = ИсточникиПроисхождения.Ссылка
	|			КОНЕЦ)
	|ГДЕ
	|	СНТДанныеПоБиотопливу.ПризнакПроисхождения <> &ЗначениеУслуги
	|	И (Реквизиты.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСНТ.Перемещение)
	|			ИЛИ Реквизиты.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСНТ.ПеремещениеМеждуФилиалами))
	|	И НЕ Реквизиты.ВидПеремещения = ЗНАЧЕНИЕ(Перечисление.ВидыПеремещенияСНТ.ВПределахОдногоЛицаЕАЭС)
	|	И НЕ Реквизиты.ВидПеремещения = ЗНАЧЕНИЕ(Перечисление.ВидыПеремещенияСНТ.ИноеПеремещение)
	|	И СНТДанныеПоБиотопливу.ИсточникПроисхождения <> &ПустойИсточникПроисхождения
	|	И СНТДанныеПоБиотопливу.Количество <> 0
	|	И СНТДанныеПоБиотопливу.ИдентификаторТовара <> ""1""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СНТТабачнаяПродукция.Товар,
	|	СНТТабачнаяПродукция.ЕдиницаИзмерения,
	|	СНТТабачнаяПродукция.КоличествоПачек,
	|	СНТТабачнаяПродукция.Цена,
	|	ВЫБОР
	|		КОГДА СНТТабачнаяПродукция.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСНТ.ПеремещениеМеждуФилиалами)
	|			ТОГДА СНТТабачнаяПродукция.ИсточникПроисхожденияПолучатель
	|		ИНАЧЕ СНТТабачнаяПродукция.ИсточникПроисхождения
	|	КОНЕЦ,
	|	ИсточникиПроисхождения.ДокументПартии,
	|	СНТТабачнаяПродукция.НомерСтроки,
	|	Реквизиты.СкладПолучатель,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	""ТабачнаяПродукция""
	|ИЗ
	|	Документ.СНТ.ТабачнаяПродукция КАК СНТТабачнаяПродукция
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Реквизиты КАК Реквизиты
	|		ПО СНТТабачнаяПродукция.Ссылка = Реквизиты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИсточникиПроисхождения КАК ИсточникиПроисхождения
	|		ПО (ВЫБОР
	|				КОГДА СНТТабачнаяПродукция.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСНТ.ПеремещениеМеждуФилиалами)
	|					ТОГДА СНТТабачнаяПродукция.ИсточникПроисхожденияПолучатель = ИсточникиПроисхождения.Ссылка
	|				ИНАЧЕ СНТТабачнаяПродукция.ИсточникПроисхождения = ИсточникиПроисхождения.Ссылка
	|			КОНЕЦ)
	|ГДЕ
	|	СНТТабачнаяПродукция.ПризнакПроисхождения <> &ЗначениеУслуги
	|	И (Реквизиты.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСНТ.Перемещение)
	|			ИЛИ Реквизиты.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСНТ.ПеремещениеМеждуФилиалами))
	|	И НЕ Реквизиты.ВидПеремещения = ЗНАЧЕНИЕ(Перечисление.ВидыПеремещенияСНТ.ВПределахОдногоЛицаЕАЭС)
	|	И НЕ Реквизиты.ВидПеремещения = ЗНАЧЕНИЕ(Перечисление.ВидыПеремещенияСНТ.ИноеПеремещение)
	|	И СНТТабачнаяПродукция.ИсточникПроисхождения <> &ПустойИсточникПроисхождения
	|	И СНТТабачнаяПродукция.Количество <> 0
	|	И СНТТабачнаяПродукция.ИдентификаторТовара <> ""1""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СНТДругиеТоварыЦифроваяМаркировка.Товар,
	|	СНТДругиеТоварыЦифроваяМаркировка.ЕдиницаИзмерения,
	|	СНТДругиеТоварыЦифроваяМаркировка.Количество,
	|	СНТДругиеТоварыЦифроваяМаркировка.Цена,
	|	ВЫБОР
	|		КОГДА СНТДругиеТоварыЦифроваяМаркировка.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСНТ.ПеремещениеМеждуФилиалами)
	|			ТОГДА СНТДругиеТоварыЦифроваяМаркировка.ИсточникПроисхожденияПолучатель
	|		ИНАЧЕ СНТДругиеТоварыЦифроваяМаркировка.ИсточникПроисхождения
	|	КОНЕЦ,
	|	ИсточникиПроисхождения.ДокументПартии,
	|	СНТДругиеТоварыЦифроваяМаркировка.НомерСтроки,
	|	Реквизиты.СкладПолучатель,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	""ДругиеТоварыЦифроваяМаркировка""
	|ИЗ
	|	Документ.СНТ.ДругиеТоварыЦифроваяМаркировка КАК СНТДругиеТоварыЦифроваяМаркировка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Реквизиты КАК Реквизиты
	|		ПО СНТДругиеТоварыЦифроваяМаркировка.Ссылка = Реквизиты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИсточникиПроисхождения КАК ИсточникиПроисхождения
	|		ПО (ВЫБОР
	|				КОГДА СНТДругиеТоварыЦифроваяМаркировка.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСНТ.ПеремещениеМеждуФилиалами)
	|					ТОГДА СНТДругиеТоварыЦифроваяМаркировка.ИсточникПроисхожденияПолучатель = ИсточникиПроисхождения.Ссылка
	|				ИНАЧЕ СНТДругиеТоварыЦифроваяМаркировка.ИсточникПроисхождения = ИсточникиПроисхождения.Ссылка
	|			КОНЕЦ)
	|ГДЕ
	|	СНТДругиеТоварыЦифроваяМаркировка.ПризнакПроисхождения <> &ЗначениеУслуги
	|	И (Реквизиты.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСНТ.Перемещение)
	|			ИЛИ Реквизиты.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСНТ.ПеремещениеМеждуФилиалами))
	|	И НЕ Реквизиты.ВидПеремещения = ЗНАЧЕНИЕ(Перечисление.ВидыПеремещенияСНТ.ВПределахОдногоЛицаЕАЭС)
	|	И НЕ Реквизиты.ВидПеремещения = ЗНАЧЕНИЕ(Перечисление.ВидыПеремещенияСНТ.ИноеПеремещение)
	|	И СНТДругиеТоварыЦифроваяМаркировка.ИсточникПроисхождения <> &ПустойИсточникПроисхождения
	|	И СНТДругиеТоварыЦифроваяМаркировка.Количество <> 0
	|	И СНТДругиеТоварыЦифроваяМаркировка.ИдентификаторТовара <> ""1""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СНТТоварыЭкспортныйКонтроль.Товар,
	|	СНТТоварыЭкспортныйКонтроль.ЕдиницаИзмерения,
	|	СНТТоварыЭкспортныйКонтроль.Количество,
	|	СНТТоварыЭкспортныйКонтроль.Цена,
	|	ВЫБОР
	|		КОГДА СНТТоварыЭкспортныйКонтроль.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСНТ.ПеремещениеМеждуФилиалами)
	|			ТОГДА СНТТоварыЭкспортныйКонтроль.ИсточникПроисхожденияПолучатель
	|		ИНАЧЕ СНТТоварыЭкспортныйКонтроль.ИсточникПроисхождения
	|	КОНЕЦ,
	|	ИсточникиПроисхождения.ДокументПартии,
	|	СНТТоварыЭкспортныйКонтроль.НомерСтроки,
	|	Реквизиты.СкладПолучатель,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	""ТоварыЭкспортныйКонтроль""
	|ИЗ
	|	Документ.СНТ.ТоварыЭкспортныйКонтроль КАК СНТТоварыЭкспортныйКонтроль
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Реквизиты КАК Реквизиты
	|		ПО СНТТоварыЭкспортныйКонтроль.Ссылка = Реквизиты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИсточникиПроисхождения КАК ИсточникиПроисхождения
	|		ПО (ВЫБОР
	|				КОГДА СНТТоварыЭкспортныйКонтроль.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСНТ.ПеремещениеМеждуФилиалами)
	|					ТОГДА СНТТоварыЭкспортныйКонтроль.ИсточникПроисхожденияПолучатель = ИсточникиПроисхождения.Ссылка
	|				ИНАЧЕ СНТТоварыЭкспортныйКонтроль.ИсточникПроисхождения = ИсточникиПроисхождения.Ссылка
	|			КОНЕЦ)
	|ГДЕ
	|	СНТТоварыЭкспортныйКонтроль.ПризнакПроисхождения <> &ЗначениеУслуги
	|	И (Реквизиты.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСНТ.Перемещение)
	|			ИЛИ Реквизиты.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСНТ.ПеремещениеМеждуФилиалами))
	|	И НЕ Реквизиты.ВидПеремещения = ЗНАЧЕНИЕ(Перечисление.ВидыПеремещенияСНТ.ВПределахОдногоЛицаЕАЭС)
	|	И НЕ Реквизиты.ВидПеремещения = ЗНАЧЕНИЕ(Перечисление.ВидыПеремещенияСНТ.ИноеПеремещение)
	|	И СНТТоварыЭкспортныйКонтроль.ИсточникПроисхождения <> &ПустойИсточникПроисхождения
	|	И СНТТоварыЭкспортныйКонтроль.Количество <> 0
	|	И СНТТоварыЭкспортныйКонтроль.ИдентификаторТовара <> ""1""
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	

	Возврат ТекстЗапроса + ВСВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции	

Функция ТекстЗапросаТаблицаТоварыНаВСВРезерве_СНТ(НомераТаблиц, Реквизиты, ПараметрыПроведения) Экспорт
	
	НомераТаблиц.Вставить("ТаблицаТоварыНаВСВРезерве", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	СНТТовары.Товар КАК Номенклатура,
	|	СНТТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СНТТовары.Количество,
	|	СНТТовары.Цена,
	|	СНТТовары.ИсточникПроисхождения КАК ИсточникПроисхождения,
	|	ИсточникиПроисхождения.ДокументПартии КАК ДокументПартии,
	|	СНТТовары.НомерСтроки КАК НомерСтроки,
	|	Реквизиты.Склад КАК Склад,
	|	&ВидДвижения КАК ВидДвижения,
	|	""ТоварыВС"" КАК ИмяСписка
	|ИЗ
	|	Документ.СНТ.ТоварыВС КАК СНТТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Реквизиты КАК Реквизиты
	|		ПО СНТТовары.Ссылка = Реквизиты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИсточникиПроисхождения КАК ИсточникиПроисхождения
	|		ПО СНТТовары.ИсточникПроисхождения = ИсточникиПроисхождения.Ссылка
	|ГДЕ
	|	СНТТовары.ПризнакПроисхождения <> &ЗначениеУслуги
	|	И СНТТовары.ИсточникПроисхождения <> &ПустойИсточникПроисхождения
	|	И СНТТовары.Количество <> 0
	|	И СНТТовары.ИдентификаторТовара <> ""1""
	|	И СНТТовары.ДополнительныйИдентификатор <> 1
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СНТЭтиловыйСпирт.Товар,
	|	СНТЭтиловыйСпирт.ЕдиницаИзмерения,
	|	СНТЭтиловыйСпирт.Количество,
	|	СНТЭтиловыйСпирт.Цена,
	|	СНТЭтиловыйСпирт.ИсточникПроисхождения,
	|	ИсточникиПроисхождения.ДокументПартии,
	|	СНТЭтиловыйСпирт.НомерСтроки,
	|	Реквизиты.Склад,
	|	&ВидДвижения,
	|	""ЭтиловыйСпирт""
	|ИЗ
	|	Документ.СНТ.ЭтиловыйСпирт КАК СНТЭтиловыйСпирт
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Реквизиты КАК Реквизиты
	|		ПО СНТЭтиловыйСпирт.Ссылка = Реквизиты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИсточникиПроисхождения КАК ИсточникиПроисхождения
	|		ПО СНТЭтиловыйСпирт.ИсточникПроисхождения = ИсточникиПроисхождения.Ссылка
	|ГДЕ
	|	СНТЭтиловыйСпирт.ПризнакПроисхождения <> &ЗначениеУслуги
	|	И СНТЭтиловыйСпирт.ИсточникПроисхождения <> &ПустойИсточникПроисхождения
	|	И СНТЭтиловыйСпирт.Количество <> 0
	|	И СНТЭтиловыйСпирт.ИдентификаторТовара <> ""1""
	|	И СНТЭтиловыйСпирт.ДополнительныйИдентификатор <> 1
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СНТВиноматериал.Товар,
	|	СНТВиноматериал.ЕдиницаИзмерения,
	|	СНТВиноматериал.Количество,
	|	СНТВиноматериал.Цена,
	|	СНТВиноматериал.ИсточникПроисхождения,
	|	ИсточникиПроисхождения.ДокументПартии,
	|	СНТВиноматериал.НомерСтроки,
	|	Реквизиты.Склад,
	|	&ВидДвижения,
	|	""Виноматериал""
	|ИЗ
	|	Документ.СНТ.Виноматериал КАК СНТВиноматериал
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Реквизиты КАК Реквизиты
	|		ПО СНТВиноматериал.Ссылка = Реквизиты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИсточникиПроисхождения КАК ИсточникиПроисхождения
	|		ПО СНТВиноматериал.ИсточникПроисхождения = ИсточникиПроисхождения.Ссылка
	|ГДЕ
	|	СНТВиноматериал.ПризнакПроисхождения <> &ЗначениеУслуги
	|	И СНТВиноматериал.ИсточникПроисхождения <> &ПустойИсточникПроисхождения
	|	И СНТВиноматериал.Количество <> 0
	|	И СНТВиноматериал.ИдентификаторТовара <> ""1""
	|	И СНТВиноматериал.ДополнительныйИдентификатор <> 1
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СНТПивоПивныеНапитки.Товар,
	|	СНТПивоПивныеНапитки.ЕдиницаИзмерения,
	|	СНТПивоПивныеНапитки.КоличествоУпаковок,
	|	СНТПивоПивныеНапитки.Цена,
	|	СНТПивоПивныеНапитки.ИсточникПроисхождения,
	|	ИсточникиПроисхождения.ДокументПартии,
	|	СНТПивоПивныеНапитки.НомерСтроки,
	|	Реквизиты.Склад,
	|	&ВидДвижения,
	|	""ПивоПивныеНапитки""
	|ИЗ
	|	Документ.СНТ.ПивоПивныеНапитки КАК СНТПивоПивныеНапитки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Реквизиты КАК Реквизиты
	|		ПО СНТПивоПивныеНапитки.Ссылка = Реквизиты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИсточникиПроисхождения КАК ИсточникиПроисхождения
	|		ПО СНТПивоПивныеНапитки.ИсточникПроисхождения = ИсточникиПроисхождения.Ссылка
	|ГДЕ
	|	СНТПивоПивныеНапитки.ПризнакПроисхождения <> &ЗначениеУслуги
	|	И СНТПивоПивныеНапитки.ИсточникПроисхождения <> &ПустойИсточникПроисхождения
	|	И СНТПивоПивныеНапитки.Количество <> 0
	|	И СНТПивоПивныеНапитки.ИдентификаторТовара <> ""1""
	|	И СНТПивоПивныеНапитки.ДополнительныйИдентификатор <> 1
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СНТАлкогольнаяпродукцияКромеПива.Товар,
	|	СНТАлкогольнаяпродукцияКромеПива.ЕдиницаИзмерения,
	|	СНТАлкогольнаяпродукцияКромеПива.КоличествоБутылок,
	|	СНТАлкогольнаяпродукцияКромеПива.Цена,
	|	СНТАлкогольнаяпродукцияКромеПива.ИсточникПроисхождения,
	|	ИсточникиПроисхождения.ДокументПартии,
	|	СНТАлкогольнаяпродукцияКромеПива.НомерСтроки,
	|	Реквизиты.Склад,
	|	&ВидДвижения,
	|	""АлкогольнаяПродукцияКромеПива""
	|ИЗ
	|	Документ.СНТ.АлкогольнаяПродукцияКромеПива КАК СНТАлкогольнаяпродукцияКромеПива
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Реквизиты КАК Реквизиты
	|		ПО СНТАлкогольнаяпродукцияКромеПива.Ссылка = Реквизиты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИсточникиПроисхождения КАК ИсточникиПроисхождения
	|		ПО СНТАлкогольнаяпродукцияКромеПива.ИсточникПроисхождения = ИсточникиПроисхождения.Ссылка
	|ГДЕ
	|	СНТАлкогольнаяпродукцияКромеПива.ПризнакПроисхождения <> &ЗначениеУслуги
	|	И СНТАлкогольнаяпродукцияКромеПива.ИсточникПроисхождения <> &ПустойИсточникПроисхождения
	|	И СНТАлкогольнаяпродукцияКромеПива.Количество <> 0
	|	И СНТАлкогольнаяпродукцияКромеПива.ИдентификаторТовара <> ""1""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СНТДанныеПоНефтепродуктам.Товар,
	|	СНТДанныеПоНефтепродуктам.ЕдиницаИзмерения,
	|	СНТДанныеПоНефтепродуктам.Количество,
	|	СНТДанныеПоНефтепродуктам.Цена,
	|	СНТДанныеПоНефтепродуктам.ИсточникПроисхождения,
	|	ИсточникиПроисхождения.ДокументПартии,
	|	СНТДанныеПоНефтепродуктам.НомерСтроки,
	|	Реквизиты.Склад,
	|	&ВидДвижения,
	|	""ДанныеПоНефтепродуктам""
	|ИЗ
	|	Документ.СНТ.ДанныеПоНефтепродуктам КАК СНТДанныеПоНефтепродуктам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Реквизиты КАК Реквизиты
	|		ПО СНТДанныеПоНефтепродуктам.Ссылка = Реквизиты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИсточникиПроисхождения КАК ИсточникиПроисхождения
	|		ПО СНТДанныеПоНефтепродуктам.ИсточникПроисхождения = ИсточникиПроисхождения.Ссылка
	|ГДЕ
	|	СНТДанныеПоНефтепродуктам.ПризнакПроисхождения <> &ЗначениеУслуги
	|	И СНТДанныеПоНефтепродуктам.ИсточникПроисхождения <> &ПустойИсточникПроисхождения
	|	И СНТДанныеПоНефтепродуктам.Количество <> 0
	|	И СНТДанныеПоНефтепродуктам.ИдентификаторТовара <> ""1""
	|	И СНТДанныеПоНефтепродуктам.ДополнительныйИдентификатор <> 1
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СНТДанныеПоБиотопливу.Товар,
	|	СНТДанныеПоБиотопливу.ЕдиницаИзмерения,
	|	СНТДанныеПоБиотопливу.Количество,
	|	СНТДанныеПоБиотопливу.Цена,
	|	СНТДанныеПоБиотопливу.ИсточникПроисхождения,
	|	ИсточникиПроисхождения.ДокументПартии,
	|	СНТДанныеПоБиотопливу.НомерСтроки,
	|	Реквизиты.Склад,
	|	&ВидДвижения,
	|	""ДанныеПоБиотопливу""
	|ИЗ
	|	Документ.СНТ.ДанныеПоБиотопливу КАК СНТДанныеПоБиотопливу
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Реквизиты КАК Реквизиты
	|		ПО СНТДанныеПоБиотопливу.Ссылка = Реквизиты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИсточникиПроисхождения КАК ИсточникиПроисхождения
	|		ПО СНТДанныеПоБиотопливу.ИсточникПроисхождения = ИсточникиПроисхождения.Ссылка
	|ГДЕ
	|	СНТДанныеПоБиотопливу.ПризнакПроисхождения <> &ЗначениеУслуги
	|	И СНТДанныеПоБиотопливу.ИсточникПроисхождения <> &ПустойИсточникПроисхождения
	|	И СНТДанныеПоБиотопливу.Количество <> 0
	|	И СНТДанныеПоБиотопливу.ИдентификаторТовара <> ""1""
	|	И СНТДанныеПоБиотопливу.ДополнительныйИдентификатор <> 1
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СНТТабачнаяПродукция.Товар,
	|	СНТТабачнаяПродукция.ЕдиницаИзмерения,
	|	СНТТабачнаяПродукция.КоличествоПачек,
	|	СНТТабачнаяПродукция.Цена,
	|	СНТТабачнаяПродукция.ИсточникПроисхождения,
	|	ИсточникиПроисхождения.ДокументПартии,
	|	СНТТабачнаяПродукция.НомерСтроки,
	|	Реквизиты.Склад,
	|	&ВидДвижения,
	|	""ТабачнаяПродукция""
	|ИЗ
	|	Документ.СНТ.ТабачнаяПродукция КАК СНТТабачнаяПродукция
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Реквизиты КАК Реквизиты
	|		ПО СНТТабачнаяПродукция.Ссылка = Реквизиты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИсточникиПроисхождения КАК ИсточникиПроисхождения
	|		ПО СНТТабачнаяПродукция.ИсточникПроисхождения = ИсточникиПроисхождения.Ссылка
	|ГДЕ
	|	СНТТабачнаяПродукция.ПризнакПроисхождения <> &ЗначениеУслуги
	|	И СНТТабачнаяПродукция.ИсточникПроисхождения <> &ПустойИсточникПроисхождения
	|	И СНТТабачнаяПродукция.Количество <> 0
	|	И СНТТабачнаяПродукция.ИдентификаторТовара <> ""1""
	|	И СНТТабачнаяПродукция.ДополнительныйИдентификатор <> 1
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СНТДругиеТоварыЦифроваяМаркировка.Товар,
	|	СНТДругиеТоварыЦифроваяМаркировка.ЕдиницаИзмерения,
	|	СНТДругиеТоварыЦифроваяМаркировка.Количество,
	|	СНТДругиеТоварыЦифроваяМаркировка.Цена,
	|	СНТДругиеТоварыЦифроваяМаркировка.ИсточникПроисхождения,
	|	ИсточникиПроисхождения.ДокументПартии,
	|	СНТДругиеТоварыЦифроваяМаркировка.НомерСтроки,
	|	Реквизиты.Склад,
	|	&ВидДвижения,
	|	""ДругиеТоварыЦифроваяМаркировка""
	|ИЗ
	|	Документ.СНТ.ДругиеТоварыЦифроваяМаркировка КАК СНТДругиеТоварыЦифроваяМаркировка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Реквизиты КАК Реквизиты
	|		ПО СНТДругиеТоварыЦифроваяМаркировка.Ссылка = Реквизиты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИсточникиПроисхождения КАК ИсточникиПроисхождения
	|		ПО СНТДругиеТоварыЦифроваяМаркировка.ИсточникПроисхождения = ИсточникиПроисхождения.Ссылка
	|ГДЕ
	|	СНТДругиеТоварыЦифроваяМаркировка.ПризнакПроисхождения <> &ЗначениеУслуги
	|	И СНТДругиеТоварыЦифроваяМаркировка.ИсточникПроисхождения <> &ПустойИсточникПроисхождения
	|	И СНТДругиеТоварыЦифроваяМаркировка.Количество <> 0
	|	И СНТДругиеТоварыЦифроваяМаркировка.ИдентификаторТовара <> ""1""
	|	И СНТДругиеТоварыЦифроваяМаркировка.ДополнительныйИдентификатор <> 1
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СНТТоварыЭкспортныйКонтроль.Товар,
	|	СНТТоварыЭкспортныйКонтроль.ЕдиницаИзмерения,
	|	СНТТоварыЭкспортныйКонтроль.Количество,
	|	СНТТоварыЭкспортныйКонтроль.Цена,
	|	СНТТоварыЭкспортныйКонтроль.ИсточникПроисхождения,
	|	ИсточникиПроисхождения.ДокументПартии,
	|	СНТТоварыЭкспортныйКонтроль.НомерСтроки,
	|	Реквизиты.Склад,
	|	&ВидДвижения,
	|	""ТоварыЭкспортныйКонтроль""
	|ИЗ
	|	Документ.СНТ.ТоварыЭкспортныйКонтроль КАК СНТТоварыЭкспортныйКонтроль
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Реквизиты КАК Реквизиты
	|		ПО СНТТоварыЭкспортныйКонтроль.Ссылка = Реквизиты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИсточникиПроисхождения КАК ИсточникиПроисхождения
	|		ПО СНТТоварыЭкспортныйКонтроль.ИсточникПроисхождения = ИсточникиПроисхождения.Ссылка
	|ГДЕ
	|	СНТТоварыЭкспортныйКонтроль.ПризнакПроисхождения <> &ЗначениеУслуги
	|	И СНТТоварыЭкспортныйКонтроль.ИсточникПроисхождения <> &ПустойИсточникПроисхождения
	|	И СНТТоварыЭкспортныйКонтроль.Количество <> 0
	|	И СНТТоварыЭкспортныйКонтроль.ИдентификаторТовара <> ""1""
	|	И СНТТоварыЭкспортныйКонтроль.ДополнительныйИдентификатор <> 1
	|
	// убран участок кода сторно-движения исправленной СНТ - 21.12.20	
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	

	Возврат ТекстЗапроса + ВСВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции	

Процедура ДокументСНТ_ОбработкаПроверкиЗаполнения(ОбъектСНТ, Отказ, ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов) Экспорт
	
	ЕстьТовары = Ложь;
	
	ПроверяемыеТабличныеЧасти = ТабличныеЧастиДокументаСНТ();
	
	//Если это не перемещение товаров, то отключим проверку ТЧ Товары
	Если Не ОбъектСНТ.ВидОперации = Перечисления.ВидыОперацийСНТ.Перемещение Тогда
		ПроверяемыеТабличныеЧасти.Удалить(ПроверяемыеТабличныеЧасти.НайтиПоЗначению("Товары"));
		РеквизитыТЧТовары = ОбъектСНТ["Товары"].ВыгрузитьКолонки().Колонки;
		Для Каждого РеквизитТЧ Из РеквизитыТЧТовары Цикл
			МассивНепроверяемыхРеквизитов.Добавить("Товары." + РеквизитТЧ.Имя);
		КонецЦикла;
	КонецЕсли;
	
	Для каждого ТабличнаяЧасть Из ПроверяемыеТабличныеЧасти Цикл
		Если ОбъектСНТ[ТабличнаяЧасть.Значение] <> Неопределено Тогда
			ДокументСНТ_ПроверитьЗаполнениеТабличнойЧастиПострочно(ОбъектСНТ, ОбъектСНТ[ТабличнаяЧасть.Значение], ТабличнаяЧасть.Значение, ТабличнаяЧасть.Представление, Отказ, ЕстьТовары);
		КонецЕсли;
	КонецЦикла; 
		
	Если ОбъектСНТ.Направление = Перечисления.НаправленияСНТ.Входящий Тогда
		МассивНепроверяемыхРеквизитов.Добавить("СкладОтправитель");
	ИначеЕсли ОбъектСНТ.Направление = Перечисления.НаправленияСНТ.Исходящий Тогда	
		Если ОбъектСНТ.ТипСНТ <> Перечисления.ТипыСНТ.ВозвратТоваров Тогда
			МассивНепроверяемыхРеквизитов.Добавить("СкладПолучатель");
		КонецЕсли;
		Если ОбъектСНТ.ВидОперации = Перечисления.ВидыОперацийСНТ.Ввоз Тогда
			МассивНепроверяемыхРеквизитов.Добавить("СкладОтправитель");
		КонецЕсли;	
	КонецЕсли;
	
	//Если установлена отметка «Нерезидент», не обязательно для заполнения поле "ИИН/БИН Получателя".
	Если ОбъектСНТ.ПолучательНерезидент Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ПолучательИдентификатор");
	КонецЕсли;
	
	//При установленной отметки категории «Розничная реализация» заполнение поля "ИИН/БИН Получателя" и "АдресДоставки" запрещен
	Если (ОбъектСНТ.ПолучательРозничнаяРеализация ИЛИ ОбъектСНТ.ПолучательФизическоеЛицо)
			И ОбъектСНТ.ТипСНТ <> Перечисления.ТипыСНТ.ВозвратТоваров Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ПолучательИдентификатор");
		МассивНепроверяемыхРеквизитов.Добавить("АдресДоставки");
	КонецЕсли;
	
	//При категории поставщика «Розничная реализация» заполнение полей "Склад отправитель" и "АдресОтправки" не проверяется, а склад получателя должен быть заполнен
	Если ОбъектСНТ.ПоставщикРозничнаяРеализация ИЛИ ОбъектСНТ.ПоставщикФизическоеЛицо Тогда
		МассивНепроверяемыхРеквизитов.Добавить("СкладОтправитель");
		МассивНепроверяемыхРеквизитов.Добавить("АдресОтправки");
		Если МассивНепроверяемыхРеквизитов.Найти("СкладПолучатель") <> Неопределено Тогда
			МассивНепроверяемыхРеквизитов.Удалить(МассивНепроверяемыхРеквизитов.Найти("СкладПолучатель"));
		КонецЕсли;
	КонецЕсли;
		
	Если ОбъектСНТ.Статус = Перечисления.СтатусыСНТ.Подтвержден Тогда
		ПроверяемыеРеквизиты.Добавить("ДатаПриема");
	КонецЕсли; 
	
	Если ОбъектСНТ.Направление = ПредопределенноеЗначение("Перечисление.НаправленияСНТ.Исходящий") Тогда
		
		Если ОбъектСНТ.ТипСНТ = ПредопределенноеЗначение("Перечисление.ТипыСНТ.ВозвратТоваров") И ОбъектСНТ.ПоставщикРозничнаяРеализация Тогда
			
			МассивНепроверяемыхРеквизитов.Добавить("Поставщик");
			МассивНепроверяемыхРеквизитов.Добавить("ПоставщикНаименование");
			МассивНепроверяемыхРеквизитов.Добавить("АдресОтправки");
			МассивНепроверяемыхРеквизитов.Добавить("СкладОтправитель");
			
		ИначеЕсли ОбъектСНТ.ТипСНТ = ПредопределенноеЗначение("Перечисление.ТипыСНТ.Первичная") И ОбъектСНТ.ПолучательРозничнаяРеализация Тогда
			
			МассивНепроверяемыхРеквизитов.Добавить("Получатель");
			МассивНепроверяемыхРеквизитов.Добавить("ПолучательНаименование");
			МассивНепроверяемыхРеквизитов.Добавить("ПолучательИдентификатор");
			МассивНепроверяемыхРеквизитов.Добавить("АдресДоставки");
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов) Экспорт
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ДокументСНТ_ПроверитьЗаполнениеТабличнойЧастиПострочно(ОбъектСНТ, ПроверяемаяТабличнаячасть, ИмяТабличнойЧасти, ПредставлениеИмяТабличнойЧасти, Отказ, ЕстьТовары = Ложь)
	
	Для Каждого СтрокаТабличнойЧасти Из ПроверяемаяТабличнаячасть Цикл
		
		Если СтрокаТабличнойЧасти.ПризнакПроисхождения <> Строка(6) Тогда
			
			ЕстьТовары = Истина;
			
			Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.Товар) Тогда
				ТекстСообщения = СтрШаблон( НСтр("ru = 'Не заполнена колонка ""Товар"" в строке %1 списка ""%2""'"),
					Формат(СтрокаТабличнойЧасти.НомерСтроки, "ЧН=0; ЧГ="),
					ПредставлениеИмяТабличнойЧасти);
				Поле = ИмяТабличнойЧасти + "[" + Формат(СтрокаТабличнойЧасти.НомерСтроки-1, "ЧН=0; ЧГ=") + "].Товар";
				ЭСФКлиентСерверПереопределяемый.СообщитьПользователю(ТекстСообщения, ОбъектСНТ, Поле, "Объект", Отказ);
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.ЕдиницаИзмерения) Тогда
				ТекстСообщения = СтрШаблон(НСтр("ru = 'Не заполнена колонка ""Единица измерения"" в строке %1 списка ""%2""'"),
					Формат(СтрокаТабличнойЧасти.НомерСтроки, "ЧН=0; ЧГ="),
					ПредставлениеИмяТабличнойЧасти);
				Поле = ИмяТабличнойЧасти + "[" + Формат(СтрокаТабличнойЧасти.НомерСтроки-1, "ЧН=0; ЧГ=") + "].ЕдиницаИзмерения";
				ЭСФКлиентСерверПереопределяемый.СообщитьПользователю(ТекстСообщения, ОбъектСНТ, Поле, "Объект", Отказ);
			КонецЕсли;
			
			Если ОбъектСНТ.Направление = Перечисления.НаправленияСНТ.Входящий И Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.ТоварНаименованиеВРамкахТС) 
				И (СтрокаТабличнойЧасти.ПризнакПроисхождения = "1" Или СтрокаТабличнойЧасти.ПризнакПроисхождения = "2")
				И НЕ СтрокаТабличнойЧасти.ИдентификаторТовара = "1" Тогда
				
				ТекстСообщения = СтрШаблон(НСтр("ru = 'Не заполнена колонка ""Наименование по ДТ/ФНО 328.00"" в строке %1 списка ""%2""'"),
					Формат(СтрокаТабличнойЧасти.НомерСтроки, "ЧН=0; ЧГ="),
					ПредставлениеИмяТабличнойЧасти);
				Поле = ИмяТабличнойЧасти + "[" + Формат(СтрокаТабличнойЧасти.НомерСтроки-1, "ЧН=0; ЧГ=") + "].ТоварНаименованиеВРамкахТС";
				ЭСФКлиентСерверПереопределяемый.СообщитьПользователю(ТекстСообщения, ОбъектСНТ, Поле, "Объект", Отказ);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДокументСопоставлениеСНТиФНО_ОбработкаПроверкиЗаполнения(ОбъектСопоставление, Отказ, ПроверяемыеРеквизиты) Экспорт
	
	СтруктураТабличныхЧастей = ТабличныеЧастиДокументаСопоставлениеСНТиФНО();
	
	ПроверитьТабличнуюЧастьДокументСопоставлениеСНТиФНО(
		ОбъектСопоставление,
		"ФНО",
		"ДокументЗаявлениеОВвозеТоваров",
		ОбъектСопоставление.Организация,
		СтруктураТабличныхЧастей,
		Отказ);
	
	ПроверитьТабличнуюЧастьДокументСопоставлениеСНТиФНО(
		ОбъектСопоставление,
		"СНТ",
		"ДокументСНТ",
		ОбъектСопоставление.Организация,
		СтруктураТабличныхЧастей,
		Отказ);
	
	ПроверитьСоответствиеРеквизитовТоваровВТабличныхЧастяхДокументаСопоставлениеСНТиФНО(ОбъектСопоставление, СтруктураТабличныхЧастей, Отказ);
	
	ПроверитьТабличнуюЧастьСНТДокументСопоставлениеСНТиФНОНаТоварыНеВС(ОбъектСопоставление, Отказ);
	
КонецПроцедуры

Процедура ПроверитьТабличнуюЧастьСНТДокументСопоставлениеСНТиФНОНаТоварыНеВС(ОбъектСопоставление, Отказ)
	
	//Если объект в статусе Обработанный, то проверку проводить не нужно
	Если ОбъектСопоставление.Статус = Перечисления.СтатусыСопоставленийСНТиФНО.Обработанный
			ИЛИ ОбъектСопоставление.Статус = Перечисления.СтатусыСопоставленийСНТиФНО.ОтзывМетодомЗамены Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыСНТ.НомерСтроки,
		|	ТоварыСНТ.ИсточникПроисхождения
		|ПОМЕСТИТЬ ВТ_Строки
		|ИЗ
		|	&ТоварыСНТ КАК ТоварыСНТ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СопоставлениеСНТиФНОТоварыСНТ.НомерСтроки КАК НомерСтроки,
		|	ИсточникиПроисхождения.ДополнительныйИдентификатор КАК ДополнительныйИдентификатор
		|ИЗ
		|	ВТ_Строки КАК СопоставлениеСНТиФНОТоварыСНТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИсточникиПроисхождения КАК ИсточникиПроисхождения
		|		ПО СопоставлениеСНТиФНОТоварыСНТ.ИсточникПроисхождения = ИсточникиПроисхождения.Ссылка
		|ГДЕ
		|	СопоставлениеСНТиФНОТоварыСНТ.ИсточникПроисхождения <> &ПустойИсточникПроисхождения
		|	И ИсточникиПроисхождения.ДополнительныйИдентификатор <> 0";
	
	Запрос.УстановитьПараметр("ПустойИсточникПроисхождения", ВССерверПереопределяемый.ПолучитьПустоеЗначениеИсточниковПроисхождения());
	Запрос.УстановитьПараметр("ТоварыСНТ", ОбъектСопоставление.ТоварыСНТ.Выгрузить(,"НомерСтроки, ИсточникПроисхождения"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Отказ = Ложь;
	Иначе
		СтрокаТоварыСНТ = РезультатЗапроса.Выбрать();
		
		Пока СтрокаТоварыСНТ.Следующий() Цикл
			
			Если СтрокаТоварыСНТ.ДополнительныйИдентификатор <> 0 Тогда
				
				ТекстСообщения = СНТКлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'В табличной части ""Товары из СНТ"" присутствует товар ВС, строка %1.'"),
				Формат(СтрокаТоварыСНТ.НомерСтроки, "ЧН=0; ЧГ="));
				
				Поле = "ТоварыСНТ[" + Формат(СтрокаТоварыСНТ.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].ИсточникПроисхождения";
				ЭСФКлиентСерверПереопределяемый.СообщитьПользователю(ТекстСообщения, ОбъектСопоставление, Поле, "Объект", Отказ);
				
				Отказ = Истина;
				
			КонецЕсли;
		
		КонецЦикла;
		
		Если Отказ = Истина И ОбъектСопоставление.Статус <> Перечисления.СтатусыСопоставленийСНТиФНО.Обработанный Тогда
			ЭСФКлиентСервер.СообщитьПользователю(НСтр("ru = 'Документ содержит товары ВС, проведение возможно только в статусе ""Обработанный"".'"));
			Отказ = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ТекстЗапросаТаблицаТоварыНаВС_Сопоставление(НомераТаблиц, Реквизиты, ПараметрыПроведения) Экспорт
	
	НомераТаблиц.Вставить("ТаблицаТоварыНаВС", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	//расходные движения по источнику происхождения до сопоставления
	"ВЫБРАТЬ
	|	СопоставлениеТовары.Товар КАК Номенклатура,
	|	СопоставлениеТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СопоставлениеТовары.КоличествоОстатков КАК Количество,
	|	СопоставлениеТовары.Цена,
	|	СопоставлениеТовары.ИсточникПроисхождения КАК ИсточникПроисхождения,
	|	ИсточникиПроисхождения.ДокументПартии КАК ДокументПартии,
	|	СопоставлениеТовары.НомерСтроки КАК НомерСтроки,
	|	СопоставлениеТовары.Склад КАК Склад,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	""ТоварыВС"" КАК ИмяСписка
	|ИЗ
	|	Документ.СопоставлениеСНТиФНО.ТоварыСНТ КАК СопоставлениеТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Реквизиты КАК Реквизиты
	|		ПО СопоставлениеТовары.Ссылка = Реквизиты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИсточникиПроисхождения КАК ИсточникиПроисхождения
	|		ПО СопоставлениеТовары.ИсточникПроисхождения = ИсточникиПроисхождения.Ссылка
	|ГДЕ
	|	СопоставлениеТовары.КоличествоОстатков <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	//приходные движения по сопоставленному источнику происхождения
	|ВЫБРАТЬ
	|	СопоставлениеТовары.Товар КАК Номенклатура,
	|	СопоставлениеТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СопоставлениеТовары.КоличествоОстатков КАК Количество,
	|	СопоставлениеТовары.Цена,
	|	СопоставлениеТовары.ИсточникПроисхожденияПолучатель КАК ИсточникПроисхождения,
	|	Реквизиты.Ссылка КАК ДокументПартии,
	|	СопоставлениеТовары.НомерСтроки КАК НомерСтроки,
	|	СопоставлениеТовары.Склад КАК Склад,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	""ТоварыВС"" КАК ИмяСписка
	|ИЗ
	|	Документ.СопоставлениеСНТиФНО.ТоварыСНТ КАК СопоставлениеТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Реквизиты КАК Реквизиты
	|		ПО СопоставлениеТовары.Ссылка = Реквизиты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИсточникиПроисхождения КАК ИсточникиПроисхождения
	|		ПО СопоставлениеТовары.ИсточникПроисхождения = ИсточникиПроисхождения.Ссылка
	|ГДЕ
	|	СопоставлениеТовары.ИсточникПроисхождения <> &ПустойИсточникПроисхождения
	|	И СопоставлениеТовары.КоличествоОстатков <> 0
	|";

	Возврат ТекстЗапроса + ВСВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции	

#КонецОбласти

#Область ОбщиеФункцииПоЗаполнениюСНТ

Процедура ЗаполнитьРеквизитыКонтрагента(Знач ОбъектСНТ, Знач Поставщик) Экспорт
	
	НачатьТранзакцию();
	
	Попытка
		
		ТекстКомментария = СНТКлиентСервер.ТекстКомментарияСозданПоДаннымСНТ(ОбъектСНТ.Ссылка);		
		ОбъектКонтрагент = Поставщик.ПолучитьОбъект();
		
		/////////////////////////////////////////////////////////////////////////////
		// Заполнить реквизиты контрагента.
		ОбъектКонтрагент.ИдентификационныйКодЛичности = ОбъектСНТ.ПоставщикИдентификатор;
		ОбъектКонтрагент.Наименование = ОбъектСНТ.ПоставщикНаименование;	
		ОбъектКонтрагент.НаименованиеПолное = ОбъектСНТ.ПоставщикНаименование;
		ОбъектКонтрагент.Комментарий = ТекстКомментария;
		
		/////////////////////////////////////////////////////////////////////////////
		// Проверить, что такого договора контрагента нет.
		МассивДоговоров = НайтиДоговорыПоставкиПоДаннымСНТ(ОбъектСНТ, Поставщик);
		
		/////////////////////////////////////////////////////////////////////////////
		// Создать, заполнить и записать договор контрагента.
		Если МассивДоговоров.Количество() = 0 Тогда
			
			ОбъектДоговор = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
			
			ОбъектДоговор.Наименование = ЭСФКлиентСервер.НаименованиеДоговора(ОбъектСНТ);
			ОбъектДоговор.Владелец = ОбъектКонтрагент.Ссылка;
			ОбъектДоговор.ВалютаВзаиморасчетов = ОбъектСНТ.Валюта;
			ОбъектДоговор.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом;
			ОбъектДоговор.Комментарий = ТекстКомментария;
			ОбъектДоговор.Организация = ОбъектСНТ.Организация;
			ОбъектДоговор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком;
			ОбъектДоговор.НомерДоговора = ОбъектСНТ.ДоговорПоставкиНомер;
			ОбъектДоговор.ДатаДоговора = ОбъектСНТ.ДоговорПоставкиДата;
			
			ОбъектДоговор.Записать();
			
			Если НЕ ЗначениеЗаполнено(ОбъектКонтрагент.ОсновнойДоговорКонтрагента) Тогда
				ОбъектКонтрагент.ОсновнойДоговорКонтрагента = ОбъектДоговор.Ссылка;
			КонецЕсли;
			
		КонецЕсли;
		
		/////////////////////////////////////////////////////////////////////////////
		// Повторно записать контрагента и зафиксировать транзакцию.
		ОбъектКонтрагент.Записать();
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ВызватьИсключение ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		
	КонецПопытки;
	
КонецПроцедуры

Функция НайтиДоговорыПоставкиПоДаннымСНТ(Знач ОбъектСНТ, Знач СтрокаКонтрагент) Экспорт
	
	МассивДоговоров = Новый Массив;
	
	Запрос = Новый Запрос;
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДоговорыКонтрагентов.Ссылка
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.НомерДоговора = &НомерДоговора
	|	И ДоговорыКонтрагентов.ДатаДоговора = &ДатаДоговора
	|	И ДоговорыКонтрагентов.Владелец = &Контрагент
	|	И ДоговорыКонтрагентов.Организация = &Организация
	|	И ДоговорыКонтрагентов.ВалютаВзаиморасчетов = &ВалютаВзаиморасчетов
	|	И ДоговорыКонтрагентов.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("НомерДоговора", ОбъектСНТ.ДоговорПоставкиНомер);
	Запрос.УстановитьПараметр("ДатаДоговора", ОбъектСНТ.ДоговорПоставкиДата);
	
	Запрос.УстановитьПараметр("Контрагент", СтрокаКонтрагент);
	
	Запрос.УстановитьПараметр("Организация", ОбъектСНТ.Организация);
	Запрос.УстановитьПараметр("ВалютаВзаиморасчетов", ОбъектСНТ.Валюта);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивДоговоров.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Возврат МассивДоговоров;
	
КонецФункции

Функция ПолучитьРеквизитыЗаявленияОВвозеТоваров(ЗаявлениеОВвозеТоваров) Экспорт
	
	//состав ключей структуры не менять!
	СтруктураРеквизитов = Новый Структура("РегистрационныйНомер, Дата, Сумма");
	
	//БК3
	СтруктураРеквизитовФНО = ЭСФСерверПереопределяемый.ЗначенияРеквизитовОбъекта(ЗаявлениеОВвозеТоваров, "РегистрационныйНомер, Дата, СуммаДокумента");
	//УПК
	//СтруктураРеквизитовФНО = ЭСФСерверПереопределяемый.ЗначенияРеквизитовОбъекта(ЗаявлениеОВвозеТоваров, "НомерОтметкиОРегистрации, Дата, СуммаДокумента");
	
	//БК
	СтруктураРеквизитов.РегистрационныйНомер = СтруктураРеквизитовФНО.РегистрационныйНомер;
	//УПК
	//СтруктураРеквизитов.РегистрационныйНомер = СтруктураРеквизитовФНО.НомерОтметкиОРегистрации;
	
	СтруктураРеквизитов.Дата				 = СтруктураРеквизитовФНО.Дата;
	СтруктураРеквизитов.Сумма				 = СтруктураРеквизитовФНО.СуммаДокумента;
	
	Возврат СтруктураРеквизитов;	
	
КонецФункции

Функция ПолучитьДокументыВозвратаОптовыхПродаж(МассивДокументов) Экспорт
	
	МассивДокументовОптовыеВозвраты = Новый Массив();
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ВозвратТоваровОтПокупателя.Ссылка КАК Ссылка
	//|ИЗ
	//|	Документ.ВозвратТоваровОтПокупателя КАК ВозвратТоваровОтПокупателя
	//|ГДЕ
	//|	ВозвратТоваровОтПокупателя.Ссылка В(&Основание)
	//|	И ВозвратТоваровОтПокупателя.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВозвратТоваровОтПокупателя.ВозвратРозничнойПродажи)";
	//
	//Запрос.УстановитьПараметр("Основание", МассивДокументов);
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	//
	//Пока Выборка.Следующий() Цикл
	//	МассивДокументовОптовыеВозвраты.Добавить(Выборка.Ссылка);
	//КонецЦикла;
	
	Возврат МассивДокументовОптовыеВозвраты;
		
КонецФункции

Функция ПолучитьДокументыПоступленияНеИмпорт(МассивДокументов) Экспорт
	
	МассивДокументовНеИмпорт = Новый Массив();
	
	//БК 3.0.35.
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПоступлениеТоваровУслуг.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|ГДЕ
	|	ПоступлениеТоваровУслуг.Ссылка В(&Основание)
	|	И ПоступлениеТоваровУслуг.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеТоваровУслуг.Импорт)";
	
	Запрос.УстановитьПараметр("Основание", МассивДокументов);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		МассивДокументовНеИмпорт.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Возврат МассивДокументовНеИмпорт;
	
КонецФункции

Процедура ПолучательРозничныйПокупатель(ДокументСНТ) Экспорт 

	СНТНаВозврат = ДокументСНТ.ТипСНТ = Перечисления.ТипыСНТ.ВозвратТоваров;
	
	Если СНТНаВозврат Тогда
		КонтрагентРозница = ДокументСНТ.Поставщик;
	Иначе
		КонтрагентРозница = ДокументСНТ.Получатель;
	КонецЕсли;
	
	КонтрагентРозницаСсылка = ПолучитьРозничногоКонтрагента();
	НайденРозничныйКонтрагент = Ложь;
	
	Для каждого РозничногоКонтрагента Из КонтрагентРозницаСсылка Цикл
		Если КонтрагентРозница = РозничногоКонтрагента Тогда
			НайденРозничныйКонтрагент = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ НайденРозничныйКонтрагент Тогда
		Возврат;
	КонецЕсли; 
	
	Если ТипЗнч(ДокументСНТ.ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг")
		ИЛИ ТипЗнч(ДокументСНТ.ДокументОснование) = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя")
		ИЛИ ТипЗнч(ДокументСНТ.ДокументОснование) = Тип("ДокументСсылка.ОтчетОРозничныхПродажах") Тогда
		
		Если СНТНаВозврат Тогда
			ДокументСНТ.ПоставщикФизическоеЛицо = Ложь;
			ДокументСНТ.ПоставщикРозничнаяРеализация = Истина;
			ДокументСНТ.ПоставщикИдентификатор = "";
			ДокументСНТ.ГрузоотправительИдентификатор = "";
		Иначе
			ДокументСНТ.ПолучательФизическоеЛицо = Ложь;
			ДокументСНТ.ПолучательРозничнаяРеализация = Истина;
			ДокументСНТ.ПолучательИдентификатор = "";
			ДокументСНТ.ГрузополучательИдентификатор = "";
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокументСНТ.СвязанныйСНТ) Тогда
		
		СписокРеквизитовДляЗаполнения = "ПолучательИдентификатор, ПолучательНаименование, ПолучательБИНСтруктурногоПодразделения, 
		|ПолучательБИНРеорганизованногоЛица, АдресДоставки, ГрузополучательИдентификатор, ГрузополучательНаименование";
		
		Если ДокументСНТ.ТипСНТ = Перечисления.ТипыСНТ.Исправленная И НЕ СНТНаВозврат Тогда
			
			СтруктураДанныхПервичногоСНТ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСНТ.СвязанныйСНТ, СписокРеквизитовДляЗаполнения);
			
			ЗаполнитьЗначенияСвойств(ДокументСНТ, СтруктураДанныхПервичногоСНТ, СписокРеквизитовДляЗаполнения);
			
		ИначеЕсли СНТНаВозврат Тогда
			
			СтруктураДанныхПервичногоСНТ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСНТ.СвязанныйСНТ, СписокРеквизитовДляЗаполнения);
			
			ДокументСНТ.ПоставщикИдентификатор = СтруктураДанныхПервичногоСНТ.ПолучательИдентификатор;
			ДокументСНТ.ПоставщикНаименование = СтруктураДанныхПервичногоСНТ.ПолучательНаименование;
			ДокументСНТ.ПоставщикБИНСтруктурногоПодразделения = СтруктураДанныхПервичногоСНТ.ПолучательБИНСтруктурногоПодразделения;
			ДокументСНТ.ПоставщикБИНРеорганизованногоЛица = СтруктураДанныхПервичногоСНТ.ПолучательБИНРеорганизованногоЛица;
			ДокументСНТ.ГрузоотправительИдентификатор = СтруктураДанныхПервичногоСНТ.ГрузополучательИдентификатор;
			ДокументСНТ.ГрузоотправительНаименование = СтруктураДанныхПервичногоСНТ.ГрузополучательНаименование;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьРозничногоКонтрагента() Экспорт
	
	МассивРозничныхКонтрагентов = Новый Массив;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Контрагенты.Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.ЭтоГруппа = ЛОЖЬ
	|	И Контрагенты.ИдентификационныйКодЛичности = ""000000000000""
	|	И Контрагенты.ПометкаУдаления = ЛОЖЬ";
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			МассивРозничныхКонтрагентов.Добавить(Выборка.Ссылка);
		КонецЦикла;
		
		Возврат МассивРозничныхКонтрагентов;
		
	Иначе
		
		НовыйКонтрагент = Справочники.Контрагенты.СоздатьЭлемент();
		НовыйКонтрагент.ИдентификационныйКодЛичности = "000000000000";
		НовыйКонтрагент.Наименование = НСтр("ru = 'Розничная выручка'", ОбщегоНазначения.КодОсновногоЯзыка());
		НовыйКонтрагент.НаименованиеПолное = НСтр("ru = 'Розничная выручка'", ОбщегоНазначения.КодОсновногоЯзыка());
		НовыйКонтрагент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо;
		НовыйКонтрагент.РНН = "";
		НовыйКонтрагент.Записать();
		
		Возврат НовыйКонтрагент.Ссылка;
		
	КонецЕсли;
	
КонецФункции

//Возвращает дату ввода категории "Малая торговая точка".
//
//После ввода категори "Малая торговая точка", будет возможность подтверждать/отклонять первичную или исправленную СНТ 
//при наличии категории «Розничный реализатор» в разделе С. «Реквизиты получателя» и при заполнении разделов G1-G10.
Функция ДатаВводаМТТ() Экспорт
	
	Возврат Дата(2022,2,5);
	
КонецФункции

//Возвращает дату ввода изменений по категории "Малая торговая точка".
//
//После ввода изменений по категори "Малая торговая точка", будет отменена возможность подтверждать первичную или исправленную СНТ 
// выписанную в адрес МТТ по табличным частям (G2-G8), а так же СНТ на возврат будет выписывать поставщик и её же подтверждать.
Функция ДатаИзмененийМТТ() Экспорт
	
	Возврат Дата(2022,12,23);
	
КонецФункции

//Если документ СНТ входящий для раздела получателя с категорией МТТ и были заполнены ТЧ G2-G10,
//то при оформлении Возврат ТМЗ поставщику необходимо брать категорию из первичной полученной СНТ 
//(так как в таком случае наш получатель являеся Организацией а не Контрагентом, а карточке Органиизации у нас нет реквизита МТТ).
Функция ПолучитьПолучательМТТИзСвязанногоСНТ(СвязанныйСНТ, ТипСНТ) Экспорт
	
	Если СвязанныйСНТ.ПолучательМалаяТорговаяТочка Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Процедура ПолучитьДанныеКонтрагентаИсправленнойИлиНаВозвратСНТ(ДляЗаполненияСНТ, ДанныеИзСНТ, ПоставщикМТТ = Ложь, ВозвратОтПокупателя  = Ложь, ВозвратПоставщику = Ложь) Экспорт 

	СНТНаВозврат = ДанныеИзСНТ.ТипСНТ = Перечисления.ТипыСНТ.ВозвратТоваров;
	
	Если СНТНаВозврат Тогда
		Контрагент = ДанныеИзСНТ.Поставщик;
	Иначе
		Контрагент = ДанныеИзСНТ.Получатель;
	КонецЕсли;
			
	СписокРеквизитовДляЗаполнения = "ПолучательИдентификатор, ПолучательНаименование, ПолучательРозничнаяРеализация, ПолучательРозничныйРеализатор,
									|ПолучательМалаяТорговаяТочка, АдресДоставки, ГрузополучательИдентификатор, ГрузополучательНаименование,
									|АдресОтправки, СкладДоставкиИдентификатор, СкладОтправкиИдентификатор, ПолучательКодСтраны, ПолучательКодСтраныДоставки,
									|ВидОперации, ВидВвоза, ПолучательНерезидент, ПоставщикИдентификатор, ПоставщикНаименование, ПоставщикНерезидент, ПоставщикКодСтраны,
									|ПоставщикКодСтраныОтправки, ГрузоотправительИдентификатор, ГрузоотправительНаименование, ГрузоотправительКодСтраныОтправки, ГрузоотправительНерезидент,
									|УникальныйНомерВалютногоКонтроля, ДоговорПоставки, ДоговорПоставкиДата, ДоговорПоставкиНомер, ДоговорПоставкиУсловияОплаты, ДоговорПоставкиУсловияПоставки";
	
	Если ДанныеИзСНТ.ТипСНТ = Перечисления.ТипыСНТ.Исправленная И НЕ СНТНаВозврат Тогда
		
		СтруктураДанныхПервичногоСНТ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеИзСНТ.СвязанныйСНТ, СписокРеквизитовДляЗаполнения);
		
		ЗаполнитьЗначенияСвойств(ДляЗаполненияСНТ, СтруктураДанныхПервичногоСНТ, СписокРеквизитовДляЗаполнения);
		
	ИначеЕсли СНТНаВозврат Тогда
		
		СтруктураДанныхПервичногоСНТ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеИзСНТ.СвязанныйСНТ, СписокРеквизитовДляЗаполнения);
		
		ДляЗаполненияСНТ.ПоставщикИдентификатор = СтруктураДанныхПервичногоСНТ.ПолучательИдентификатор;
		ДляЗаполненияСНТ.ПоставщикНаименование = СтруктураДанныхПервичногоСНТ.ПолучательНаименование;
		ДляЗаполненияСНТ.ГрузоотправительИдентификатор = СтруктураДанныхПервичногоСНТ.ГрузополучательИдентификатор;
		ДляЗаполненияСНТ.ГрузоотправительНаименование = СтруктураДанныхПервичногоСНТ.ГрузополучательНаименование;
		ДляЗаполненияСНТ.ПоставщикРозничнаяРеализация = СтруктураДанныхПервичногоСНТ.ПолучательРозничнаяРеализация;
		ДляЗаполненияСНТ.ПоставщикРозничныйРеализатор = СтруктураДанныхПервичногоСНТ.ПолучательРозничныйРеализатор;
		ДляЗаполненияСНТ.ПоставщикМалаяТорговаяТочка = ПоставщикМТТ;
		// Заполнение адреса доставки в документе СНТ на возврат из связанной СНТ данные по поставщику в раздел С.Получатель
		ДляЗаполненияСНТ.АдресДоставки = СтруктураДанныхПервичногоСНТ.АдресОтправки;
		
		ДляЗаполненияСНТ.УникальныйНомерВалютногоКонтроля = СтруктураДанныхПервичногоСНТ.УникальныйНомерВалютногоКонтроля;
		ДляЗаполненияСНТ.ДоговорПоставки = СтруктураДанныхПервичногоСНТ.ДоговорПоставки;
		ДляЗаполненияСНТ.ДоговорПоставкиДата = СтруктураДанныхПервичногоСНТ.ДоговорПоставкиДата;
		ДляЗаполненияСНТ.ДоговорПоставкиНомер = СтруктураДанныхПервичногоСНТ.ДоговорПоставкиНомер;
		ДляЗаполненияСНТ.ДоговорПоставкиУсловияОплаты = СтруктураДанныхПервичногоСНТ.ДоговорПоставкиУсловияОплаты;
		ДляЗаполненияСНТ.ДоговорПоставкиУсловияПоставки = СтруктураДанныхПервичногоСНТ.ДоговорПоставкиУсловияПоставки;
		
		// Когда в первичная(связанная) СНТ была на ввоз - импорт
		Если СтруктураДанныхПервичногоСНТ.ВидОперации = Перечисления.ВидыОперацийСНТ.Ввоз Тогда
			ДляЗаполненияСНТ.ПолучательИдентификатор = СтруктураДанныхПервичногоСНТ.ПоставщикИдентификатор;
			ДляЗаполненияСНТ.ПолучательНаименование = СтруктураДанныхПервичногоСНТ.ПоставщикНаименование;
			ДляЗаполненияСНТ.ПолучательНерезидент = СтруктураДанныхПервичногоСНТ.ПоставщикНерезидент;
			ДляЗаполненияСНТ.ПолучательКодСтраны = СтруктураДанныхПервичногоСНТ.ПоставщикКодСтраны;
			ДляЗаполненияСНТ.ПолучательКодСтраныДоставки = СтруктураДанныхПервичногоСНТ.ПоставщикКодСтраныОтправки;
			ДляЗаполненияСНТ.ГрузополучательИдентификатор = СтруктураДанныхПервичногоСНТ.ГрузоотправительИдентификатор;
			ДляЗаполненияСНТ.ГрузополучательНаименование = СтруктураДанныхПервичногоСНТ.ГрузоотправительНаименование;
			ДляЗаполненияСНТ.ГрузополучательКодСтраныОтправки = СтруктураДанныхПервичногоСНТ.ГрузоотправительКодСтраныОтправки;
			ДляЗаполненияСНТ.ГрузополучательНерезидент = СтруктураДанныхПервичногоСНТ.ГрузоотправительНерезидент;
		КонецЕсли;
		
		// Заполнение адреса отправки в документе СНТ на возврат из связанной СНТ данные по поставщику в раздел В.Поставщик
		ДляЗаполненияСНТ.АдресОтправки = СтруктураДанныхПервичногоСНТ.АдресДоставки;
		
		Если ВозвратОтПокупателя Тогда
			ДляЗаполненияСНТ.СкладОтправкиИдентификатор = СтруктураДанныхПервичногоСНТ.СкладДоставкиИдентификатор;
			Если ДляЗаполненияСНТ.ПоставщикРозничнаяРеализация = Истина Тогда
				// Заполнение адреса отправки в документе СНТ на возврат из связанной СНТ данные по поставщику в раздел В.Поставщик для розничного поставщика не требуется
				ДляЗаполненияСНТ.АдресОтправки = "";
			КонецЕсли;
			
			// Когда в первичной(связанной) СНТ реализация была нерезиденту - экспорт
			Если СтруктураДанныхПервичногоСНТ.ВидОперации = Перечисления.ВидыОперацийСНТ.Вывоз Тогда
				
				ДляЗаполненияСНТ.ПоставщикКодСтраны = СтруктураДанныхПервичногоСНТ.ПолучательКодСтраны;
				ДляЗаполненияСНТ.ПоставщикКодСтраныОтправки = СтруктураДанныхПервичногоСНТ.ПолучательКодСтраныДоставки;
				
				ДляЗаполненияСНТ.ВидОперации = Перечисления.ВидыОперацийСНТ.Ввоз;
				ДляЗаполненияСНТ.ВидВвоза = Перечисления.ВидыВвозаСНТ.Импорт;
				
				ДляЗаполненияСНТ.ПоставщикНерезидент = СтруктураДанныхПервичногоСНТ.ПолучательНерезидент;
				
			КонецЕсли;
			
		ИначеЕсли ВозвратПоставщику Тогда
			ДляЗаполненияСНТ.СкладДоставкиИдентификатор = СтруктураДанныхПервичногоСНТ.СкладОтправкиИдентификатор;
		КонецЕсли;
		
	КонецЕсли;
			
КонецПроцедуры

// При введении СНТ на основании учетных документов некоторые первичные документы могут оставаться непроведенными.
// Такие документы исключаются из массива непроведенных документов.
// Например, постемление по импорту, так как СНТ оформляется до поступления товаров по учетному контуру
Процедура ИсключитьДокументыНеТребующиеПроведения(МассивНепроведенныхДокументов) Экспорт
	
	Если МассивНепроведенныхДокументов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПоступлениеТоваровУслуг.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|ГДЕ
	|	ПоступлениеТоваровУслуг.Ссылка В(&МассивСсылок)
	|	И ПоступлениеТоваровУслуг.ВидОперации = &ВидОперации";
	
	Запрос.УстановитьПараметр("ВидОперации", Перечисления.ВидыОперацийПоступлениеТоваровУслуг.Импорт);
	Запрос.УстановитьПараметр("МассивСсылок", МассивНепроведенныхДокументов);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ИндексЭлемента = МассивНепроведенныхДокументов.Найти(ВыборкаДетальныеЗаписи.Ссылка);
		Если ИндексЭлемента <> Неопределено Тогда
			МассивНепроведенныхДокументов.Удалить(ИндексЭлемента);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

//Возвращает дату ввода нового объединенного раздела К.
Функция ДатаВводаРазделаКВерсии1_2() Экспорт
	
	Возврат Дата(2024,12,26,00,00,00);
	
КонецФункции

//Возвращает дату ввода веса нетто
Функция ДатаВводаВесаНетто() Экспорт
	
	Возврат Дата(2024,12,26,00,00,00);
	
КонецФункции 

Функция ВведенНовыйРазделК() Экспорт
	
	Возврат Истина;
	
КонецФункции	

Функция ВесНеттоИспользуется() Экспорт
	
	Возврат Истина;
	
КонецФункции	

Функция ДатаВесНеттоОбязательноеЗаполнение() Экспорт
	
	Возврат Дата(2025,01,01,00,00,00);

КонецФункции	

#КонецОбласти

#Область ФормыДокументаСНТ

Функция КоэффициентАкцизаИзНоменклатуры(Номенклатура) Экспорт
	
	Если ТипЗнч(Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
			
		СписокНоменклатуры = Новый Массив;
		СписокНоменклатуры.Добавить(Номенклатура);
		
		ПолученоИзНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(СписокНоменклатуры, "КоэффициентРасчетаОблагаемойБазыАкциза").Получить(Номенклатура);
		
		КоэффициентАкциза = 0;
		
		Если ПолученоИзНоменклатуры <> Неопределено Тогда
			КоэффициентАкциза = ПолученоИзНоменклатуры.КоэффициентРасчетаОблагаемойБазыАкциза;
		КонецЕсли;		
	Иначе
		КоэффициентАкциза = 0;
	КонецЕсли;
	
	Возврат КоэффициентАкциза;
	
КонецФункции

Процедура ПриСозданииНаСервере(Форма) Экспорт
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(Форма);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды	
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(Форма);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
КонецПроцедуры

Процедура ПриЧтенииНаСервере(ТекущийОбъект, Форма) Экспорт

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(Форма, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
 	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(Форма, ТекущийОбъект);
 	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения

КонецПроцедуры

Процедура ПослеЗаписиНаСервере(Форма, ТекущийОбъект, ПараметрыЗаписи) Экспорт

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПослеЗаписиНаСервере(Форма, ТекущийОбъект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

Функция ПолучитьСведенияОНоменклатуре(Номенклатура) Экспорт
	
	ДанныеНоменклатуры = Новый Структура();
	Если ТипЗнч(Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда		
		ДанныеНоменклатуры.Вставить("ТоварНаименование",   Номенклатура.НаименованиеПолное);
		ДанныеНоменклатуры.Вставить("КодТНВЭД", 		   Номенклатура.КодТНВЭД);
		ДанныеНоменклатуры.Вставить("ЕдиницаИзмерения",    Номенклатура.БазоваяЕдиницаИзмерения);
		ДанныеНоменклатуры.Вставить("ЕдиницаИзмеренияКод", Номенклатура.БазоваяЕдиницаИзмерения.КодЭСФ);
	ИначеЕсли ТипЗнч(Номенклатура) = Тип("СправочникСсылка.ОсновныеСредства") ИЛИ ТипЗнч(Номенклатура) = Тип("СправочникСсылка.НематериальныеАктивы") Тогда
		ДанныеНоменклатуры.Вставить("ТоварНаименование",   Номенклатура.НаименованиеПолное);
		ДанныеНоменклатуры.Вставить("КодТНВЭД", 		   "");
		ДанныеНоменклатуры.Вставить("ЕдиницаИзмерения",    Справочники.КлассификаторЕдиницИзмерения.ПолучитьЕдиницуИзмеренияПоУмолчанию());
		ДанныеНоменклатуры.Вставить("ЕдиницаИзмеренияКод", ДанныеНоменклатуры.ЕдиницаИзмерения.КодЭСФ);
	Иначе	
		ДанныеНоменклатуры.Вставить("ТоварНаименование",   Номенклатура.НаименованиеПолное);
		ДанныеНоменклатуры.Вставить("КодТНВЭД", 		   "");
		ДанныеНоменклатуры.Вставить("ЕдиницаИзмерения",    Справочники.КлассификаторЕдиницИзмерения.ПустаяСсылка());
		ДанныеНоменклатуры.Вставить("ЕдиницаИзмеренияКод", "");		
	КонецЕсли;
	
	Возврат ДанныеНоменклатуры;
	
КонецФункции

Процедура ПриСозданииНаСервереДокументаСопоставления(Форма) Экспорт
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(Форма);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды	
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(Форма);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
КонецПроцедуры

Функция ОпределитьТипПоставщикаПолучателя(ВидОперации) Экспорт
	
	//Определим типа поставщика получателя,для различных видов операций
	//В решении при встраивании определить свой набор типов
	Массив = Новый Массив(); 
	Массив.Добавить(Тип("СправочникСсылка.Организации"));
	Массив.Добавить(Тип("СправочникСсылка.ПодразделенияОрганизаций"));
	
	Если Не ВидОперации = Перечисления.ВидыОперацийСНТ.ПеремещениеМеждуФилиалами Тогда 
		Массив.Добавить(Тип("СправочникСсылка.Контрагенты"));
	КонецЕсли;
	
	Возврат Новый ОписаниеТипов(Массив);
	
КонецФункции

// Обработчик события ПриСозданииНаСервере в форме списка документа СНТ.
//
// Параметры:
//  Форма - УправляемаяФорма - Форма документа СНТ.
//
Процедура СНТФормаСпискаИВыбораПриСозданииНаСервере(Форма) Экспорт
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(Форма);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаявлениеОВвозеПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	ИзменитьКоманднуюПанельДокумента(Форма);
	
КонецПроцедуры

Процедура ДокументыИмпортаПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	ИзменитьКоманднуюПанельДокумента(Форма);
	
КонецПроцедуры

// Убрать отображение команды на создание СНТ из первчных документов.
//
// Параметры:
//  Форма - Форма, УправляемаяФорма - Форма первичного списка/документа (ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалогов), 
//   в которой необходимо убрать отображение кнопок СНТ.
Процедура ИзменитьКоманднуюПанельДокумента(Форма)Экспорт
	
	КомандаСоздатьСНТ = Форма.Элементы.Найти("ФормаДокументСНТСоздатьСНТ");
	Если КомандаСоздатьСНТ <> Неопределено Тогда
		КомандаСоздатьСНТ.Видимость = Ложь;
	КонецЕсли;
	
	КомандаСоздатьИсправленнуюСНТ = Форма.Элементы.Найти("ФормаДокументСНТВыписатьИсправленнуюСНТ");
	Если КомандаСоздатьИсправленнуюСНТ <> Неопределено Тогда
		КомандаСоздатьИсправленнуюСНТ.Видимость = Ложь;
	КонецЕсли;
		
КонецПроцедуры

Функция ПолучитьТипДокументаНаИмпорт ()Экспорт
	Возврат Тип("ДокументСсылка.ГТДИмпорт");//БК	//Возврат Тип("ДокументСсылка.ТаможеннаяДекларацияИмпорт"); //УПК
КонецФункции

Процедура ЗаполнитьПризнакСчетФактураВЭлектронномВиде(СчетФактураОбъект) Экспорт
	
	СчетФактураОбъект.СпособВыставления = Перечисления.СпособыОбменаДокументами.Электронно;
	
	//Если ТипЗнч(СчетФактураОбъект) = Тип("ДокументОбъект.СчетФактураВыданный") Тогда
	//	// ++ УПК
	//	СчетФактураОбъект.ВыставленВЭлектронномВиде = Истина;
	//	// -- УПК
	//ИначеЕсли ТипЗнч(СчетФактураОбъект) = Тип("ДокументОбъект.СчетФактураПолученный") Тогда
	//	// ++ УПК
	//	СчетФактураОбъект.ПолученВЭлектронномВиде = Истина;
	//	// -- УПК
	//КонецЕсли;
	
КонецПроцедуры

Функция НайтиПодчиненныйСчетФактуру(Основание, ТипДокумента) Экспорт
	Возврат УчетНДСИАкциза.НайтиПодчиненныйСчетФактуру(Основание, ТипДокумента);
КонецФункции

Функция НайтиПодчиненныйЭСФ(ДокументСсылка, ИсключитьОтозванные = Ложь) Экспорт
	
	Если Не ЗначениеЗаполнено(ДокументСсылка) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НайденныйДокумент = Неопределено;

	Запрос = Новый Запрос;

	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЭСФ.Ссылка,
	|	ЭСФ.Ссылка.Дата КАК ДатаЭСФ,
	|	ЭСФ.Ссылка.ПометкаУдаления КАК ПометкаУдаленияЭСФ
	|ИЗ
	|	Документ.ЭСФ КАК ЭСФ
	|ГДЕ
	|	ЭСФ.СчетФактура В (&ДокументСсылка)";
	
	Если ИсключитьОтозванные Тогда
		Запрос.Текст = Запрос.Текст + " И
		|	ЭСФ.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыЭСФ.Отозванный)";
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + "
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЭСФ.Ссылка.ПометкаУдаления,
	|	ЭСФ.Ссылка.Проведен УБЫВ,
	|	ЭСФ.Ссылка.Дата";
	
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаЗапроса;

КонецФункции

// Заполняет реквизит ДоговорПоставки в документах ЭСФ.
//
// Параметры:
//  МассивЭСФ - Массив - Массив документов ЭСФ, в которых необходимо заполнить реквизит ДоговорПоставки.
//   Каждый элемент массива должен иметь тип ДокументОбъект.ЭСФ.
// 
Процедура ЗаполнитьСсылкиНаДоговорыПоставки(МассивСНТ) Экспорт
	
	// Очистить старые ссылки на договры поставки.
	Для Каждого ОбъектСНТ Из МассивСНТ Цикл
		ОбъектСНТ.ДоговорПоставки = Неопределено;
	КонецЦикла;
	
	// Сформировать пустые параметры поиска договоров поставки.
	ИменаРеквизитов = "Владелец, Организация, НомерДоговора, ДатаДоговора";
	ОбъектМетаданных = Метаданные.Справочники.ДоговорыКонтрагентов;
	ПараметрыПоискаДоговоровПоставки = ЭСФСервер.НовыеПараметрыПоискаСсылок(ИменаРеквизитов, ОбъектМетаданных);
	
	// Заполнить параметры поиска договоров поставки.
	Для Каждого ОбъектСНТ Из МассивСНТ Цикл
		
		//ИмяТаблицыКонтрагентов = ЭСФВызовСервераПовтИсп.ИмяТаблицыКонтрагентов(ОбъектЭСФ.Направление);	
		ИмяРеквизитаКонтрагента = СНТВызовСервераПовтИсп.ИмяРеквизитаКонтрагента(ОбъектСНТ.Направление);
		Контрагент = ОбъектСНТ[ИмяРеквизитаКонтрагента];
		
		Если ЗначениеЗаполнено(Контрагент)
			И ЗначениеЗаполнено(ОбъектСНТ.Организация)
			И ЗначениеЗаполнено(ОбъектСНТ.ДоговорПоставкиНомер) 
			И ЗначениеЗаполнено(ОбъектСНТ.ДоговорПоставкиДата) Тогда
			
			ПараметрыПоиска = Новый Структура;
			ПараметрыПоиска.Вставить("Владелец", Контрагент);
			ПараметрыПоиска.Вставить("Организация", ОбъектСНТ.Организация);
			ПараметрыПоиска.Вставить("НомерДоговора", ОбъектСНТ.ДоговорПоставкиНомер);
			ПараметрыПоиска.Вставить("ДатаДоговора", ОбъектСНТ.ДоговорПоставкиДата);
			
			МассивНайденныхСтрок = ПараметрыПоискаДоговоровПоставки.НайтиСтроки(ПараметрыПоиска);
			
			Если МассивНайденныхСтрок.Количество() = 0 Тогда	
				СтрокаПараметровПоиска = ПараметрыПоискаДоговоровПоставки.Добавить();
				СтрокаПараметровПоиска.Владелец = Контрагент;
				СтрокаПараметровПоиска.Организация = ОбъектСНТ.Организация;
				СтрокаПараметровПоиска.НомерДоговора = СокрЛП(ОбъектСНТ.ДоговорПоставкиНомер);
				СтрокаПараметровПоиска.ДатаДоговора = СокрЛП(ОбъектСНТ.ДоговорПоставкиДата);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Найти договора поставки.
	НайденныеСсылки = НайтиСсылкиПоЗначениямРеквизитов(ПараметрыПоискаДоговоровПоставки, ОбъектМетаданных);
	
	// Заполнить договоры поставки в МассивЭСФ.
	Для Каждого ОбъектСНТ Из МассивСНТ Цикл
		
		//ИмяТаблицыКонтрагентов = ЭСФВызовСервераПовтИсп.ИмяТаблицыКонтрагентов(ОбъектСНТ.Направление);	
		ИмяРеквизитаКонтрагента = СНТВызовСервераПовтИсп.ИмяРеквизитаКонтрагента(ОбъектСНТ.Направление);
		Контрагент = ОбъектСНТ[ИмяРеквизитаКонтрагента];
		
		Если ЗначениеЗаполнено(Контрагент)
			И ЗначениеЗаполнено(ОбъектСНТ.Организация)
			И ЗначениеЗаполнено(ОбъектСНТ.ДоговорПоставкиНомер) 
			И ЗначениеЗаполнено(ОбъектСНТ.ДоговорПоставкиДата) Тогда
			
			ПараметрыПоиска = Новый Структура;
			ПараметрыПоиска.Вставить("Владелец", Контрагент);
			ПараметрыПоиска.Вставить("Организация", ОбъектСНТ.Организация);
			ПараметрыПоиска.Вставить("НомерДоговора", ОбъектСНТ.ДоговорПоставкиНомер);
			ПараметрыПоиска.Вставить("ДатаДоговора", ОбъектСНТ.ДоговорПоставкиДата);
			
			МассивНайденныхСтрок = НайденныеСсылки.НайтиСтроки(ПараметрыПоиска);
			
			Если МассивНайденныхСтрок.Количество() = 1 Тогда
				ОбъектСНТ.ДоговорПоставки = МассивНайденныхСтрок[0].НайденнаяСсылка;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция НайтиСсылкиПоЗначениямРеквизитов(Знач ЗначенияРеквизитов, Знач ОбъектМетаданных, Знач ИдентификационныйНомер = Неопределено)
	
	ПолноеИмяОбъекта = ОбъектМетаданных.ПолноеИмя();
	ИмяВидаОбъекта = Лев(ПолноеИмяОбъекта, Найти(ПолноеИмяОбъекта, ".") - 1); // "Документ", "Справочник" и т.д.
	ИмяОбъекта = ОбъектМетаданных.Имя;
	
	// Сформировать массив имен реквизитов.
	МассивИменРеквизитов = Новый Массив;
	Для Каждого Колонка Из ЗначенияРеквизитов.Колонки Цикл
		МассивИменРеквизитов.Добавить(Колонка.Имя);	
	КонецЦикла;
	
	// Подготовить строку запроса %ИменаРеквизитов%.
	ИменаРеквизитов = "";
	Для Каждого ИмяРеквизита Из МассивИменРеквизитов Цикл
		ИменаРеквизитов = ИменаРеквизитов + "ЗначенияРеквизитов." + ИмяРеквизита + ", ";	
	КонецЦикла;
	Если Прав(ИменаРеквизитов, 2) = ", " Тогда
		ИменаРеквизитов = Сред(ИменаРеквизитов, 1, СтрДлина(ИменаРеквизитов) - 2);	
	КонецЕсли;
	
	// Подготовить строку запроса %УсловияСоединения%.
	УсловияСоединения = "";
	Для Каждого ИмяРеквизита Из МассивИменРеквизитов Цикл
		Условие = "(ЗначенияРеквизитов.%ИмяРеквизита% = %ИмяОбъекта%.%ИмяРеквизита%)";
		
		Если ИмяРеквизита = "Дата" Тогда
			Условие = "(ЗначенияРеквизитов.%ИмяРеквизита% = НАЧАЛОПЕРИОДА(%ИмяОбъекта%.%ИмяРеквизита%, День))";
		Иначе
			Условие = "(ЗначенияРеквизитов.%ИмяРеквизита% = %ИмяОбъекта%.%ИмяРеквизита%)";
		КонецЕсли;	
		
		Условие = СтрЗаменить(Условие, "%ИмяОбъекта%", ИмяОбъекта);
		Условие = СтрЗаменить(Условие, "%ИмяРеквизита%", ИмяРеквизита);
		УсловияСоединения = УсловияСоединения + Условие + " И ";	
	КонецЦикла;	
	Если Прав(УсловияСоединения, 3) = " И " Тогда
		УсловияСоединения = Сред(УсловияСоединения, 1, СтрДлина(УсловияСоединения) - 3);	
	КонецЕсли;
	
	// Сформировать текст запроса.
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	%ИменаРеквизитов%
	|ПОМЕСТИТЬ ЗначенияРеквизитов
	|ИЗ
	|	&ЗначенияРеквизитов КАК ЗначенияРеквизитов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	%ИменаРеквизитов%,
	|	ЕСТЬNULL(%ИмяОбъекта%.Ссылка, ЗНАЧЕНИЕ(%ИмяВидаОбъекта%.%ИмяОбъекта%.ПустаяСсылка)) КАК НайденнаяСсылка
	|ИЗ
	|	ЗначенияРеквизитов КАК ЗначенияРеквизитов
	|		ЛЕВОЕ СОЕДИНЕНИЕ %ИмяВидаОбъекта%.%ИмяОбъекта% КАК %ИмяОбъекта%
	|		ПО (%УсловияСоединения%)";	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ИменаРеквизитов%",   ИменаРеквизитов);	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "%УсловияСоединения%", УсловияСоединения);	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ИмяОбъекта%",        ИмяОбъекта);	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ИмяВидаОбъекта%",    ИмяВидаОбъекта);	
	Запрос.УстановитьПараметр("ЗначенияРеквизитов", ЗначенияРеквизитов);
	
	РезультатПоиска = Запрос.Выполнить().Выгрузить();
	
	
	
	//////////////////////////////////////////////////////////////////////////////
	// Удалить из результатов поиска документы СНТ, которые не принадлежат указанной структурной единице.
	// Работает только для документов СНТ, для остальных объектов переменная ОтборПоСтруктурнойЕдинице должна быть Неопределено.
	
	Если ИдентификационныйНомер <> Неопределено Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СНТ.Ссылка
		|ИЗ
		|	Документ.СНТ КАК СНТ
		|ГДЕ
		|	СНТ.Направление = &Исходящий
		|	И СНТ.Ссылка В(&МассивСНТ)
		|	И (СНТ.ПоставщикИдентификатор = &ИдентификационныйНомер
		|			ИЛИ СНТ.ПоставщикБИНСтруктурногоПодразделения = &ИдентификационныйНомер)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СНТ.Ссылка
		|ИЗ
		|	Документ.СНТ КАК СНТ
		|ГДЕ
		|	СНТ.Направление = &Входящий
		|	И СНТ.Ссылка В(&МассивСНТ)
		|	И (СНТ.ПолучательИдентификатор = &ИдентификационныйНомер
		|			ИЛИ СНТ.ПолучательБИНСтруктурногоПодразделения = &ИдентификационныйНомер)";
		
		
		Запрос.УстановитьПараметр("МассивСНТ", РезультатПоиска.ВыгрузитьКолонку("НайденнаяСсылка"));
		Запрос.УстановитьПараметр("Исходящий", Перечисления.НаправленияСНТ.Исходящий);
		Запрос.УстановитьПараметр("Входящий", Перечисления.НаправленияСНТ.Входящий);
		Запрос.УстановитьПараметр("ИдентификационныйНомер", ИдентификационныйНомер);
		
		ТаблицаСНТПринадлежащихСтруктурнойЕдинице = Запрос.Выполнить().Выгрузить();
		МассивСНТПринадлежащихСтруктурнойЕдинице = ТаблицаСНТПринадлежащихСтруктурнойЕдинице.ВыгрузитьКолонку("Ссылка");
		
		// Удалить из результатов поиска документы СНТ, которые не принадлежат указанной структурной единице.			
		Для Каждого СтрокаРезультата Из РезультатПоиска Цикл				
			Если МассивСНТПринадлежащихСтруктурнойЕдинице.Найти(СтрокаРезультата.НайденнаяСсылка) = Неопределено Тогда						
				
				// Если Истина, значит СНТ не принадлежит указанной структурной единице,
				// поэтому ссылку на данный СНТ нужно очистить.
				СтрокаРезультата.НайденнаяСсылка = Документы.СНТ.ПустаяСсылка();
				
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат РезультатПоиска;
	
КонецФункции

// Возвращает номер документа на печать.
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.<Имя> - Ссылка на документ, для которого необходимо получить номер на печать.
//
// Возвращаемое значение:
//  Строка - Номер документа, который может использоваться для печати.
//
Функция ПолучитьНомерНаПечать(ДокументСсылка) Экспорт
	
	Если ДокументСсылка.Направление = ПредопределенноеЗначение("Перечисление.НаправленияСНТ.Исходящий") Тогда
		Если СтрНайти(ДокументСсылка.Номер,"-И-") > 0 Тогда
			Возврат ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(СтрЗаменить(ДокументСсылка.Номер,"-И-",""), ДокументСсылка, , Истина, Истина);
		Иначе
			Возврат ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(ДокументСсылка.Номер, ДокументСсылка, , Истина, Истина);
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьКодСтраныСНТ(Страна) Экспорт
	Возврат Страна.КодАльфа2;
КонецФункции

Функция ТекстЗапросаЗаполненияСпискаКонтрагентов() Экспорт

	Возврат "ВЫБРАТЬ
	|	Контрагенты.%КонтрагентИНН КАК ИдентификационныйКодЛичности,
	|	Контрагенты.Ссылка КАК Контрагент
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.ЭтоГруппа = ЛОЖЬ
	|	И Контрагенты.%КонтрагентИНН <> """"
	|	И НЕ Контрагенты.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Контрагенты.Наименование";

КонецФункции  

Функция ПолучитьОбъектМетаданныхДокументЗаявлениеОВвозеТоваров() Экспорт
	
	Возврат Метаданные.НайтиПоПолномуИмени("Документ.ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалогов");
	
КонецФункции

Функция ТабличныеЧастиДокументаСопоставлениеСНТиФНО()
	
	ТабличныеЧасти = Новый Структура;
	ТабличныеЧасти.Вставить("ФНО", НСтр("ru='Список ФНО'"));
	ТабличныеЧасти.Вставить("СНТ", НСтр("ru='Список СНТ'"));
	ТабличныеЧасти.Вставить("ТоварыФНО", НСтр("ru='Товары из ФНО'"));
	ТабличныеЧасти.Вставить("ТоварыСНТ", НСтр("ru='Товары из СНТ'"));
	
	Возврат ТабличныеЧасти;
	
КонецФункции

Процедура ПроверитьТабличнуюЧастьДокументСопоставлениеСНТиФНО(Объект, ИмяТабличнойЧасти, ИмяРеквизита, Организация, СтруктураТабличныхЧастей, Отказ)
	
	МассивДокументов = Объект[ИмяТабличнойЧасти].ВыгрузитьКолонку(ИмяРеквизита);
	
	СоответствиеОрганизаций = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(МассивДокументов, "Организация");
	
	МассивДублирующихсяДокументов = Новый Массив;
	
	Для Каждого Строка Из Объект[ИмяТабличнойЧасти] Цикл
		
		ПараметрыОтбора = Новый Структура;
		ТекущееЗначениеРеквизита = Строка[ИмяРеквизита];
		ПараметрыОтбора.Вставить(ИмяРеквизита, ТекущееЗначениеРеквизита);
		
		МассивСтрок = Объект[ИмяТабличнойЧасти].НайтиСтроки(ПараметрыОтбора);
		
		Если МассивСтрок.Количество() > 1 И МассивДублирующихсяДокументов.Найти(ТекущееЗначениеРеквизита) = Неопределено Тогда
			
			ТекстСообщения = СНТКлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'В табличной части ""%1"" в строке ""%2"" документ ""%3"" уже присутствует в данной табличной части'"),
				СтруктураТабличныхЧастей[ИмяТабличнойЧасти],
				Формат(МассивСтрок[0].НомерСтроки, "ЧН=0; ЧГ="),
				МассивСтрок[0][ИмяРеквизита]);
				
			Поле = ИмяТабличнойЧасти + "[" + Формат(МассивСтрок[0].НомерСтроки - 1, "ЧН=0; ЧГ=") + "]."+ ИмяРеквизита;
			ЭСФКлиентСерверПереопределяемый.СообщитьПользователю(ТекстСообщения, Объект, Поле, "Объект", Отказ);
			
			МассивДублирующихсяДокументов.Добавить(ТекущееЗначениеРеквизита);
			
		КонецЕсли;
		
		
	КонецЦикла;
	
	Для Каждого Элемент Из СоответствиеОрганизаций Цикл
		
		Если Элемент.Значение.Организация <> Организация Тогда
			
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить(ИмяРеквизита,Элемент.Ключ);
			
			МассивСтрок = Объект[ИмяТабличнойЧасти].НайтиСтроки(ПараметрыОтбора);
			
			ТекстСообщения = СНТКлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'В табличной части ""%1"" значение организации документа ""%2"" в строке ""%3"" отлично от организации документа сопоставления'"),
				СтруктураТабличныхЧастей[ИмяТабличнойЧасти],
				Элемент.Ключ,
				Формат(МассивСтрок[0].НомерСтроки, "ЧН=0; ЧГ="));
				
			Поле = ИмяТабличнойЧасти + "[" + Формат(МассивСтрок[0].НомерСтроки - 1, "ЧН=0; ЧГ=") + "]."+ ИмяРеквизита;
			ЭСФКлиентСерверПереопределяемый.СообщитьПользователю(ТекстСообщения, Объект, Поле, "Объект", Отказ);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьСоответствиеРеквизитовТоваровВТабличныхЧастяхДокументаСопоставлениеСНТиФНО(Объект, СтруктураТабличныхЧастей, Отказ)
	
	Для Каждого СтрокаТоварыСНТ Из Объект.ТоварыСНТ Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаТоварыСНТ.НомерЗаявленияВРамкахТС)
			 ИЛИ Не ЗначениеЗаполнено(СтрокаТоварыСНТ.НомерПозицииВЗаявлении) Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураОтбора = Новый Структура("РегистрационныйНомер", СтрокаТоварыСНТ.НомерЗаявленияВРамкахТС);
		
		МассивСтрокФНО = Объект.ФНО.НайтиСтроки(СтруктураОтбора);
		
		Если МассивСтрокФНО.Количество() = 0 Тогда
			
			ТекстСообщения = СНТКлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'В табличной части ""%1"" в строке ""%2"" реквизит ""№ заявления в рамках ТС, Декларации на товары или первичной СНТ, СТ-1 или СТ-KZ"" отсутствует в табличной части ""%3""'"),
				СтруктураТабличныхЧастей.ТоварыСНТ,
				Формат(СтрокаТоварыСНТ.НомерСтроки, "ЧН=0; ЧГ="),
				СтруктураТабличныхЧастей.ФНО);
				
			Поле = "ТоварыСНТ[" + Формат(СтрокаТоварыСНТ.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].НомерЗаявленияВРамкахТС";
			ЭСФКлиентСерверПереопределяемый.СообщитьПользователю(ТекстСообщения, Объект, Поле, "Объект", Отказ);
			
		Иначе
			
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("НомерРазделаФНО", МассивСтрокФНО[0].НомерСтроки);
			СтруктураОтбора.Вставить("НомерПозицииВЗаявлении", СтрокаТоварыСНТ.НомерПозицииВЗаявлении);
			
			МассивСтрокТоварыФНО = Объект.ТоварыФНО.НайтиСтроки(СтруктураОтбора);
			
			Если МассивСтрокТоварыФНО.Количество() = 0 Тогда
				
				ТекстСообщения = СНТКлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'В табличной части ""%1"" в строке ""%2"" реквизит ""Номер товарной позиции из заявления"" отсутствует в табличной части ""%3""'"),
					СтруктураТабличныхЧастей.ТоварыСНТ,
					Формат(СтрокаТоварыСНТ.НомерСтроки, "ЧН=0; ЧГ="),
					СтруктураТабличныхЧастей.ТоварыФНО);
				
				Поле = "ТоварыСНТ[" + Формат(СтрокаТоварыСНТ.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].НомерПозицииВЗаявлении";
				ЭСФКлиентСерверПереопределяемый.СообщитьПользователю(ТекстСообщения, Объект, Поле, "Объект", Отказ);
				
			КонецЕсли;
			
		КонецЕсли;
		
		
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьДанныеДляЗаполненияДополнительнойИнформацииТоварыЭкспортныйКонтроль(МассивТоваров) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Номенклатура.Ссылка КАК Ссылка,
		|	Номенклатура.Комментарий КАК Комментарий
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка В(&МассивСсылок)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОсновныеСредства.Ссылка,
		|	ОсновныеСредства.Комментарий
		|ИЗ
		|	Справочник.ОсновныеСредства КАК ОсновныеСредства
		|ГДЕ
		|	ОсновныеСредства.Ссылка В(&МассивСсылок)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НематериальныеАктивы.Ссылка,
		|	НематериальныеАктивы.ПрочиеСведения
		|ИЗ
		|	Справочник.НематериальныеАктивы КАК НематериальныеАктивы";
	
	Запрос.УстановитьПараметр("МассивСсылок", МассивТоваров);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СоответствиеДополнительнойИнформации = Новый Соответствие;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СоответствиеДополнительнойИнформации.Вставить(ВыборкаДетальныеЗаписи.Ссылка,ВыборкаДетальныеЗаписи.Комментарий);
	КонецЦикла;
	
	Возврат СоответствиеДополнительнойИнформации;
	
КонецФункции

#КонецОбласти

#Область СопоставлениеСНТиФНО

Функция ПолучитьИдентификаторОрганизации(Организация) Экспорт
	
	Возврат Организация.ИдентификационныйНомер;

КонецФункции

Функция ПолучитьДанныеТЧИзФНО(ДокументФНО) Экспорт
	
	ДанныеДокументаФНО = Новый Массив();
	
	// Заполнение по данным ТЧ Товары 
	Для Каждого СтрокаТовар Из ДокументФНО.Товары Цикл
		
		КодЕдиницыИзмерения = ВССерверПереопределяемый.ПолучитьКодЕдиницыИзмерения(СтрокаТовар.ЕдиницаИзмерения, СтрокаТовар.Номенклатура);
		
		//Наименование товара обрабатываем аналогично выгрузке в 328 форму
		ДанныеНоменклатуры = ЭСФСерверПереопределяемый.ЗначенияРеквизитовОбъекта(СтрокаТовар.Номенклатура, "Наименование, НаименованиеПолное");
		Если ЗначениеЗаполнено(СокрЛП(СтрокаТовар.НаименованиеТовара)) Тогда
			НаименованиеТовараПо328 = СокрЛП(СтрокаТовар.НаименованиеТовара);
		ИначеЕсли ЗначениеЗаполнено(ДанныеНоменклатуры.НаименованиеПолное) Тогда
			НаименованиеТовараПо328 = ДанныеНоменклатуры.НаименованиеПолное;
		Иначе
			НаименованиеТовараПо328 = ДанныеНоменклатуры.Наименование;
		КонецЕсли;
		
		ДанныеСтрокиТовары = Новый Структура();
		ДанныеСтрокиТовары.Вставить("Товар", 				  СтрокаТовар.Номенклатура);
		ДанныеСтрокиТовары.Вставить("ТоварНаименование", 	  НаименованиеТовараПо328);
		ДанныеСтрокиТовары.Вставить("КодТНВЭД", 			  СтрокаТовар.КодТНВЭД);
		ДанныеСтрокиТовары.Вставить("ЕдиницаИзмерения", 	  СтрокаТовар.ЕдиницаИзмерения);
		ДанныеСтрокиТовары.Вставить("ЕдиницаИзмеренияКод", 	  КодЕдиницыИзмерения);
		ДанныеСтрокиТовары.Вставить("Количество", 			  СтрокаТовар.Количество);
		ДанныеСтрокиТовары.Вставить("Цена", 				  СтрокаТовар.Цена);
		ДанныеСтрокиТовары.Вставить("НомерПозицииВЗаявлении", СтрокаТовар.НомерСтроки);
		
		ДанныеДокументаФНО.Добавить(ДанныеСтрокиТовары);
		
	КонецЦикла;
	
	Возврат ДанныеДокументаФНО;
	
КонецФункции

Функция ПолучитьДанныеТЧИзСНТ(ДокументСНТ) Экспорт
	
	ДанныеДокументаСНТ = Новый Массив();
	
	// Заполнение по данным ТЧ Товары ВС (Разздел G1)
	Для Каждого СтрокаТовар Из ДокументСНТ.ТоварыВС Цикл
		
		КодЕдиницыИзмерения = ВССерверПереопределяемый.ПолучитьКодЕдиницыИзмерения(СтрокаТовар.ЕдиницаИзмерения, СтрокаТовар.Товар);
		
		ДанныеСтрокиТовары = Новый Структура();
		ДанныеСтрокиТовары.Вставить("Товар", 			   СтрокаТовар.Товар);
		ДанныеСтрокиТовары.Вставить("ТоварНаименование",   СтрокаТовар.ТоварНаименование);
		ДанныеСтрокиТовары.Вставить("КодТНВЭД", 		   СтрокаТовар.КодТНВЭД);
		ДанныеСтрокиТовары.Вставить("ЕдиницаИзмерения",    СтрокаТовар.ЕдиницаИзмерения);
		ДанныеСтрокиТовары.Вставить("ЕдиницаИзмеренияКод", КодЕдиницыИзмерения);
		ДанныеСтрокиТовары.Вставить("Количество", 		   СтрокаТовар.Количество);
		ДанныеСтрокиТовары.Вставить("Цена", 			   СтрокаТовар.Цена);
		ДанныеСтрокиТовары.Вставить("НомерСтрокиВСНТ",	   "1/" + СтрокаТовар.НомерСтроки); //Формат номера "НомерТабличнойЧасти/НомерСтроки"
		ДанныеСтрокиТовары.Вставить("ИсточникПроисхождения",СтрокаТовар.ИсточникПроисхождения); //Формат номера "НомерТабличнойЧасти/НомерСтроки"
		
		ДанныеДокументаСНТ.Добавить(ДанныеСтрокиТовары);
		
	КонецЦикла;
	
		// Заполнение по данным ТЧ ЭтиловыйСпирт (Разздел G2)
	Для Каждого СтрокаТовар Из ДокументСНТ.ЭтиловыйСпирт Цикл
		
		КодЕдиницыИзмерения = ВССерверПереопределяемый.ПолучитьКодЕдиницыИзмерения(СтрокаТовар.ЕдиницаИзмерения, СтрокаТовар.Товар);
		
		ДанныеСтрокиТовары = Новый Структура();
		ДанныеСтрокиТовары.Вставить("Товар", 			   СтрокаТовар.Товар);
		ДанныеСтрокиТовары.Вставить("ТоварНаименование",   СтрокаТовар.ТоварНаименование);
		ДанныеСтрокиТовары.Вставить("КодТНВЭД", 		   СтрокаТовар.КодТНВЭД);
		ДанныеСтрокиТовары.Вставить("ЕдиницаИзмерения",    СтрокаТовар.ЕдиницаИзмерения);
		ДанныеСтрокиТовары.Вставить("ЕдиницаИзмеренияКод", КодЕдиницыИзмерения);
		ДанныеСтрокиТовары.Вставить("Количество", 		   СтрокаТовар.Количество);
		ДанныеСтрокиТовары.Вставить("Цена", 			   СтрокаТовар.Цена);
		ДанныеСтрокиТовары.Вставить("НомерСтрокиВСНТ",	   "2/" + СтрокаТовар.НомерСтроки); //Формат номера "НомерТабличнойЧасти/НомерСтроки"
		ДанныеСтрокиТовары.Вставить("ИсточникПроисхождения",СтрокаТовар.ИсточникПроисхождения); //Формат номера "НомерТабличнойЧасти/НомерСтроки"
		
		ДанныеДокументаСНТ.Добавить(ДанныеСтрокиТовары);
		
	КонецЦикла;

	// Заполнение по данным ТЧ Виноматериал (Разздел G3)
	Для Каждого СтрокаТовар Из ДокументСНТ.Виноматериал Цикл
		
		КодЕдиницыИзмерения = ВССерверПереопределяемый.ПолучитьКодЕдиницыИзмерения(СтрокаТовар.ЕдиницаИзмерения, СтрокаТовар.Товар);
		
		ДанныеСтрокиТовары = Новый Структура();
		ДанныеСтрокиТовары.Вставить("Товар", 			   СтрокаТовар.Товар);
		ДанныеСтрокиТовары.Вставить("ТоварНаименование",   СтрокаТовар.ТоварНаименование);
		ДанныеСтрокиТовары.Вставить("КодТНВЭД", 		   СтрокаТовар.КодТНВЭД);
		ДанныеСтрокиТовары.Вставить("ЕдиницаИзмерения",    СтрокаТовар.ЕдиницаИзмерения);
		ДанныеСтрокиТовары.Вставить("ЕдиницаИзмеренияКод", КодЕдиницыИзмерения);
		ДанныеСтрокиТовары.Вставить("Количество", 		   СтрокаТовар.Количество);
		ДанныеСтрокиТовары.Вставить("Цена", 			   СтрокаТовар.Цена);
		ДанныеСтрокиТовары.Вставить("НомерСтрокиВСНТ",	   "3/" + СтрокаТовар.НомерСтроки); //Формат номера "НомерТабличнойЧасти/НомерСтроки"
		ДанныеСтрокиТовары.Вставить("ИсточникПроисхождения",СтрокаТовар.ИсточникПроисхождения); //Формат номера "НомерТабличнойЧасти/НомерСтроки"
		
		ДанныеДокументаСНТ.Добавить(ДанныеСтрокиТовары);
		
	КонецЦикла;
	
	// Заполнение по данным ТЧ ПивоПивныеНапитки (Разздел G4)
	Для Каждого СтрокаТовар Из ДокументСНТ.ПивоПивныеНапитки Цикл
		
		КодЕдиницыИзмерения = ВССерверПереопределяемый.ПолучитьКодЕдиницыИзмерения(СтрокаТовар.ЕдиницаИзмерения, СтрокаТовар.Товар);
		
		ДанныеСтрокиТовары = Новый Структура();
		ДанныеСтрокиТовары.Вставить("Товар", 			   СтрокаТовар.Товар);
		ДанныеСтрокиТовары.Вставить("ТоварНаименование",   СтрокаТовар.ТоварНаименование);
		ДанныеСтрокиТовары.Вставить("КодТНВЭД", 		   СтрокаТовар.КодТНВЭД);
		ДанныеСтрокиТовары.Вставить("ЕдиницаИзмерения",    СтрокаТовар.ЕдиницаИзмерения);
		ДанныеСтрокиТовары.Вставить("ЕдиницаИзмеренияКод", КодЕдиницыИзмерения);
		ДанныеСтрокиТовары.Вставить("Количество", 		   СтрокаТовар.КоличествоУпаковок);
		ДанныеСтрокиТовары.Вставить("Цена", 			   СтрокаТовар.Цена);
		ДанныеСтрокиТовары.Вставить("НомерСтрокиВСНТ",	   "4/" + СтрокаТовар.НомерСтроки); //Формат номера "НомерТабличнойЧасти/НомерСтроки"
		ДанныеСтрокиТовары.Вставить("ИсточникПроисхождения",СтрокаТовар.ИсточникПроисхождения); //Формат номера "НомерТабличнойЧасти/НомерСтроки"
		
		ДанныеДокументаСНТ.Добавить(ДанныеСтрокиТовары);
		
	КонецЦикла;
	
	// Заполнение по данным ТЧ АлкогольнаяПродукцияКромеПива (Разздел G5)
	Для Каждого СтрокаТовар Из ДокументСНТ.АлкогольнаяПродукцияКромеПива Цикл
		
		КодЕдиницыИзмерения = ВССерверПереопределяемый.ПолучитьКодЕдиницыИзмерения(СтрокаТовар.ЕдиницаИзмерения, СтрокаТовар.Товар);
		
		ДанныеСтрокиТовары = Новый Структура();
		ДанныеСтрокиТовары.Вставить("Товар", 			   СтрокаТовар.Товар);
		ДанныеСтрокиТовары.Вставить("ТоварНаименование",   СтрокаТовар.ТоварНаименование);
		ДанныеСтрокиТовары.Вставить("КодТНВЭД", 		   СтрокаТовар.КодТНВЭД);
		ДанныеСтрокиТовары.Вставить("ЕдиницаИзмерения",    СтрокаТовар.ЕдиницаИзмерения);
		ДанныеСтрокиТовары.Вставить("ЕдиницаИзмеренияКод", КодЕдиницыИзмерения);
		ДанныеСтрокиТовары.Вставить("Количество", 		   СтрокаТовар.КоличествоБутылок);
		ДанныеСтрокиТовары.Вставить("Цена", 			   СтрокаТовар.Цена);
		ДанныеСтрокиТовары.Вставить("НомерСтрокиВСНТ",	   "5/" + СтрокаТовар.НомерСтроки); //Формат номера "НомерТабличнойЧасти/НомерСтроки"
		ДанныеСтрокиТовары.Вставить("ИсточникПроисхождения",СтрокаТовар.ИсточникПроисхождения); //Формат номера "НомерТабличнойЧасти/НомерСтроки"
		
		ДанныеДокументаСНТ.Добавить(ДанныеСтрокиТовары);
		
	КонецЦикла;
	
	// Заполнение по данным ТЧ ДанныеПоНефтепродуктам (Разздел G6)
	Для Каждого СтрокаТовар Из ДокументСНТ.ДанныеПоНефтепродуктам Цикл
		
		КодЕдиницыИзмерения = ВССерверПереопределяемый.ПолучитьКодЕдиницыИзмерения(СтрокаТовар.ЕдиницаИзмерения, СтрокаТовар.Товар);
		
		ДанныеСтрокиТовары = Новый Структура();
		ДанныеСтрокиТовары.Вставить("Товар", 			   СтрокаТовар.Товар);
		ДанныеСтрокиТовары.Вставить("ТоварНаименование",   СтрокаТовар.ТоварНаименование);
		ДанныеСтрокиТовары.Вставить("КодТНВЭД", 		   СтрокаТовар.КодТНВЭД);
		ДанныеСтрокиТовары.Вставить("ЕдиницаИзмерения",    СтрокаТовар.ЕдиницаИзмерения);
		ДанныеСтрокиТовары.Вставить("ЕдиницаИзмеренияКод", КодЕдиницыИзмерения);
		ДанныеСтрокиТовары.Вставить("Количество", 		   СтрокаТовар.Количество);
		ДанныеСтрокиТовары.Вставить("Цена", 			   СтрокаТовар.Цена);
		ДанныеСтрокиТовары.Вставить("НомерСтрокиВСНТ",	   "6/" + СтрокаТовар.НомерСтроки); //Формат номера "НомерТабличнойЧасти/НомерСтроки"
		ДанныеСтрокиТовары.Вставить("ИсточникПроисхождения",СтрокаТовар.ИсточникПроисхождения); //Формат номера "НомерТабличнойЧасти/НомерСтроки"
		
		ДанныеДокументаСНТ.Добавить(ДанныеСтрокиТовары);
		
	КонецЦикла;

	// Заполнение по данным ТЧ ДанныеПоБиотопливу (Разздел G7)
	Для Каждого СтрокаТовар Из ДокументСНТ.ДанныеПоБиотопливу Цикл
		
		КодЕдиницыИзмерения = ВССерверПереопределяемый.ПолучитьКодЕдиницыИзмерения(СтрокаТовар.ЕдиницаИзмерения, СтрокаТовар.Товар);
		
		ДанныеСтрокиТовары = Новый Структура();
		ДанныеСтрокиТовары.Вставить("Товар", 			   СтрокаТовар.Товар);
		ДанныеСтрокиТовары.Вставить("ТоварНаименование",   СтрокаТовар.ТоварНаименование);
		ДанныеСтрокиТовары.Вставить("КодТНВЭД", 		   СтрокаТовар.КодТНВЭД);
		ДанныеСтрокиТовары.Вставить("ЕдиницаИзмерения",    СтрокаТовар.ЕдиницаИзмерения);
		ДанныеСтрокиТовары.Вставить("ЕдиницаИзмеренияКод", КодЕдиницыИзмерения);
		ДанныеСтрокиТовары.Вставить("Количество", 		   СтрокаТовар.Количество);
		ДанныеСтрокиТовары.Вставить("Цена", 			   СтрокаТовар.Цена);
		ДанныеСтрокиТовары.Вставить("НомерСтрокиВСНТ",	   "7/" + СтрокаТовар.НомерСтроки); //Формат номера "НомерТабличнойЧасти/НомерСтроки"
		ДанныеСтрокиТовары.Вставить("ИсточникПроисхождения",СтрокаТовар.ИсточникПроисхождения); //Формат номера "НомерТабличнойЧасти/НомерСтроки"
		
		ДанныеДокументаСНТ.Добавить(ДанныеСтрокиТовары);
		
	КонецЦикла;

	// Заполнение по данным ТЧ ТабачнаяПродукция (Разздел G8)
	Для Каждого СтрокаТовар Из ДокументСНТ.ТабачнаяПродукция Цикл
		
		КодЕдиницыИзмерения = ВССерверПереопределяемый.ПолучитьКодЕдиницыИзмерения(СтрокаТовар.ЕдиницаИзмерения, СтрокаТовар.Товар);
		
		ДанныеСтрокиТовары = Новый Структура();
		ДанныеСтрокиТовары.Вставить("Товар", 			   СтрокаТовар.Товар);
		ДанныеСтрокиТовары.Вставить("ТоварНаименование",   СтрокаТовар.ТоварНаименование);
		ДанныеСтрокиТовары.Вставить("КодТНВЭД", 		   СтрокаТовар.КодТНВЭД);
		ДанныеСтрокиТовары.Вставить("ЕдиницаИзмерения",    СтрокаТовар.ЕдиницаИзмерения);
		ДанныеСтрокиТовары.Вставить("ЕдиницаИзмеренияКод", КодЕдиницыИзмерения);
		ДанныеСтрокиТовары.Вставить("Количество", 		   СтрокаТовар.КоличествоПачек);
		ДанныеСтрокиТовары.Вставить("Цена", 			   СтрокаТовар.Цена);
		ДанныеСтрокиТовары.Вставить("НомерСтрокиВСНТ",	   "8/" + СтрокаТовар.НомерСтроки); //Формат номера "НомерТабличнойЧасти/НомерСтроки"
		ДанныеСтрокиТовары.Вставить("ИсточникПроисхождения",СтрокаТовар.ИсточникПроисхождения); //Формат номера "НомерТабличнойЧасти/НомерСтроки"
		
		ДанныеДокументаСНТ.Добавить(ДанныеСтрокиТовары);
		
	КонецЦикла;
	
	// Заполнение по данным ТЧ ДругиеТоварыЦифроваяМаркировка (Разздел G9)
	Для Каждого СтрокаТовар Из ДокументСНТ.ДругиеТоварыЦифроваяМаркировка Цикл
		
		КодЕдиницыИзмерения = ВССерверПереопределяемый.ПолучитьКодЕдиницыИзмерения(СтрокаТовар.ЕдиницаИзмерения, СтрокаТовар.Товар);
		
		ДанныеСтрокиТовары = Новый Структура();
		ДанныеСтрокиТовары.Вставить("Товар", 			   СтрокаТовар.Товар);
		ДанныеСтрокиТовары.Вставить("ТоварНаименование",   СтрокаТовар.ТоварНаименование);
		ДанныеСтрокиТовары.Вставить("КодТНВЭД", 		   СтрокаТовар.КодТНВЭД);
		ДанныеСтрокиТовары.Вставить("ЕдиницаИзмерения",    СтрокаТовар.ЕдиницаИзмерения);
		ДанныеСтрокиТовары.Вставить("ЕдиницаИзмеренияКод", КодЕдиницыИзмерения);
		ДанныеСтрокиТовары.Вставить("Количество", 		   СтрокаТовар.Количество);
		ДанныеСтрокиТовары.Вставить("Цена", 			   СтрокаТовар.Цена);
		ДанныеСтрокиТовары.Вставить("НомерСтрокиВСНТ",	   "9/" + СтрокаТовар.НомерСтроки); //Формат номера "НомерТабличнойЧасти/НомерСтроки"
		ДанныеСтрокиТовары.Вставить("ИсточникПроисхождения",СтрокаТовар.ИсточникПроисхождения); //Формат номера "НомерТабличнойЧасти/НомерСтроки"
		
		ДанныеДокументаСНТ.Добавить(ДанныеСтрокиТовары);
		
	КонецЦикла;
	
	// Заполнение по данным ТЧ ТоварыЭкспортныйКонтроль (Разздел G10)
	Для Каждого СтрокаТовар Из ДокументСНТ.ТоварыЭкспортныйКонтроль Цикл
		
		КодЕдиницыИзмерения = ВССерверПереопределяемый.ПолучитьКодЕдиницыИзмерения(СтрокаТовар.ЕдиницаИзмерения, СтрокаТовар.Товар);
		
		ДанныеСтрокиТовары = Новый Структура();
		ДанныеСтрокиТовары.Вставить("Товар", 			   СтрокаТовар.Товар);
		ДанныеСтрокиТовары.Вставить("ТоварНаименование",   СтрокаТовар.ТоварНаименование);
		ДанныеСтрокиТовары.Вставить("КодТНВЭД", 		   СтрокаТовар.КодТНВЭД);
		ДанныеСтрокиТовары.Вставить("ЕдиницаИзмерения",    СтрокаТовар.ЕдиницаИзмерения);
		ДанныеСтрокиТовары.Вставить("ЕдиницаИзмеренияКод", КодЕдиницыИзмерения);
		ДанныеСтрокиТовары.Вставить("Количество", 		   СтрокаТовар.Количество);
		ДанныеСтрокиТовары.Вставить("Цена", 			   СтрокаТовар.Цена);
		ДанныеСтрокиТовары.Вставить("НомерСтрокиВСНТ",	   "10/" + СтрокаТовар.НомерСтроки); //Формат номера "НомерТабличнойЧасти/НомерСтроки"
		ДанныеСтрокиТовары.Вставить("ИсточникПроисхождения",СтрокаТовар.ИсточникПроисхождения); //Формат номера "НомерТабличнойЧасти/НомерСтроки"
		
		ДанныеДокументаСНТ.Добавить(ДанныеСтрокиТовары);
		
	КонецЦикла;
	
	Возврат ДанныеДокументаСНТ;
	
КонецФункции

Функция ПолучитьДанныеШапкиДокументаФНО(ДокументФНО) Экспорт
	
	ДанныеДокумента = Новый Структура();
	ДанныеДокумента.Вставить("РегистрационныйНомер", ДокументФНО.РегистрационныйНомер);
	ДанныеДокумента.Вставить("Дата", 				 ДокументФНО.Дата);
	ДанныеДокумента.Вставить("Сумма", 				 ДокументФНО.Товары.Итог("Сумма") + ДокументФНО.ОС.Итог("Сумма"));   
	
	Возврат ДанныеДокумента;
	
КонецФункции

// Описание: Заполняет количество остатков по источникам происхождения
//
// Параметры (название, тип, дифференцированное значение)
//  ДокументОбъект - Объект документа СопоставлениеСНТиФНО
//  ИмяТабличнойЧастиТовары - Имя табличной части товаров СНТ
Процедура ЗаполнитьОстаткиТоваровВС(ДокументОбъект, ИмяТабличнойЧастиТовары) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаТоваров", ДокументОбъект[ИмяТабличнойЧастиТовары].Выгрузить());
	Запрос.УстановитьПараметр("Организация", ДокументОбъект.Организация);
	Запрос.УстановитьПараметр("СтруктурноеПодразделение", ДокументОбъект.СтруктурноеПодразделение);
	Запрос.УстановитьПараметр("ДатаОстатка", ДокументОбъект.Дата);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
	|	&Организация КАК Организация,
	|	&СтруктурноеПодразделение КАК СтруктурноеПодразделение,
	|	ТаблицаТоваров.Склад КАК Склад,
	|	ТаблицаТоваров.Товар КАК Номенклатура,
	|	ТаблицаТоваров.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ТаблицаТоваров.ИсточникПроисхождения КАК ИсточникПроисхождения
	|ПОМЕСТИТЬ ТоварыДокумента
	|ИЗ
	|	&ТаблицаТоваров КАК ТаблицаТоваров
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	СтруктурноеПодразделение,
	|	Склад,
	|	Номенклатура,
	|	ЕдиницаИзмерения,
	|	ИсточникПроисхождения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыДокумента.НомерСтроки КАК НомерСтроки,
	|	ЕСТЬNULL(ОстаткиВС.КоличествоОстаток, 0) - ЕСТЬNULL(ОстаткиВСВРезерве.КоличествоОстаток, 0) КАК КоличествоОстаток,
	|	ОстаткиВС.Склад КАК Склад
	|ИЗ
	|	ТоварыДокумента КАК ТоварыДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаВиртуальныхСкладах.Остатки(
	|				&ДатаОстатка,
	|				(Организация, СтруктурноеПодразделение, Номенклатура, ЕдиницаИзмерения, ИсточникПроисхождения) В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						Товары.Организация,
	|						Товары.СтруктурноеПодразделение,
	|						Товары.Номенклатура,
	|						Товары.ЕдиницаИзмерения,
	|						Товары.ИсточникПроисхождения
	|					ИЗ
	|						ТоварыДокумента КАК Товары)) КАК ОстаткиВС
	|		ПО ТоварыДокумента.Организация = ОстаткиВС.Организация
	|			И ТоварыДокумента.СтруктурноеПодразделение = ОстаткиВС.СтруктурноеПодразделение
	|			И ТоварыДокумента.Номенклатура = ОстаткиВС.Номенклатура
	|			И ТоварыДокумента.ЕдиницаИзмерения = ОстаткиВС.ЕдиницаИзмерения
	|			И ТоварыДокумента.ИсточникПроисхождения = ОстаткиВС.ИсточникПроисхождения
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВиртуальногоСкладаВРезерве.Остатки(
	|				&ДатаОстатка,
	|				(Организация, СтруктурноеПодразделение, Номенклатура, ЕдиницаИзмерения, ИсточникПроисхождения) В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						Товары.Организация,
	|						Товары.СтруктурноеПодразделение,
	|						Товары.Номенклатура,
	|						Товары.ЕдиницаИзмерения,
	|						Товары.ИсточникПроисхождения
	|					ИЗ
	|						ТоварыДокумента КАК Товары)) КАК ОстаткиВСВРезерве
	|		ПО ТоварыДокумента.Организация = ОстаткиВСВРезерве.Организация
	|			И ТоварыДокумента.СтруктурноеПодразделение = ОстаткиВСВРезерве.СтруктурноеПодразделение
	|			И ТоварыДокумента.Номенклатура = ОстаткиВСВРезерве.Номенклатура
	|			И ТоварыДокумента.ЕдиницаИзмерения = ОстаткиВСВРезерве.ЕдиницаИзмерения
	|			И ТоварыДокумента.ИсточникПроисхождения = ОстаткиВСВРезерве.ИсточникПроисхождения
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПараметрыПоиска = Новый Структура("НомерСтроки", Выборка.НомерСтроки);
		НайденныеСтроки = ДокументОбъект[ИмяТабличнойЧастиТовары].НайтиСтроки(ПараметрыПоиска);
		Если ЗначениеЗаполнено(НайденныеСтроки) Тогда
			Для каждого СтрокаТЧ Из НайденныеСтроки Цикл
				СтрокаТЧ.КоличествоОстатков = Выборка.КоличествоОстаток;
				СтрокаТЧ.Склад = Выборка.Склад;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры //ЗаполнитьОстаткиТоваровВС

// Проверка заполнено ли количество остатков по источникам происхождения
//
// Параметры (название, тип, дифференцированное значение)
//  ДокументОбъект - Объект документа СопоставлениеСНТиФНО
//  ИмяТабличнойЧастиТовары - Имя табличной части товаров СНТ
Процедура ПроверкаЗаполненияОстаткаТоваровВС (ДокументОбъект, ИмяТабличнойЧастиТовары, Отказ) Экспорт
	
	ТаблицаТоваров = ДокументОбъект[ИмяТабличнойЧастиТовары].Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаТоваров", ТаблицаТоваров);
	Запрос.УстановитьПараметр("Организация", ДокументОбъект.Организация);
	Запрос.УстановитьПараметр("СтруктурноеПодразделение", ДокументОбъект.СтруктурноеПодразделение);
	Запрос.УстановитьПараметр("ДатаОстатка", ДокументОбъект.Дата);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
	|	&Организация КАК Организация,
	|	&СтруктурноеПодразделение КАК СтруктурноеПодразделение,
	|	ТаблицаТоваров.Товар КАК Номенклатура,
	|	ТаблицаТоваров.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ТаблицаТоваров.ИсточникПроисхождения КАК ИсточникПроисхождения
	|ПОМЕСТИТЬ ТоварыДокумента
	|ИЗ
	|	&ТаблицаТоваров КАК ТаблицаТоваров
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	СтруктурноеПодразделение,
	|	Номенклатура,
	|	ЕдиницаИзмерения,
	|	ИсточникПроисхождения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыДокумента.НомерСтроки КАК НомерСтроки,
	|	ТоварыДокумента.Номенклатура КАК Номенклатура,
	|	ТоварыДокумента.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ТоварыДокумента.ИсточникПроисхождения КАК ИсточникПроисхождения,
	|	ЕСТЬNULL(ОстаткиВС.КоличествоОстаток, 0) - ЕСТЬNULL(ОстаткиВСВРезерве.КоличествоОстаток, 0) КАК КоличествоОстаток,
	|	ОстаткиВС.Склад КАК Склад
	|ИЗ
	|	ТоварыДокумента КАК ТоварыДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаВиртуальныхСкладах.Остатки(
	|				&ДатаОстатка,
	|				(Организация, СтруктурноеПодразделение, Номенклатура, ЕдиницаИзмерения, ИсточникПроисхождения) В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						Товары.Организация,
	|						Товары.СтруктурноеПодразделение,
	|						Товары.Номенклатура,
	|						Товары.ЕдиницаИзмерения,
	|						Товары.ИсточникПроисхождения
	|					ИЗ
	|						ТоварыДокумента КАК Товары)) КАК ОстаткиВС
	|		ПО ТоварыДокумента.Организация = ОстаткиВС.Организация
	|			И ТоварыДокумента.СтруктурноеПодразделение = ОстаткиВС.СтруктурноеПодразделение
	|			И ТоварыДокумента.Номенклатура = ОстаткиВС.Номенклатура
	|			И ТоварыДокумента.ЕдиницаИзмерения = ОстаткиВС.ЕдиницаИзмерения
	|			И ТоварыДокумента.ИсточникПроисхождения = ОстаткиВС.ИсточникПроисхождения
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВиртуальногоСкладаВРезерве.Остатки(
	|				&ДатаОстатка,
	|				(Организация, СтруктурноеПодразделение, Номенклатура, ЕдиницаИзмерения, ИсточникПроисхождения) В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						Товары.Организация,
	|						Товары.СтруктурноеПодразделение,
	|						Товары.Номенклатура,
	|						Товары.ЕдиницаИзмерения,
	|						Товары.ИсточникПроисхождения
	|					ИЗ
	|						ТоварыДокумента КАК Товары)) КАК ОстаткиВСВРезерве
	|		ПО ТоварыДокумента.Организация = ОстаткиВСВРезерве.Организация
	|			И ТоварыДокумента.СтруктурноеПодразделение = ОстаткиВСВРезерве.СтруктурноеПодразделение
	|			И ТоварыДокумента.Номенклатура = ОстаткиВСВРезерве.Номенклатура
	|			И ТоварыДокумента.ЕдиницаИзмерения = ОстаткиВСВРезерве.ЕдиницаИзмерения
	|			И ТоварыДокумента.ИсточникПроисхождения = ОстаткиВСВРезерве.ИсточникПроисхождения
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	ТаблицаОстатков = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаДокумента Из ТаблицаТоваров Цикл
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Номенклатура", СтрокаДокумента.Товар);
		СтруктураПоиска.Вставить("ЕдиницаИзмерения", СтрокаДокумента.ЕдиницаИзмерения);
		СтруктураПоиска.Вставить("ИсточникПроисхождения", СтрокаДокумента.ИсточникПроисхождения);
		
		СтрокиОстатка = ТаблицаОстатков.НайтиСтроки(СтруктураПоиска);
		ЗаполненныйОстатокВстрокеДокумента = СтрокаДокумента.КоличествоОстатков;
		
		Для Каждого СтрокаОстатка Из СтрокиОстатка Цикл
			
			Если ЗаполненныйОстатокВстрокеДокумента = 0 И СтрокаОстатка.КоличествоОстаток <> 0 Тогда
				
				ТекстОшибки = НСтр("ru='Не заполнено количество остатка. Строка: %1. По организации <%2>, структурному подразделению <%3>, %4 %5 товара <%6>, источник происхождения - %7' ");
				ТекстОшибки = ЭСФКлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(ТекстОшибки, СтрокаДокумента.НомерСтроки, ДокументОбъект.Организация,ДокументОбъект.СтруктурноеПодразделение, ЗаполненныйОстатокВстрокеДокумента, СтрокаДокумента.ЕдиницаИзмерения,
				СтрокаДокумента.Товар, СтрокаДокумента.ИсточникПроисхождения);
				//ПолеКоличествоОстатка = СтрокаДокумента.ТоварНаименование + "[" + Формат(СтрокаДокумента.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].КоличествоОстатков";
				ПолеКоличествоОстатка = "ТоварыСНТ[" + Формат(СтрокаДокумента.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].Товар";

				Отказ = Истина;
				ЭСФКлиентСерверПереопределяемый.СообщитьПользователю(ТекстОшибки, ДокументОбъект, ПолеКоличествоОстатка, "Объект");
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеСФиЭСФпоСНТ

// Функция создает несколько ЭСФ И СФ на основании нескольких СНТ.
//
Функция СоздатьСписокИсходящихЭСФиСФИзСНТ(ПараметрыСоздания) Экспорт
	
	СписокСозданныхСчетовФактурИЭСФ = Новый Массив;
	МассивСНТ = ПараметрыСоздания.МассивСНТ;
	СуществующиеАктуальныеЭСФ = ПараметрыСоздания.СуществующиеАктуальныеЭСФ;
	
	Для Каждого СНТ Из МассивСНТ Цикл
		
		СтрокаСНТЭСФ = Неопределено;
		СсылкаНаЭСФ = Неопределено;
		СвязанныйСФ = Неопределено;
		ЭтоОтозванныйЭСФ = Ложь;
		
		Для Каждого Строка Из СуществующиеАктуальныеЭСФ Цикл
			Если Строка.СНТ = СНТ Тогда
				СтрокаСНТЭСФ = Строка;
				СсылкаНаЭСФ = СтрокаСНТЭСФ.АктуальныйЭСФ;
				СвязанныйСФ = СтрокаСНТЭСФ.АктуальныйСФ;
				ЭтоОтозванныйЭСФ = СтрокаСНТЭСФ.ЭтоОтозванныйЭСФ;
			КонецЕсли;
		КонецЦикла;
		
		Если ТипЗнч(СНТ.ДокументОснование) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
			
			ТекстСообщения = НСтр("ru='Для документа ""Перемещение товаров"" не нужно вводить ЭСФ и СФ.'");
			ЭСФКлиентСерверПереопределяемый.СообщитьПользователю(ТекстСообщения);
			
		ИначеЕсли СНТ.ВидОперации = Перечисления.ВидыОперацийСНТ.Ввоз И НЕ СНТ.ТипСНТ = Перечисления.ТипыСНТ.ВозвратТоваров Тогда
			
			ТекстСообщения = НСтр("ru='Для документов СНТ на импорт не нужно вводить ЭСФ и СФ.'");
			ЭСФКлиентСерверПереопределяемый.СообщитьПользователю(ТекстСообщения);
			
		Иначе
			
			Если ЗначениеЗаполнено(СНТ.ДокументОснование) Тогда
				
				Если ЗначениеЗаполнено(СвязанныйСФ) И (НЕ ЗначениеЗаполнено(СсылкаНаЭСФ) Или ЭтоОтозванныйЭСФ) Тогда
					
					// Если СФ есть, проверяем у него введенный ЭСФ.
					// Если ЭСФ есть, ничего не делаем, если нет, создаем только ЭСФ и связываем с СФ
					
					Если ТипЗнч(СНТ.ДокументОснование) = Тип("ДокументСсылка.ВозвратТоваровПоставщику") Тогда
						
						ТекстСообщения = ЭСФКлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(
						НСтр("ru='У документа %1 уже есть оформленный СФ. Новый ЭСФ для Возврата ТМЗ поставщику вводить не нужно.'"), СНТ.ДокументОснование);
						ЭСФКлиентСерверПереопределяемый.СообщитьПользователю(ТекстСообщения);
						
					Иначе
						
						СвязанныйЭСФ = СНТСерверПереопределяемый.НайтиПодчиненныйЭСФ(СвязанныйСФ, Истина);
						
						Если СвязанныйЭСФ.Количество() = 0 Тогда 
							
							Попытка
								
								ПараметрыЗаполнения = Новый Структура;
								ПараметрыЗаполнения.Вставить("ДокументОснованиеСНТ", СНТ);
								ПараметрыЗаполнения.Вставить("ДополнительныеПараметры", СтрокаСНТЭСФ);
								
								НовыйДокументЭСФ = Документы.ЭСФ.СоздатьДокумент();
								НовыйДокументЭСФ.СчетФактура = СвязанныйСФ;
								НовыйДокументЭСФ.Заполнить(ПараметрыЗаполнения);
								НовыйДокументЭСФ.Дата = ТекущаяДатаСеанса();
								
								Если ЭтоОтозванныйЭСФ Тогда
									НовыйДокументЭСФ.СвязанныйЭСФ = СсылкаНаЭСФ.СвязанныйЭСФ;
									НовыйДокументЭСФ.СвязанныйЭСФДата = СсылкаНаЭСФ.СвязанныйЭСФДата;
									НовыйДокументЭСФ.СвязанныйЭСФНомер = СсылкаНаЭСФ.СвязанныйЭСФНомер;
									НовыйДокументЭСФ.СвязанныйЭСФРегистрационныйНомер = СсылкаНаЭСФ.СвязанныйЭСФРегистрационныйНомер;
								КонецЕсли;
								
								СделатьАктуальным = ЭСФКлиентСервер.СделатьАктуальным();
								НовыйДокументЭСФ.ДополнительныеСвойства.Вставить(СделатьАктуальным, Истина);	
								
								Если СвязанныйСФ.Ссылка.ВидСчетаФактуры = ПредопределенноеЗначение("Перечисление.ВидыСчетовФактур.Обычный") Тогда	
									НовыйДокументЭСФ.Вид = ПредопределенноеЗначение("Перечисление.ВидыЭСФ.Обычный");
								ИначеЕсли СвязанныйСФ.Ссылка.ВидСчетаФактуры = ПредопределенноеЗначение("Перечисление.ВидыСчетовФактур.Дополнительный") Тогда 
									НовыйДокументЭСФ.Вид = ПредопределенноеЗначение("Перечисление.ВидыЭСФ.Дополнительный");
								ИначеЕсли СвязанныйСФ.Ссылка.ВидСчетаФактуры = ПредопределенноеЗначение("Перечисление.ВидыСчетовФактур.Исправленный") Тогда
									НовыйДокументЭСФ.Вид = ПредопределенноеЗначение("Перечисление.ВидыЭСФ.Исправленный");
								КонецЕсли;
								
								НовыйДокументЭСФ.Записать();
								СписокСозданныхСчетовФактурИЭСФ.Добавить(НовыйДокументЭСФ.Ссылка);
								
							Исключение
								
								ТекстСообщения = ЭСФКлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(
								НСтр("ru='Ошибка при создании документа ЭСФ: %1.'"),
								ИнформацияОбОшибке().Описание);
								
								ЭСФКлиентСерверПереопределяемый.СообщитьПользователю(ТекстСообщения);
								
							КонецПопытки; 
							
						Иначе
							ТекстСообщения = ЭСФКлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(
							НСтр("ru='У документа-основания %1 уже есть связанные документы ЭСФ и СФ.'"),
							СНТ.ДокументОснование);
							
							ЭСФКлиентСерверПереопределяемый.СообщитьПользователю(ТекстСообщения);
						КонецЕсли;
						
					КонецЕсли;
					
				Иначе
					
					// Если связанного СФ нет, создаем и СФ, и ЭСФ, устанавливаем связь между ними
					Попытка
												
						Если ТипЗнч(СНТ.ДокументОснование) = Тип("ДокументСсылка.ВозвратТоваровПоставщику") Тогда
							НовыйДокументСчетФактура = Документы.СчетФактураПолученный.СоздатьДокумент();
						Иначе
							НовыйДокументСчетФактура = Документы.СчетФактураВыданный.СоздатьДокумент();
						КонецЕсли;

						НовыйДокументСчетФактура.ДополнительныеСвойства.Вставить("ДокументОснованиеСНТ", СНТ);
						НовыйДокументСчетФактура.Заполнить(СНТ.ДокументОснование);
						НовыйДокументСчетФактура.Дата = ТекущаяДатаСеанса();
						
						//для исправленного СФ
						Если ЗначениеЗаполнено(СвязанныйСФ) Тогда
							НовыйДокументСчетФактура.ВидСчетаФактуры = ПредопределенноеЗначение("Перечисление.ВидыСчетовФактур.Исправленный");
							НовыйДокументСчетФактура.ОсновнойСчетФактура = СвязанныйСФ;
						КонецЕсли;
						
						Если ТипЗнч(НовыйДокументСчетФактура) = Тип("ДокументОбъект.СчетФактураПолученный") 
							И (Не ЗначениеЗаполнено(НовыйДокументСчетФактура.ОсновнойСчетФактура) ИЛИ Не ЗначениеЗаполнено(НовыйДокументСчетФактура.НомерВходящегоДокумента) ИЛИ Не ЗначениеЗаполнено(НовыйДокументСчетФактура.ДатаВходящегоДокумента)) Тогда
							
							НовыйДокументСчетФактура.Записать(РежимЗаписиДокумента.Запись);  // требуется заполнение основного СФ для проведения
						Иначе
							НовыйДокументСчетФактура.Записать(РежимЗаписиДокумента.Проведение);
						КонецЕсли;
						
						СписокСозданныхСчетовФактурИЭСФ.Добавить(НовыйДокументСчетФактура.Ссылка);
						
					Исключение
						
						ТекстСообщения = ЭСФКлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(
						НСтр("ru='Ошибка при создании документа Счет-фактура (выданный): %1.'"),
						ИнформацияОбОшибке().Описание);
						
						ЭСФКлиентСерверПереопределяемый.СообщитьПользователю(ТекстСообщения);
						
					КонецПопытки;
					
					Попытка
						
						Если Не ТипЗнч(СНТ.ДокументОснование) = Тип("ДокументСсылка.ВозвратТоваровПоставщику") Тогда
							
							ПараметрыЗаполнения = Новый Структура;
						    ПараметрыЗаполнения.Вставить("ДокументОснованиеСНТ", СНТ);
							ПараметрыЗаполнения.Вставить("ДополнительныеПараметры", СтрокаСНТЭСФ);

							НовыйДокументЭСФ = Документы.ЭСФ.СоздатьДокумент();							
							НовыйДокументЭСФ.СчетФактура = НовыйДокументСчетФактура.Ссылка;
							НовыйДокументЭСФ.Заполнить(ПараметрыЗаполнения); 
							НовыйДокументЭСФ.Дата = ТекущаяДатаСеанса();
							НовыйДокументЭСФ.СчетФактура = НовыйДокументСчетФактура.Ссылка;
							
							НовыйДокументЭСФ.Номер = ЭСФСерверПереопределяемый.ПолучитьНомерНаПечать(НовыйДокументСчетФактура);
							
							СделатьАктуальным = ЭСФКлиентСервер.СделатьАктуальным();
							НовыйДокументЭСФ.ДополнительныеСвойства.Вставить(СделатьАктуальным, Истина);	
							
							Если НовыйДокументСчетФактура.ВидСчетаФактуры = ПредопределенноеЗначение("Перечисление.ВидыСчетовФактур.Обычный") Тогда	
								НовыйДокументЭСФ.Вид = ПредопределенноеЗначение("Перечисление.ВидыЭСФ.Обычный");
							ИначеЕсли НовыйДокументСчетФактура.ВидСчетаФактуры = ПредопределенноеЗначение("Перечисление.ВидыСчетовФактур.Дополнительный") Тогда 
								НовыйДокументЭСФ.Вид = ПредопределенноеЗначение("Перечисление.ВидыЭСФ.Дополнительный");
							ИначеЕсли НовыйДокументСчетФактура.ВидСчетаФактуры = ПредопределенноеЗначение("Перечисление.ВидыСчетовФактур.Исправленный") Тогда
								НовыйДокументЭСФ.Вид = ПредопределенноеЗначение("Перечисление.ВидыЭСФ.Исправленный");
							КонецЕсли;
							
							НовыйДокументЭСФ.Записать();
							СписокСозданныхСчетовФактурИЭСФ.Добавить(НовыйДокументЭСФ.Ссылка);
							
						КонецЕсли;
						
					Исключение
						
						ТекстСообщения = ЭСФКлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(
						НСтр("ru='Ошибка при создании документа ЭСФ: %1.'"),
						ИнформацияОбОшибке().Описание);
						
						ЭСФКлиентСерверПереопределяемый.СообщитьПользователю(ТекстСообщения);
						
					КонецПопытки;
					
				КонецЕсли;
			Иначе
				ТекстСообщения = НСтр("ru='Не удалось создать документ Счет-фактура (выданный): Отсутствует учетный документ СНТ.'");
				
				ЭСФКлиентСерверПереопределяемый.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;
			
		КонецЕсли;
		
		Попытка
			
			Если (НовыйДокументЭСФ <> Неопределено И ЗначениеЗаполнено(НовыйДокументЭСФ.СчетФактура))
				ИЛИ (СсылкаНаЭСФ <> Неопределено И ЗначениеЗаполнено(СсылкаНаЭСФ.СчетФактура)) Тогда
				
				ДокументЭСФ = ?(НовыйДокументЭСФ <> Неопределено, НовыйДокументЭСФ, СсылкаНаЭСФ);
				СчетФактураОбъект = ДокументЭСФ.СчетФактура.ПолучитьОбъект();
				СНТСерверПереопределяемый.ЗаполнитьПризнакСчетФактураВЭлектронномВиде(СчетФактураОбъект);
				СчетФактураОбъект.Записать();
			КонецЕсли;
			
		Исключение
			
			ТекстСообщения = ЭСФКлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(
			НСтр("ru='Ошибка при записи %1: %2.'"),
			ДокументЭСФ.СчетФактура,
			ИнформацияОбОшибке().Описание);
			
			ЭСФКлиентСерверПереопределяемый.СообщитьПользователю(ТекстСообщения);
			
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат СписокСозданныхСчетовФактурИЭСФ;
	
КонецФункции

Функция ПроверитьАктуальныйЭСФДляСНТ(МассивСНТ, ПерезаполняемыйЭСФ = Неопределено) Экспорт
	
	СписокАктуальныйЭСФДляСНТ = Новый Массив;
	
	Для Каждого СНТ Из МассивСНТ Цикл
		СсылкаНаЭСФ = АктуальныйЭСФДляПервичногоДокументаСНТ(СНТ,ПерезаполняемыйЭСФ);
		Если ЗначениеЗаполнено(СсылкаНаЭСФ) Тогда
			СписокАктуальныйЭСФДляСНТ.Добавить(СсылкаНаЭСФ);
		Конецесли;
	КонецЦикла;
	
	Возврат СписокАктуальныйЭСФДляСНТ;
	
КонецФункции

Функция АктуальныйЭСФДляПервичногоДокументаСНТ(Знач СНТ, ПерезаполняемыйЭСФ = Неопределено) Экспорт
	
	ЭСФ = Новый Структура;
	
	ДокументОснование = СНТ.ДокументОснование;
	
	Если ДокументОснование <> Неопределено Тогда
		МетаданныеДокумента = ДокументОснование.Метаданные();
		ПолноеИмяДокумента = МетаданныеДокумента.ПолноеИмя();
		
		Запрос = Новый Запрос;
		ТекстЗапроса = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	ЕСТЬNULL(ЭСФ.Ссылка, ЗНАЧЕНИЕ(Документ.ЭСФ.ПустаяСсылка)) КАК ЭСФ,
			|	ВЫБОР
			|		КОГДА ЭСФ.Ссылка ЕСТЬ NULL
			|       ТОГДА ЛОЖЬ
			|		КОГДА ЭСФ.Вид <> ЗНАЧЕНИЕ(Перечисление.ВидыЭСФ.Исправленный)
			|       ТОГДА ИСТИНА
			|       ИНАЧЕ ЛОЖЬ
			|   КОНЕЦ КАК ЭтоОбычныйЭСФ,
			|	ВЫБОР
			|		КОГДА ЭСФ.Ссылка ЕСТЬ NULL
			|			ТОГДА ЛОЖЬ
			|		КОГДА ЭСФ.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЭСФ.Отозванный)
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ КАК ЭтоОтозванныйЭСФ,
			|	ВЫБОР
			|		КОГДА  ПОДСТРОКА(ЭСФ.ДокументПодтверждающийПоставкуНомер, 0, 6) = ""KZ-SNT"" 
			|       ТОГДА ИСТИНА
			|		КОГДА ЭСФ.Ссылка ЕСТЬ NULL
			|       ТОГДА ИСТИНА
			|       ИНАЧЕ ЛОЖЬ
			|   КОНЕЦ КАК СоздаватьЭСФИЗСНТ,
			|	ЕСТЬNULL(СчетФактураВыданный.Ссылка, ЗНАЧЕНИЕ(Документ.СчетФактураВыданный.ПустаяСсылка)) КАК СчетФактураВыданный
			|
			|ИЗ
			|	Документ.СНТ КАК ДокументСНТ
			|   ВНУТРЕННЕЕ СОЕДИНЕНИЕ " + ПолноеИмяДокумента + " КАК РеализацияТоваровУслуг
			|   ПО ДокументСНТ.ДокументОснование = РеализацияТоваровУслуг.ССылка
			|   И ДокументСНТ.Ссылка = &СНТ 
			|	И &НеПустаяСсылкаСНТ
			|   И ДокументСНТ.ДокументОснование ССЫЛКА " + ПолноеИмяДокумента + " 
			|   ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
			|   ПО СчетФактураВыданный.ДокументОснование = РеализацияТоваровУслуг.ССылка
			|   ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЭСФ КАК ЭСФ
			|   ПО ЭСФ.СчетФактура = СчетФактураВыданный.Ссылка
			|
			|&УсловиеПоЭСФ
			|
			|УПОРЯДОЧИТЬ ПО
			|	СчетФактураВыданный.Дата УБЫВ,
			|	ЭСФ.Дата УБЫВ";
		
		Запрос.УстановитьПараметр("СНТ", СНТ);
		Запрос.УстановитьПараметр("НеПустаяСсылкаСНТ", СНТ <> Документы.СНТ.ПустаяСсылка());
		Запрос.УстановитьПараметр("ПерезаполняемыйЭСФ", ПерезаполняемыйЭСФ);
		Если ЗначениеЗаполнено(ПерезаполняемыйЭСФ) Тогда
			Запрос.УстановитьПараметр("ДатаПерезаполняемогоЭСФ", ПерезаполняемыйЭСФ.Дата);
		КонецЕсли;
		
		ТекстЗапроса = СтрЗаменить(Текстзапроса, "&УсловиеПоЭСФ", ?(ПерезаполняемыйЭСФ <> Неопределено И НЕ ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя"),
		"ГДЕ ЕСТЬNULL(ЭСФ.Ссылка, ЗНАЧЕНИЕ(Документ.ЭСФ.ПустаяСсылка)) <> &ПерезаполняемыйЭСФ 
		|И 
		|ВЫБОР 
		|	КОГДА ЕСТЬNULL(ЭСФ.ДАТА, ДАТАВРЕМЯ(1,1,1)) = ДАТАВРЕМЯ (1,1,1) 
		|	ТОГДА ИСТИНА 
		|	КОГДА ЕСТЬNULL(ЭСФ.ДАТА, ДАТАВРЕМЯ(1,1,1)) < &ДатаПерезаполняемогоЭСФ 
		|	ТОГДА ИСТИНА
		|	ИНАЧЕ ЛОЖЬ
		|КОНЕЦ ", ""));
		
		Запрос.Текст = ТекстЗапроса;
		Результат = Запрос.Выполнить();
		
		Если НЕ Результат.Пустой() Тогда
			Выборка = Результат.Выбрать();
			Если Выборка.Следующий() Тогда
				ЭСФ.Вставить("СНТ", СНТ);
				ЭСФ.Вставить("АктуальныйСФ", Выборка.СчетФактураВыданный);
				ЭСФ.Вставить("АктуальныйЭСФ", Выборка.ЭСФ);
				ЭСФ.Вставить("ЭтоОбычныйЭСФ", Выборка.ЭтоОбычныйЭСФ);
				ЭСФ.Вставить("ЭтоОтозванныйЭСФ", Выборка.ЭтоОтозванныйЭСФ);
				ЭСФ.Вставить("СоздаватьЭСФИЗСНТ", Выборка.СоздаватьЭСФИЗСНТ);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;

	Возврат ЭСФ;
	
КонецФункции

Функция ТекстЗапросаПоУслугамВводЭСФИзСНТ() Экспорт
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ВозвратТоваровОтПокупателяУслуги.Содержание <> """"
	|			ТОГДА ВозвратТоваровОтПокупателяУслуги.Содержание
	|		ИНАЧЕ ВЫБОР
	|				КОГДА (ВЫРАЗИТЬ(СправочникНоменклатура.НаименованиеПолное КАК СТРОКА(400))) <> """"
	|					ТОГДА ВЫРАЗИТЬ(СправочникНоменклатура.НаименованиеПолное КАК СТРОКА(400))
	|				ИНАЧЕ СправочникНоменклатура.НаименованиеПолное
	|			КОНЕЦ
	|	КОНЕЦ КАК ТоварНаименование,
	|	ВозвратТоваровОтПокупателяУслуги.Номенклатура КАК Товар,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(10)) КАК КодТНВЭД,
	|	СправочникНоменклатура.БазоваяЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СправочникНоменклатура.БазоваяЕдиницаИзмерения.НаименованиеПолное КАК ЕдиницаИзмеренияНаименование,
	|	СправочникНоменклатура.БазоваяЕдиницаИзмерения.КодЭСФ КАК ЕдиницаИзмеренияКод,
	|	ВозвратТоваровОтПокупателяУслуги.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА ВозвратТоваровОтПокупателя.УчитыватьНДС
	|				И ВозвратТоваровОтПокупателя.СуммаВключаетНДС
	|				И ВозвратТоваровОтПокупателяУслуги.Количество <> 0
	|			ТОГДА (ВозвратТоваровОтПокупателяУслуги.Сумма - ВозвратТоваровОтПокупателяУслуги.СуммаНДС) / ВозвратТоваровОтПокупателяУслуги.Количество
	|		ИНАЧЕ ВозвратТоваровОтПокупателяУслуги.Цена
	|	КОНЕЦ КАК Цена,
	|	ВЫБОР
	|		КОГДА ВозвратТоваровОтПокупателя.УчитыватьНДС
	|				И ВозвратТоваровОтПокупателя.СуммаВключаетНДС
	|			ТОГДА ВозвратТоваровОтПокупателяУслуги.Сумма - ВозвратТоваровОтПокупателяУслуги.СуммаНДС
	|		ИНАЧЕ ВозвратТоваровОтПокупателяУслуги.Сумма
	|	КОНЕЦ КАК СуммаБезНалогов,
	|	"""" КАК СтавкаАкцизаЧисло,
	|	"""" КАК СтавкаАкциза,
	|	0 КАК СуммаАкциза,
	|	ВЫБОР
	|		КОГДА ВозвратТоваровОтПокупателя.УчитыватьНДС
	|				И ВозвратТоваровОтПокупателя.СуммаВключаетНДС
	|			ТОГДА ВозвратТоваровОтПокупателяУслуги.Сумма - ВозвратТоваровОтПокупателяУслуги.СуммаНДС
	|		ИНАЧЕ ВозвратТоваровОтПокупателяУслуги.Сумма
	|	КОНЕЦ КАК ОборотПоРеализации,
	|	ВЫБОР
	|		КОГДА ВозвратТоваровОтПокупателя.УчитыватьНДС
	|			ТОГДА СтавкиНДС.Ставка
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СтавкаНДСЧисло,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВозвратТоваровОтПокупателяУслуги.СтавкаНДС.ДляОсвобожденногоОборота, ЛОЖЬ) = ИСТИНА
	|			ТОГДА ЕСТЬNULL(ВозвратТоваровОтПокупателяУслуги.СтавкаНДС.ДляОсвобожденногоОборота, ЛОЖЬ)
	|		ИНАЧЕ ЕСТЬNULL(ВозвратТоваровОтПокупателяУслуги.СтавкаНДС.МестоРеализацииНеРК, ЛОЖЬ)
	|	КОНЕЦ КАК БезНДС,
	|	ВозвратТоваровОтПокупателяУслуги.СтавкаНДС КАК СтавкаНДС,
	|	ВозвратТоваровОтПокупателяУслуги.СуммаНДС КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА ВозвратТоваровОтПокупателя.УчитыватьНДС
	|				И ВозвратТоваровОтПокупателя.СуммаВключаетНДС
	|			ТОГДА ВозвратТоваровОтПокупателяУслуги.Сумма
	|		ИНАЧЕ ВозвратТоваровОтПокупателяУслуги.Сумма + ВозвратТоваровОтПокупателяУслуги.СуммаНДС
	|	КОНЕЦ КАК Сумма,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(42)) КАК НомерЗаявленияВРамкахТС,
	|	""6"" КАК ПризнакПроисхождения,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(11)) КАК НомерПозицииВДекларацииИлиЗаявлении,
	|	1 КАК ИдентификаторТовара,
	|	ЗНАЧЕНИЕ(Справочник.ИсточникиПроисхождения.ПустаяСсылка) КАК ИсточникПроисхождения,
	|	ЛОЖЬ КАК ПризнакУчетаНаВиртуальномСкладе
	|ИЗ
	|	Документ.ВозвратТоваровОтПокупателя.Услуги КАК ВозвратТоваровОтПокупателяУслуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровОтПокупателя КАК ВозвратТоваровОтПокупателя
	|		ПО ВозвратТоваровОтПокупателяУслуги.Ссылка = ВозвратТоваровОтПокупателя.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО ВозвратТоваровОтПокупателяУслуги.Номенклатура = СправочникНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтавкиНДС КАК СтавкиНДС
	|		ПО ВозвратТоваровОтПокупателяУслуги.СтавкаНДС = СтавкиНДС.Ссылка
	|ГДЕ
	|	ВозвратТоваровОтПокупателяУслуги.Ссылка = &СНТДокументОснование
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ВозвратТоваровПоставщикуУслуги.Содержание <> """"
	|			ТОГДА ВозвратТоваровПоставщикуУслуги.Содержание
	|		ИНАЧЕ ВЫБОР
	|				КОГДА (ВЫРАЗИТЬ(СправочникНоменклатура.НаименованиеПолное КАК СТРОКА(400))) <> """"
	|					ТОГДА ВЫРАЗИТЬ(СправочникНоменклатура.НаименованиеПолное КАК СТРОКА(400))
	|				ИНАЧЕ СправочникНоменклатура.НаименованиеПолное
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВозвратТоваровПоставщикуУслуги.Номенклатура,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(10)),
	|	СправочникНоменклатура.БазоваяЕдиницаИзмерения,
	|	СправочникНоменклатура.БазоваяЕдиницаИзмерения.НаименованиеПолное,
	|	СправочникНоменклатура.БазоваяЕдиницаИзмерения.КодЭСФ,
	|	ВозвратТоваровПоставщикуУслуги.Количество,
	|	ВЫБОР
	|		КОГДА ВозвратТоваровПоставщику.УчитыватьНДС
	|				И ВозвратТоваровПоставщику.СуммаВключаетНДС
	|				И ВозвратТоваровПоставщикуУслуги.Количество <> 0
	|			ТОГДА (ВозвратТоваровПоставщикуУслуги.Сумма - ВозвратТоваровПоставщикуУслуги.СуммаНДС) / ВозвратТоваровПоставщикуУслуги.Количество
	|		ИНАЧЕ ВозвратТоваровПоставщикуУслуги.Цена
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВозвратТоваровПоставщику.УчитыватьНДС
	|				И ВозвратТоваровПоставщику.СуммаВключаетНДС
	|			ТОГДА ВозвратТоваровПоставщикуУслуги.Сумма - ВозвратТоваровПоставщикуУслуги.СуммаНДС
	|		ИНАЧЕ ВозвратТоваровПоставщикуУслуги.Сумма
	|	КОНЕЦ,
	|	"""",
	|	"""",
	|	0,
	|	ВЫБОР
	|		КОГДА ВозвратТоваровПоставщику.УчитыватьНДС
	|				И ВозвратТоваровПоставщику.СуммаВключаетНДС
	|			ТОГДА ВозвратТоваровПоставщикуУслуги.Сумма - ВозвратТоваровПоставщикуУслуги.СуммаНДС
	|		ИНАЧЕ ВозвратТоваровПоставщикуУслуги.Сумма
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВозвратТоваровПоставщику.УчитыватьНДС
	|			ТОГДА СтавкиНДС.Ставка
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВозвратТоваровПоставщикуУслуги.СтавкаНДС.ДляОсвобожденногоОборота, ЛОЖЬ) = ИСТИНА
	|			ТОГДА ЕСТЬNULL(ВозвратТоваровПоставщикуУслуги.СтавкаНДС.ДляОсвобожденногоОборота, ЛОЖЬ)
	|		ИНАЧЕ ЕСТЬNULL(ВозвратТоваровПоставщикуУслуги.СтавкаНДС.МестоРеализацииНеРК, ЛОЖЬ)
	|	КОНЕЦ,
	|	ВозвратТоваровПоставщикуУслуги.СтавкаНДС,
	|	ВозвратТоваровПоставщикуУслуги.СуммаНДС,
	|	ВЫБОР
	|		КОГДА ВозвратТоваровПоставщику.УчитыватьНДС
	|				И ВозвратТоваровПоставщику.СуммаВключаетНДС
	|			ТОГДА ВозвратТоваровПоставщикуУслуги.Сумма
	|		ИНАЧЕ ВозвратТоваровПоставщикуУслуги.Сумма + ВозвратТоваровПоставщикуУслуги.СуммаНДС
	|	КОНЕЦ,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(42)),
	|	""6"",
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(11)),
	|	1,
	|	ЗНАЧЕНИЕ(Справочник.ИсточникиПроисхождения.ПустаяСсылка),
	|	ЛОЖЬ
	|ИЗ
	|	Документ.ВозвратТоваровПоставщику.Услуги КАК ВозвратТоваровПоставщикуУслуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровПоставщику КАК ВозвратТоваровПоставщику
	|		ПО ВозвратТоваровПоставщикуУслуги.Ссылка = ВозвратТоваровПоставщику.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО ВозвратТоваровПоставщикуУслуги.Номенклатура = СправочникНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтавкиНДС КАК СтавкиНДС
	|		ПО ВозвратТоваровПоставщикуУслуги.СтавкаНДС = СтавкиНДС.Ссылка
	|ГДЕ
	|	ВозвратТоваровПоставщикуУслуги.Ссылка = &СНТДокументОснование
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслугУслуги.Содержание <> """"""""
	|			ТОГДА РеализацияТоваровУслугУслуги.Содержание
	|		ИНАЧЕ ВЫБОР
	|				КОГДА (ВЫРАЗИТЬ(СправочникНоменклатура.НаименованиеПолное КАК СТРОКА(400))) <> """"""""
	|					ТОГДА ВЫРАЗИТЬ(СправочникНоменклатура.НаименованиеПолное КАК СТРОКА(400))
	|				ИНАЧЕ СправочникНоменклатура.НаименованиеПолное
	|			КОНЕЦ
	|	КОНЕЦ,
	|	РеализацияТоваровУслугУслуги.Номенклатура,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(10)),
	|	СправочникНоменклатура.БазоваяЕдиницаИзмерения,
	|	СправочникНоменклатура.БазоваяЕдиницаИзмерения.НаименованиеПолное,
	|	СправочникНоменклатура.БазоваяЕдиницаИзмерения.КодЭСФ,
	|	РеализацияТоваровУслугУслуги.Количество,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.УчитыватьНДС
	|				И РеализацияТоваровУслуг.СуммаВключаетНДС
	|				И РеализацияТоваровУслугУслуги.Количество <> 0
	|			ТОГДА (РеализацияТоваровУслугУслуги.Сумма - РеализацияТоваровУслугУслуги.СуммаНДС) / РеализацияТоваровУслугУслуги.Количество
	|		ИНАЧЕ РеализацияТоваровУслугУслуги.Цена
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.УчитыватьНДС
	|				И РеализацияТоваровУслуг.СуммаВключаетНДС
	|			ТОГДА РеализацияТоваровУслугУслуги.Сумма - РеализацияТоваровУслугУслуги.СуммаНДС
	|		ИНАЧЕ РеализацияТоваровУслугУслуги.Сумма
	|	КОНЕЦ,
	|	"""",
	|	"""",
	|	0,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.УчитыватьНДС
	|				И РеализацияТоваровУслуг.СуммаВключаетНДС
	|			ТОГДА РеализацияТоваровУслугУслуги.Сумма - РеализацияТоваровУслугУслуги.СуммаНДС
	|		ИНАЧЕ РеализацияТоваровУслугУслуги.Сумма
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.УчитыватьНДС
	|			ТОГДА СтавкиНДС.Ставка
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РеализацияТоваровУслугУслуги.СтавкаНДС.ДляОсвобожденногоОборота, ЛОЖЬ) = ИСТИНА
	|			ТОГДА ЕСТЬNULL(РеализацияТоваровУслугУслуги.СтавкаНДС.ДляОсвобожденногоОборота, ЛОЖЬ)
	|		ИНАЧЕ ЕСТЬNULL(РеализацияТоваровУслугУслуги.СтавкаНДС.МестоРеализацииНеРК, ЛОЖЬ)
	|	КОНЕЦ,
	|	РеализацияТоваровУслугУслуги.СтавкаНДС,
	|	РеализацияТоваровУслугУслуги.СуммаНДС,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.УчитыватьНДС
	|				И РеализацияТоваровУслуг.СуммаВключаетНДС
	|			ТОГДА РеализацияТоваровУслугУслуги.Сумма
	|		ИНАЧЕ РеализацияТоваровУслугУслуги.Сумма + РеализацияТоваровУслугУслуги.СуммаНДС
	|	КОНЕЦ,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(42)),
	|	""6"",
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(11)),
	|	1,
	|	ЗНАЧЕНИЕ(Справочник.ИсточникиПроисхождения.ПустаяСсылка),
	|	ЛОЖЬ
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО РеализацияТоваровУслугУслуги.Ссылка = РеализацияТоваровУслуг.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО РеализацияТоваровУслугУслуги.Номенклатура = СправочникНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтавкиНДС КАК СтавкиНДС
	|		ПО РеализацияТоваровУслугУслуги.СтавкаНДС = СтавкиНДС.Ссылка
	|ГДЕ
	|	РеализацияТоваровУслугУслуги.Ссылка = &СНТДокументОснование";
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Заполняет, в документе ЭСФ, реквизиты СвязанныйЭСФНомер и СвязанныйЭСФДата, СвязанныйЭСФРегистрационныйНомер.
//
Процедура ЗаполнитьДанныеСвязанногоЭСФ(СФ, ЭСФ)
	
 	ЭСФ.СвязанныйЭСФДата = '0001-01-01';
	ЭСФ.СвязанныйЭСФНомер = "";
	ЭСФ.СвязанныйЭСФРегистрационныйНомер = "";
	
	ПодчиненныйЭСФ = НайтиПодчиненныйЭСФ(СФ);
	
	Если ПодчиненныйЭСФ  <> Неопределено И ПодчиненныйЭСФ.Количество() > 0 Тогда
		
		ДанныеОсновного = ПодчиненныйЭСФ[0].Ссылка;
		ЭСФ.СвязанныйЭСФ = ДанныеОсновного;
		ЭСФ.СвязанныйЭСФДата = ДанныеОсновного.Дата;
		ЭСФ.СвязанныйЭСФНомер = ДанныеОсновного.Номер;
		ЭСФ.СвязанныйЭСФРегистрационныйНомер = ДанныеОсновного.РегистрационныйНомер;
		
	КонецЕсли;
		
КонецПроцедуры

Функция ДополнитьТекстЗапросаДляЭСФ() Экспорт
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА ДанныеСНТ.Поставщик ССЫЛКА Справочник.Организации
	|			ТОГДА ВЫБОР
	|					КОГДА ДанныеСНТ.Поставщик.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	|						ТОГДА ДанныеСНТ.Поставщик.ИндивидуальныйПредприниматель
	|					ИНАЧЕ ДанныеСНТ.Поставщик
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДанныеСНТ.ТипСНТ = ЗНАЧЕНИЕ(Перечисление.ТипыСНТ.ВозвратТоваров)
	|					ТОГДА ДанныеСНТ.Получатель
	|				ИНАЧЕ ДанныеСНТ.Поставщик
	|			КОНЕЦ
	|	КОНЕЦ КАК ОбъектДляПоискаАдреса,
	|	ВЫБОР
	|		КОГДА ДанныеСНТ.ТипСНТ = ЗНАЧЕНИЕ(Перечисление.ТипыСНТ.ВозвратТоваров)
	|			ТОГДА ЕСТЬNULL(ДанныеСНТ.Получатель.КБЕ, """")
	|		ИНАЧЕ ЕСТЬNULL(ДанныеСНТ.Поставщик.КБЕ, """")
	|	КОНЕЦ КАК КБе,
	|	ЕСТЬNULL(Банки.Наименование, """") КАК НаименованиеБанка,
	|	ЕСТЬNULL(БанковскиеСчета.НомерСчета, """") КАК ИИК,
	|	ЕСТЬNULL(Банки.БИК, """") КАК БИК,
	|	ВЫБОР
	|		КОГДА ДанныеСНТ.ПоставщикРозничнаяРеализация
	|				И НЕ ДанныеСНТ.Получатель ССЫЛКА Справочник.Организации
	|			ТОГДА &РозничнаяТорговля
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК Адрес,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК ПоверенныйОператор
	|ПОМЕСТИТЬ ОбъектыДляАдресовБанковскихСчетов
	|ИЗ
	|	ДанныеСНТ КАК ДанныеСНТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчета КАК БанковскиеСчета
	|		ПО (ВЫБОР
	|				КОГДА ДанныеСНТ.ТипСНТ = ЗНАЧЕНИЕ(Перечисление.ТипыСНТ.ВозвратТоваров)
	|					ТОГДА ЕСТЬNULL(ДанныеСНТ.ДокументОснование.БанковскийСчетОрганизации, ДанныеСНТ.Получатель.ОсновнойБанковскийСчет) = БанковскиеСчета.Ссылка
	|				ИНАЧЕ ЕСТЬNULL(ДанныеСНТ.ДокументОснование.БанковскийСчетОрганизации, ДанныеСНТ.Поставщик.ОсновнойБанковскийСчет) = БанковскиеСчета.Ссылка
	|			КОНЕЦ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Банки КАК Банки
	|		ПО (БанковскиеСчета.Банк = Банки.Ссылка)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ДанныеСНТ.ТипСНТ = ЗНАЧЕНИЕ(Перечисление.ТипыСНТ.ВозвратТоваров)
	|			ТОГДА ДанныеСНТ.Поставщик
	|		ИНАЧЕ ДанныеСНТ.Получатель
	|	КОНЕЦ,
	|	"""",
	|	"""",
	|	ЕСТЬNULL(БанковскиеСчета.НомерСчета, """"),
	|	"""",
	|	ВЫБОР
	|		КОГДА ДанныеСНТ.ПоставщикРозничнаяРеализация
	|				И ДанныеСНТ.Получатель ССЫЛКА Справочник.Организации
	|			ТОГДА &РозничнаяТорговля
	|		ИНАЧЕ NULL
	|	КОНЕЦ,
	|	ЕСТЬNULL(ДанныеСНТ.ДоговорПоставки.ПоверенныйОператор, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
	|ИЗ
	|	ДанныеСНТ КАК ДанныеСНТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчета КАК БанковскиеСчета
	|		ПО (ВЫБОР
	|				КОГДА ДанныеСНТ.ТипСНТ = ЗНАЧЕНИЕ(Перечисление.ТипыСНТ.ВозвратТоваров)
	|					ТОГДА ЕСТЬNULL(ДанныеСНТ.ДокументОснование.БанковскийСчетОрганизации, ДанныеСНТ.Поставщик.ОсновнойБанковскийСчет) = БанковскиеСчета.Ссылка
	|				ИНАЧЕ ЕСТЬNULL(ДанныеСНТ.ДокументОснование.БанковскийСчетОрганизации, ДанныеСНТ.Получатель.ОсновнойБанковскийСчет) = БанковскиеСчета.Ссылка
	|			КОНЕЦ)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектДляПоискаАдреса
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ОбъектыДляПоискаАдресов.ОбъектДляПоискаАдреса КАК Объект,
	|	ЕСТЬNULL(ОбъектыДляПоискаАдресов.Адрес, ВЫРАЗИТЬ(КонтактнаяИнформация.Представление КАК СТРОКА(400))) КАК Адрес,
	|	ОбъектыДляПоискаАдресов.НаименованиеБанка КАК НаименованиеБанка,
	|	ОбъектыДляПоискаАдресов.ИИК КАК ИИК,
	|	ОбъектыДляПоискаАдресов.БИК КАК БИК,
	|	ОбъектыДляПоискаАдресов.КБе КАК КБе,
	|	ОбъектыДляПоискаАдресов.ПоверенныйОператор КАК ПоверенныйОператор,
	|	ВЫРАЗИТЬ(КонтактнаяИнформацияПоверенныйОператор.Представление КАК СТРОКА(400)) КАК ПоверенныйОператорАдрес
	|ПОМЕСТИТЬ АдресаБанковскиеРеквизиты
	|ИЗ
	|	ОбъектыДляАдресовБанковскихСчетов КАК ОбъектыДляПоискаАдресов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ПО (КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|			И ОбъектыДляПоискаАдресов.ОбъектДляПоискаАдреса = КонтактнаяИнформация.Объект
	|			И (КонтактнаяИнформация.Вид В (ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресКонтрагента), ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресОрганизации), ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресФизЛица)))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформацияПоверенныйОператор
	|		ПО (КонтактнаяИнформацияПоверенныйОператор.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|			И ОбъектыДляПоискаАдресов.ПоверенныйОператор = КонтактнаяИнформацияПоверенныйОператор.Объект
	|			И (КонтактнаяИнформацияПоверенныйОператор.Вид В (ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресКонтрагента), ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресОрганизации), ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресФизЛица)))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ДанныеСНТ.ТипСНТ = ЗНАЧЕНИЕ(Перечисление.ТипыСНТ.ВозвратТоваров)
	|			ТОГДА ДанныеСНТ.Получатель
	|		ИНАЧЕ ДанныеСНТ.Поставщик
	|	КОНЕЦ КАК Поставщик,
	|	ВЫБОР
	|		КОГДА ДанныеСНТ.ТипСНТ = ЗНАЧЕНИЕ(Перечисление.ТипыСНТ.ВозвратТоваров)
	|			ТОГДА ЕСТЬNULL(ДанныеСНТ.Получатель.НомерСвидетельстваПоНДС, """")
	|		ИНАЧЕ ЕСТЬNULL(ДанныеСНТ.Поставщик.НомерСвидетельстваПоНДС, """")
	|	КОНЕЦ КАК Поставщик_НомерСвидетельстваПоНДС,
	|	ВЫБОР
	|		КОГДА ДанныеСНТ.ТипСНТ = ЗНАЧЕНИЕ(Перечисление.ТипыСНТ.ВозвратТоваров)
	|			ТОГДА ЕСТЬNULL(ДанныеСНТ.Получатель.СерияСвидетельстваПоНДС, """")
	|		ИНАЧЕ ЕСТЬNULL(ДанныеСНТ.Поставщик.СерияСвидетельстваПоНДС, """")
	|	КОНЕЦ КАК Поставщик_СерияСвидетельстваПоНДС,
	|	АдресБанкПоставщика.Адрес КАК Поставщик_Адрес,
	|	АдресБанкПоставщика.КБе КАК Поставщик_КБе,
	|	АдресБанкПоставщика.ИИК КАК Поставщик_ИИК,
	|	АдресБанкПоставщика.БИК КАК Поставщик_БИК,
	|	АдресБанкПоставщика.НаименованиеБанка КАК Поставщик_НаименованиеБанка
	|ПОМЕСТИТЬ ДанныеПоПоставщику
	|ИЗ
	|	ДанныеСНТ КАК ДанныеСНТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ АдресаБанковскиеРеквизиты КАК АдресБанкПоставщика
	|		ПО (ВЫБОР
	|				КОГДА ДанныеСНТ.Поставщик ССЫЛКА Справочник.Организации
	|					ТОГДА ВЫБОР
	|							КОГДА ДанныеСНТ.Поставщик.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	|								ТОГДА ДанныеСНТ.Поставщик.ИндивидуальныйПредприниматель = АдресБанкПоставщика.Объект
	|							ИНАЧЕ ДанныеСНТ.Поставщик = АдресБанкПоставщика.Объект
	|						КОНЕЦ
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ДанныеСНТ.ТипСНТ = ЗНАЧЕНИЕ(Перечисление.ТипыСНТ.ВозвратТоваров)
	|							ТОГДА ДанныеСНТ.Получатель = АдресБанкПоставщика.Объект
	|						ИНАЧЕ ДанныеСНТ.Поставщик = АдресБанкПоставщика.Объект
	|					КОНЕЦ
	|			КОНЕЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ДанныеСНТ.ТипСНТ = ЗНАЧЕНИЕ(Перечисление.ТипыСНТ.ВозвратТоваров)
	|			ТОГДА ДанныеСНТ.Поставщик
	|		ИНАЧЕ ДанныеСНТ.Получатель
	|	КОНЕЦ КАК Получатель,
	|	ВЫБОР
	|		КОГДА ДанныеСНТ.ТипСНТ = ЗНАЧЕНИЕ(Перечисление.ТипыСНТ.ВозвратТоваров)
	|			ТОГДА ЕСТЬNULL(ДанныеСНТ.Поставщик.ГосударственноеУчреждение, ЛОЖЬ)
	|		ИНАЧЕ ЕСТЬNULL(ДанныеСНТ.Получатель.ГосударственноеУчреждение, ЛОЖЬ)
	|	КОНЕЦ КАК ГосударственноеУчреждение,
	|	АдресБанкПолучателя.Адрес КАК Получатель_Адрес,
	|	АдресБанкПолучателя.ПоверенныйОператор,
	|	АдресБанкПолучателя.ПоверенныйОператор.ИдентификационныйКодЛичности КАК ПоверенныйПокупателяБИН,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(АдресБанкПолучателя.ПоверенныйОператорАдрес КАК СТРОКА(400)), """") КАК ПоверенныйПокупателяАдресМестонахождения,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(АдресБанкПолучателя.ПоверенныйОператор.НаименованиеПолное КАК СТРОКА(400))) <> """"
	|			ТОГДА ВЫРАЗИТЬ(АдресБанкПолучателя.ПоверенныйОператор.НаименованиеПолное КАК СТРОКА(400))
	|		ИНАЧЕ АдресБанкПолучателя.ПоверенныйОператор.Наименование
	|	КОНЕЦ КАК ПоверенныйПокупателяНаименование,
	|	ДанныеСНТ.КонтрагентОсновнойБанковскийСчет.Банк.БИК КАК ГосУчреждениеБИК,
	|	ДанныеСНТ.КонтрагентОсновнойБанковскийСчет.НомерСчета КАК ГосУчреждениеИИК
    |ПОМЕСТИТЬ ДанныеПоПолучателю
	|ИЗ
	|	ДанныеСНТ КАК ДанныеСНТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ АдресаБанковскиеРеквизиты КАК АдресБанкПолучателя
	|		ПО (ВЫБОР
	|				КОГДА ДанныеСНТ.ТипСНТ = ЗНАЧЕНИЕ(Перечисление.ТипыСНТ.ВозвратТоваров)
	|					ТОГДА ДанныеСНТ.Поставщик = АдресБанкПолучателя.Объект
	|				ИНАЧЕ ДанныеСНТ.Получатель = АдресБанкПолучателя.Объект
	|			КОНЕЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|	ВЫБРАТЬ
	|	ДанныеСНТ.ДокументОснование,
	|	ЕСТЬNULL(СчетФактураВыданный.Ссылка, ЗНАЧЕНИЕ(Документ.СчетФактураВыданный.ПустаяСсылка)) КАК СчетФактура,
	|	ЕСТЬNULL(СчетФактураВыданный.ВидСчетаФактуры, ЗНАЧЕНИЕ(Перечисление.ВидыСчетовФактур.ПустаяСсылка)) КАК ВидСчетаФактуры,
	|	ЕСТЬNULL(СчетФактураВыданный.ОсновнойСчетФактура, ЗНАЧЕНИЕ(Документ.СчетФактураВыданный.ПустаяСсылка)) КАК ОсновнойСчетФактура,
	|	НАЧАЛОПЕРИОДА(СчетФактураВыданный.ДатаСовершенияОборотаПоРеализации, ДЕНЬ) КАК ДатаОборота,
	|	СчетФактураВыданный.СтруктурноеПодразделение КАК СтруктурноеПодразделение,
	|	ДанныеСНТ.ТипСНТ КАК ТипСНТ,
	|	ВЫБОР
	|		КОГДА ДанныеСНТ.ТипСНТ = ЗНАЧЕНИЕ(Перечисление.ТипыСНТ.ВозвратТоваров)
	|		ТОГДА ЕСТЬNULL(СчетФактураВыданный.ОсновнойСчетФактура, ЗНАЧЕНИЕ(Документ.СчетФактураВыданный.ПустаяСсылка))
	|		ИНАЧЕ ЕСТЬNULL(СчетФактураВыданный.Ссылка, ЗНАЧЕНИЕ(Документ.СчетФактураВыданный.ПустаяСсылка))
	|	КОНЕЦ СчетФактураЭСФ
	|ПОМЕСТИТЬ ДанныеПоСчетФактуре
	|ИЗ
	|	ДанныеСНТ КАК ДанныеСНТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|		ПО ДанныеСНТ.ДокументОснование = СчетФактураВыданный.ДокументОснование
	|			И	(СчетФактураВыданный.ПометкаУдаления = ЛОЖЬ)
	|			И	(ВЫБОР 
	|				КОГДА &АктуальныйСФ <> НЕОПРЕДЕЛЕНО 
	|				ТОГДА СчетФактураВыданный.Ссылка = &АктуальныйСФ 
	|				ИНАЧЕ ИСТИНА 
	|				КОНЕЦ)
	|			И	(ВЫБОР 
	|				КОГДА &ПерезаполнениеЭСФ 
	|				ТОГДА СчетФактураВыданный.Ссылка = &АктуальныйСФ 
	|				ИНАЧЕ ИСТИНА 
	|				КОНЕЦ)
	|ГДЕ
	|	ДанныеСНТ.ДокументОснование <> НЕОПРЕДЕЛЕНО
	|
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДанныеПоСчетФактуре.ДокументОснование КАК ДокументОснование,
	|	ЭСФ.Ссылка КАК ОсновнойЭСФ,
	|	ЭСФ.Номер КАК ОсновнойЭСФНомер,
	|	ЭСФ.Дата КАК ОсновнойЭСФДата,
	|	ЭСФ.РегистрационныйНомер КАК ОсновнойЭСФРегистрационныйНомер
	|ПОМЕСТИТЬ ДанныеПоОсновнымЭСФ
	|ИЗ
	|	ДанныеПоСчетФактуре КАК ДанныеПоСчетФактуре
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЭСФ КАК ЭСФ
	|		ПО (ДанныеПоСчетФактуре.СчетФактураЭСФ = ЭСФ.СчетФактура) 
	|			И (ЭСФ.СчетФактура <> НЕОПРЕДЕЛЕНО)
	|			И (ЭСФ.СчетФактура <> ЗНАЧЕНИЕ(Документ.СчетФактураПолученный.ПустаяСсылка))
	|			И (ЭСФ.СчетФактура <> ЗНАЧЕНИЕ(Документ.СчетФактураВыданный.ПустаяСсылка))
	|ГДЕ
	|	ДанныеПоСчетФактуре.ВидСчетаФактуры <> ЗНАЧЕНИЕ(Перечисление.ВидыСчетовФактур.ПустаяСсылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОсновнойЭСФДата УБЫВ
	|;";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&РозничнаяТорговля", НСтр("ru = '""Розничная торговля""'"));
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ДополнитьТекстЗапросаДляЭСФПеремещениеЕАЭС() Экспорт

	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СНТ.Ссылка КАК Ссылка,
	|	СНТ.ВидОперации КАК ВидОперации,
	|	СНТ.ВидПеремещения КАК ВидПеремещения,
	|	СНТ.ДокументОснование КАК ДокументОснование,
	|	СНТ.Грузополучатель КАК Грузополучатель,
	|	СНТ.ГрузополучательНаименование КАК ГрузополучательНаименование,
	|	СНТ.ГрузополучательИдентификатор КАК ГрузополучательИдентификатор,
	|	СНТ.Получатель КАК Получатель,
	|	СНТ.ПолучательИдентификатор КАК ПолучательИдентификатор,
	|	СНТ.ПолучательНаименование КАК ПолучательНаименование
	|ПОМЕСТИТЬ вт_СНТ
	|ИЗ
	|	Документ.СНТ КАК СНТ
	|ГДЕ
	|	СНТ.Ссылка В(&МассивСНТ)
	|	И СНТ.ДокументОснование <> ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)
	|	И СНТ.ДокументОснование.ПометкаУдаления = ЛОЖЬ
	|	И СНТ.ДокументОснование ССЫЛКА Документ.РеализацияТоваровУслуг
	|	И СНТ.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСНТ.ПеремещениеМеждуФилиалами)
	|	И СНТ.ВидПеремещения = ЗНАЧЕНИЕ(Перечисление.ВидыПеремещенияСНТ.ВПределахОдногоЛицаЕАЭС)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СНТ.Ссылка КАК Ссылка,
	|	СНТ.ДокументОснование КАК ДокументОснование,
	|	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
	|	Контрагенты.Ссылка КАК Грузополучатель,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(Контрагенты.НаименованиеПолное КАК СТРОКА(200))) <> """"""""
	|			ТОГДА ВЫРАЗИТЬ(Контрагенты.НаименованиеПолное КАК СТРОКА(200))
	|		ИНАЧЕ Контрагенты.Наименование
	|	КОНЕЦ КАК ГрузополучательНаименование,
	|	Контрагенты.ИдентификационныйКодЛичности КАК ГрузополучательИдентификатор,
	|	Контрагенты.Ссылка КАК Получатель,
	|	Контрагенты.ИдентификационныйКодЛичности КАК ПолучательИдентификатор,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(Контрагенты.НаименованиеПолное КАК СТРОКА(200))) <> """"""""
	|			ТОГДА ВЫРАЗИТЬ(Контрагенты.НаименованиеПолное КАК СТРОКА(200))
	|		ИНАЧЕ Контрагенты.Наименование
	|	КОНЕЦ КАК ПолучательНаименование
	|ПОМЕСТИТЬ вт_ДанныеПоСобственномуКонтрагенту
	|ИЗ
	|	вт_СНТ КАК СНТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|			ПО РеализацияТоваровУслуг.Контрагент = Контрагенты.Ссылка
	|		ПО СНТ.ДокументОснование = РеализацияТоваровУслуг.Ссылка
	|			И (РеализацияТоваровУслуг.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРеализацияТоваров.ПередачаСтруктурномуПодразделению));";	

	Возврат ТекстЗапроса;
	
КонецФункции

Функция ВыборкаПолучателейСНТ(СчетФактура) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УчастникиСД.Ссылка КАК СчетФактура,
	|	УчастникиСД.Ссылка.Грузополучатель КАК Грузополучатель,
	|	УчастникиСД.НомерСтроки КАК НомерСтроки,
	|	УчастникиСД.УчастникСовместнойДеятельности.ИдентификационныйКодЛичности КАК Получатель_ПолучательИдентификатор,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(УчастникиСД.УчастникСовместнойДеятельности.НаименованиеПолное КАК СТРОКА(400))) <> """"
	|			ТОГДА ВЫРАЗИТЬ(УчастникиСД.УчастникСовместнойДеятельности.НаименованиеПолное КАК СТРОКА(400))
	|		ИНАЧЕ УчастникиСД.УчастникСовместнойДеятельности.Наименование
	|	КОНЕЦ КАК Получатель_ПолучательНаименование,
	|	УчастникиСД.УчастникСовместнойДеятельности КАК Получатель_Получатель,
	|	УчастникиСД.УчастникСовместнойДеятельности.СерияСвидетельстваПоНДС КАК Получатель_СерияСвидетельстваПоНДС,
	|	УчастникиСД.УчастникСовместнойДеятельности.НомерСвидетельстваПоНДС КАК Получатель_НомерСвидетельстваПоНДС,
	|	УчастникиСД.УчастникСовместнойДеятельности.КБЕ КАК Получатель_КБе,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.ДоговорСовместнойДеятельности, ЛОЖЬ) КАК Получатель_УчастникСовместнойДеятельности,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.УчастникСРП, ЛОЖЬ) КАК Получатель_УчастникСРП,
	|	УчастникиСД.ДоляУчастия КАК Получатель_ДоляУчастия
	|ПОМЕСТИТЬ ВТ_УчастникиСД
	|ИЗ
	|	Документ.СчетФактураВыданный.УчастникиСовместнойДеятельности КАК УчастникиСД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО УчастникиСД.Ссылка.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка
	|ГДЕ
	|	УчастникиСД.Ссылка = &СчетФактура
	|ИНДЕКСИРОВАТЬ ПО
	|	Получатель_Получатель
	|;
	|///////////////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеУчастниковСД.СчетФактура.Дата КАК Дата,
	|	ДанныеУчастниковСД.СчетФактура КАК СчетФактура,
	|	ДанныеУчастниковСД.Грузополучатель КАК Грузополучатель,
	|	ДанныеУчастниковСД.Получатель_ПолучательИдентификатор,
	|	ДанныеУчастниковСД.Получатель_ПолучательНаименование,
	|	ДанныеУчастниковСД.Получатель_Получатель,
	|	ДанныеУчастниковСД.Получатель_СерияСвидетельстваПоНДС,
	|	ДанныеУчастниковСД.Получатель_НомерСвидетельстваПоНДС,
	|	ДанныеУчастниковСД.Получатель_КБе,
	|	ДанныеУчастниковСД.Получатель_УчастникСовместнойДеятельности,
	|	ДанныеУчастниковСД.Получатель_УчастникСРП,
	|	ДанныеУчастниковСД.Получатель_ДоляУчастия КАК Получатель_ДоляУчастия,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(КонтактнаяИнформация.Представление КАК СТРОКА(400)), """") КАК Получатель_Адрес,
	|	""KZ"" КАК Получатель_КодСтраны
	|ИЗ
	|	ВТ_УчастникиСД КАК ДанныеУчастниковСД
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ПО ДанныеУчастниковСД.Получатель_Получатель = КонтактнаяИнформация.Объект
	|			И (КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|			И (КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресКонтрагента))
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДанныеУчастниковСД.НомерСтроки
	|";
	
	Запрос.УстановитьПараметр("СчетФактура", СчетФактура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Возврат Выборка;
	
КонецФункции

#КонецОбласти

Процедура ОбработкаВыбораСНТ(ПТУ, СНТ) Экспорт
	
	ОбъектСНТ = СНТ.ПолучитьОбъект();
	ОбъектСНТ.ДокументОснование = ПТУ;
	ОбъектСНТ.Записать();
	
КонецПроцедуры

Функция ПроверитьИмяДокументаПриСозданииЭлементовФормыДляВводаСНТ(ИмяФормы) Экспорт
	
	Возврат ?(СтрНайти(ИмяФормы, "ПоступлениеТоваровУслуг") <> 0, Истина, Ложь);
	
КонецФункции

Процедура ПолучитьАдресПоставщикаПолучателяВЭСФИзСНТ(ПриемникДокументЭСФ, Организация, Дата) Экспорт
	
	//Для заполнения адреса поставщика и получателя в ЕРП, когда на основании СНТ вводится ЭСФ
	
КонецПроцедуры

Функция ПолучитьСсылкуНаЭСФПриВводеНовогоСНТ(ДокументОснование) Экспорт

	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") 
		ИЛИ ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя") 
		ИЛИ ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ОтчетОРозничныхПродажах") Тогда
		
		СвязанныйСФ = НайтиПодчиненныйСчетФактуру(ДокументОснование, "СчетФактураВыданный");
	Иначе
		СвязанныйСФ = НайтиПодчиненныйСчетФактуру(ДокументОснование, "СчетФактураПолученный");
	КонецЕсли;
	
	Если СвязанныйСФ.Количество() <> 0 Тогда
		
		СвязанныйЭСФ = НайтиПодчиненныйЭСФ(СвязанныйСФ);
		Если СвязанныйЭСФ.Количество() <> 0 Тогда 
			Возврат СвязанныйЭСФ[0].Ссылка;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	Иначе
		Возврат Неопределено; 
	КонецЕсли;	
	
КонецФункции

Процедура ЗаполнитьСсылкуНаСНТВЭСФ(ДокументЭСФ, СНТ) Экспорт
	
	Если Не ЗначениеЗаполнено(ДокументЭСФ.СНТ) Тогда
		ЭСФОбъект = ДокументЭСФ.ПолучитьОбъект();
		ЭСФОбъект.СНТ = СНТ;
		ЭСФОбъект.Записать();	
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьЗначениеПараметраКонтрагентРозница() Экспорт
	
	Возврат Неопределено;
	//Возврат ПредопределенноеЗначение("Справочник.Контрагенты.РозничныйПокупатель");
КонецФункции

Функция ПолучитьКурсВалютыПриСозданииСНТ(Валюта, Дата) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	|	КурсыВалютСрезПоследних.Валюта КАК Валюта,
	|	КурсыВалютСрезПоследних.Курс КАК Курс
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних(&ДатаДокумента, Валюта = &Валюта) КАК КурсыВалютСрезПоследних"; 
	
	Запрос.УстановитьПараметр("ДатаДокумента", Дата);
	Запрос.УстановитьПараметр("Валюта", 	   Валюта);
	Выборка = Запрос.Выполнить().Выбрать();
						
	Пока Выборка.Следующий() Цикл
		
		КурсВалюты = Выборка.Курс;
		
	КонецЦикла;
			
	Возврат КурсВалюты;
	
КонецФункции

Функция ПолучитьМассивСкрываемыхПолейАкцизы() Экспорт 
	
	МассивИменПолейАкцизы = Новый Массив();
	
	Возврат МассивИменПолейАкцизы;
	
КонецФункции

Функция ПолучитьФОКонтрагентыПартнеры() Экспорт
	Возврат Неопределено;
КонецФункции

#Область СоответствиеТоваровИЕдиницИзмерений

Функция ТекстЗапросаСНТТоварыЕдиницыИзмерения(СозданиеВременнойТаблицы = ЛОЖЬ) Экспорт 
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА СНТТовары.ЕдиницаИзмеренияКод <> &ПустаяСтрока
	|			ТОГДА СНТТовары.ЕдиницаИзмеренияКод
	|		ИНАЧЕ СНТТовары.ЕдиницаИзмерения.Наименование
	|	КОНЕЦ КАК ЕдиницаИзмеренияКод,
	|	ВЫБОР
	|		КОГДА СНТТовары.ТоварНаименование <> &ПустаяСтрока
	|			ТОГДА СНТТовары.ТоварНаименование
	|	КОНЕЦ КАК ТоварНаименование,
	|	 СНТТовары.Ссылка,
	|	 СНТТовары.ЕдиницаИзмерения,
	|	 СНТТовары.Товар" 
	+ ?(СозданиеВременнойТаблицы, Символы.ПС + "ПОМЕСТИТЬ вт_СНТЕдиницыИзмерения", "") + Символы.ПС +
	"ИЗ
	|	Документ.СНТ.Товары КАК СНТТовары
	|ГДЕ
	|	СНТТовары.ТоварНаименование <> &ПустаяСтрока
	|	И СНТТовары.Ссылка В(&МассивСНТ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА СНТТовары.ТоварНаименование <> &ПустаяСтрока
	|			ТОГДА СНТТовары.ТоварНаименование
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СНТТовары.ЕдиницаИзмеренияКод <> &ПустаяСтрока
	|			ТОГДА СНТТовары.ЕдиницаИзмеренияКод
	|		ИНАЧЕ СНТТовары.ЕдиницаИзмерения.Наименование
	|	КОНЕЦ,
	|	 СНТТовары.Ссылка,
	|	 СНТТовары.ЕдиницаИзмерения,
	|	 СНТТовары.Товар
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТоварыВС.ЕдиницаИзмерения.Код,
	|	ВЫБОР
	|		КОГДА ТоварыВС.ТоварНаименование <> &ПустаяСтрока
	|			ТОГДА ТоварыВС.ТоварНаименование
	|	КОНЕЦ,
	|	 ТоварыВС.Ссылка,
	|	 ТоварыВС.ЕдиницаИзмерения,
	|	 ТоварыВС.Товар
	|ИЗ
	|	Документ.СНТ.ТоварыВС КАК ТоварыВС
	|ГДЕ
	|	ТоварыВС.ТоварНаименование <> &ПустаяСтрока
	|	И ТоварыВС.Ссылка В(&МассивСНТ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ТоварыВС.ТоварНаименование <> &ПустаяСтрока
	|			ТОГДА ТоварыВС.ТоварНаименование
	|	КОНЕЦ,
	|	ТоварыВС.ЕдиницаИзмерения.Код,
	|	 ТоварыВС.Ссылка,
	|	 ТоварыВС.ЕдиницаИзмерения,
	|	 ТоварыВС.Товар
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СНТЭтиловыйСпирт.ЕдиницаИзмерения.Код,
	|	ВЫБОР
	|		КОГДА СНТЭтиловыйСпирт.ТоварНаименование <> &ПустаяСтрока
	|			ТОГДА СНТЭтиловыйСпирт.ТоварНаименование
	|	КОНЕЦ,
	|	 СНТЭтиловыйСпирт.Ссылка,
	|	 СНТЭтиловыйСпирт.ЕдиницаИзмерения,
	|	 СНТЭтиловыйСпирт.Товар
	|ИЗ
	|	Документ.СНТ.ЭтиловыйСпирт КАК СНТЭтиловыйСпирт
	|ГДЕ
	|	СНТЭтиловыйСпирт.ТоварНаименование <> &ПустаяСтрока
	|	И СНТЭтиловыйСпирт.Ссылка В(&МассивСНТ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА СНТЭтиловыйСпирт.ТоварНаименование <> &ПустаяСтрока
	|			ТОГДА СНТЭтиловыйСпирт.ТоварНаименование
	|	КОНЕЦ,
	|	СНТЭтиловыйСпирт.ЕдиницаИзмерения.Код,
	|	 СНТЭтиловыйСпирт.Ссылка,
	|	 СНТЭтиловыйСпирт.ЕдиницаИзмерения,
	|	 СНТЭтиловыйСпирт.Товар
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СНТВиноматериал.ЕдиницаИзмерения.Код,
	|	ВЫБОР
	|		КОГДА СНТВиноматериал.ТоварНаименование <> &ПустаяСтрока
	|			ТОГДА СНТВиноматериал.ТоварНаименование
	|	КОНЕЦ,
	|	 СНТВиноматериал.Ссылка,
	|	 СНТВиноматериал.ЕдиницаИзмерения,
	|	 СНТВиноматериал.Товар
	|ИЗ
	|	Документ.СНТ.Виноматериал КАК СНТВиноматериал
	|ГДЕ
	|	СНТВиноматериал.ТоварНаименование <> &ПустаяСтрока
	|	И СНТВиноматериал.Ссылка В(&МассивСНТ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА СНТВиноматериал.ТоварНаименование <> &ПустаяСтрока
	|			ТОГДА СНТВиноматериал.ТоварНаименование
	|	КОНЕЦ,
	|	СНТВиноматериал.ЕдиницаИзмерения.Код,
	|	 СНТВиноматериал.Ссылка,
	|	 СНТВиноматериал.ЕдиницаИзмерения,
	|	 СНТВиноматериал.Товар
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СНТПивоПивныеНапитки.ЕдиницаИзмерения.Код,
	|	ВЫБОР
	|		КОГДА СНТПивоПивныеНапитки.ТоварНаименование <> &ПустаяСтрока
	|			ТОГДА СНТПивоПивныеНапитки.ТоварНаименование
	|	КОНЕЦ,
	|	 СНТПивоПивныеНапитки.Ссылка,
	|	 СНТПивоПивныеНапитки.ЕдиницаИзмерения,
	|	 СНТПивоПивныеНапитки.Товар
	|ИЗ
	|	Документ.СНТ.ПивоПивныеНапитки КАК СНТПивоПивныеНапитки
	|ГДЕ
	|	СНТПивоПивныеНапитки.ТоварНаименование <> &ПустаяСтрока
	|	И СНТПивоПивныеНапитки.Ссылка В(&МассивСНТ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА СНТПивоПивныеНапитки.ТоварНаименование <> &ПустаяСтрока
	|			ТОГДА СНТПивоПивныеНапитки.ТоварНаименование
	|	КОНЕЦ,
	|	СНТПивоПивныеНапитки.ЕдиницаИзмерения.Код,
	|	 СНТПивоПивныеНапитки.Ссылка,
	|	 СНТПивоПивныеНапитки.ЕдиницаИзмерения,
	|	 СНТПивоПивныеНапитки.Товар
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СНТАлкогольнаяПродукцияКромеПива.ЕдиницаИзмерения.Код,
	|	ВЫБОР
	|		КОГДА СНТАлкогольнаяПродукцияКромеПива.ТоварНаименование <> &ПустаяСтрока
	|			ТОГДА СНТАлкогольнаяПродукцияКромеПива.ТоварНаименование
	|	КОНЕЦ,
	|	 СНТАлкогольнаяПродукцияКромеПива.Ссылка,
	|	 СНТАлкогольнаяПродукцияКромеПива.ЕдиницаИзмерения,
	|	 СНТАлкогольнаяПродукцияКромеПива.Товар
	|ИЗ
	|	Документ.СНТ.АлкогольнаяПродукцияКромеПива КАК СНТАлкогольнаяПродукцияКромеПива
	|ГДЕ
	|	СНТАлкогольнаяПродукцияКромеПива.ТоварНаименование <> &ПустаяСтрока
	|	И СНТАлкогольнаяПродукцияКромеПива.Ссылка В(&МассивСНТ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА СНТАлкогольнаяПродукцияКромеПива.ТоварНаименование <> &ПустаяСтрока
	|			ТОГДА СНТАлкогольнаяПродукцияКромеПива.ТоварНаименование
	|	КОНЕЦ,
	|	СНТАлкогольнаяПродукцияКромеПива.ЕдиницаИзмерения.Код,
	|	 СНТАлкогольнаяПродукцияКромеПива.Ссылка,
	|	 СНТАлкогольнаяПродукцияКромеПива.ЕдиницаИзмерения,
	|	 СНТАлкогольнаяПродукцияКромеПива.Товар
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СНТДанныеПоНефтепродуктам.ЕдиницаИзмерения.Код,
	|	ВЫБОР
	|		КОГДА СНТДанныеПоНефтепродуктам.ТоварНаименование <> &ПустаяСтрока
	|			ТОГДА СНТДанныеПоНефтепродуктам.ТоварНаименование
	|	КОНЕЦ,
	|	 СНТДанныеПоНефтепродуктам.Ссылка,
	|	 СНТДанныеПоНефтепродуктам.ЕдиницаИзмерения,
	|	 СНТДанныеПоНефтепродуктам.Товар
	|ИЗ
	|	Документ.СНТ.ДанныеПоНефтепродуктам КАК СНТДанныеПоНефтепродуктам
	|ГДЕ
	|	СНТДанныеПоНефтепродуктам.ТоварНаименование <> &ПустаяСтрока
	|	И СНТДанныеПоНефтепродуктам.Ссылка В(&МассивСНТ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА СНТДанныеПоНефтепродуктам.ТоварНаименование <> &ПустаяСтрока
	|			ТОГДА СНТДанныеПоНефтепродуктам.ТоварНаименование
	|	КОНЕЦ,
	|	СНТДанныеПоНефтепродуктам.ЕдиницаИзмерения.Код,
	|	 СНТДанныеПоНефтепродуктам.Ссылка,
	|	 СНТДанныеПоНефтепродуктам.ЕдиницаИзмерения,
	|	 СНТДанныеПоНефтепродуктам.Товар
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СНТДанныеПоБиотопливу.ЕдиницаИзмерения.Код,
	|	ВЫБОР
	|		КОГДА СНТДанныеПоБиотопливу.ТоварНаименование <> &ПустаяСтрока
	|			ТОГДА СНТДанныеПоБиотопливу.ТоварНаименование
	|	КОНЕЦ,
	|	 СНТДанныеПоБиотопливу.Ссылка,
	|	 СНТДанныеПоБиотопливу.ЕдиницаИзмерения,
	|	 СНТДанныеПоБиотопливу.Товар
	|ИЗ
	|	Документ.СНТ.ДанныеПоБиотопливу КАК СНТДанныеПоБиотопливу
	|ГДЕ
	|	СНТДанныеПоБиотопливу.ТоварНаименование <> &ПустаяСтрока
	|	И СНТДанныеПоБиотопливу.Ссылка В(&МассивСНТ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА СНТДанныеПоБиотопливу.ТоварНаименование <> &ПустаяСтрока
	|			ТОГДА СНТДанныеПоБиотопливу.ТоварНаименование
	|	КОНЕЦ,
	|	СНТДанныеПоБиотопливу.ЕдиницаИзмерения.Код,
	|	 СНТДанныеПоБиотопливу.Ссылка,
	|	 СНТДанныеПоБиотопливу.ЕдиницаИзмерения,
	|	 СНТДанныеПоБиотопливу.Товар
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СНТТабачнаяПродукция.ЕдиницаИзмерения.Код,
	|	ВЫБОР
	|		КОГДА СНТТабачнаяПродукция.ТоварНаименование <> &ПустаяСтрока
	|			ТОГДА СНТТабачнаяПродукция.ТоварНаименование
	|	КОНЕЦ,
	|	 СНТТабачнаяПродукция.Ссылка,
	|	 СНТТабачнаяПродукция.ЕдиницаИзмерения,
	|	 СНТТабачнаяПродукция.Товар
	|ИЗ
	|	Документ.СНТ.ТабачнаяПродукция КАК СНТТабачнаяПродукция
	|ГДЕ
	|	СНТТабачнаяПродукция.ТоварНаименование <> &ПустаяСтрока
	|	И СНТТабачнаяПродукция.Ссылка В(&МассивСНТ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА СНТТабачнаяПродукция.ТоварНаименование <> &ПустаяСтрока
	|			ТОГДА СНТТабачнаяПродукция.ТоварНаименование
	|	КОНЕЦ,
	|	СНТТабачнаяПродукция.ЕдиницаИзмерения.Код,
	|	 СНТТабачнаяПродукция.Ссылка,
	|	 СНТТабачнаяПродукция.ЕдиницаИзмерения,
	|	 СНТТабачнаяПродукция.Товар
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СНТДругиеТоварыЦифроваяМаркировка.ЕдиницаИзмерения.Код,
	|	ВЫБОР
	|		КОГДА СНТДругиеТоварыЦифроваяМаркировка.ТоварНаименование <> &ПустаяСтрока
	|			ТОГДА СНТДругиеТоварыЦифроваяМаркировка.ТоварНаименование
	|	КОНЕЦ,
	|	 СНТДругиеТоварыЦифроваяМаркировка.Ссылка,
	|	 СНТДругиеТоварыЦифроваяМаркировка.ЕдиницаИзмерения,
	|	 СНТДругиеТоварыЦифроваяМаркировка.Товар
	|ИЗ
	|	Документ.СНТ.ДругиеТоварыЦифроваяМаркировка КАК СНТДругиеТоварыЦифроваяМаркировка
	|ГДЕ
	|	СНТДругиеТоварыЦифроваяМаркировка.ТоварНаименование <> &ПустаяСтрока
	|	И СНТДругиеТоварыЦифроваяМаркировка.Ссылка В(&МассивСНТ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА СНТДругиеТоварыЦифроваяМаркировка.ТоварНаименование <> &ПустаяСтрока
	|			ТОГДА СНТДругиеТоварыЦифроваяМаркировка.ТоварНаименование
	|	КОНЕЦ,
	|	СНТДругиеТоварыЦифроваяМаркировка.ЕдиницаИзмерения.Код,
	|	 СНТДругиеТоварыЦифроваяМаркировка.Ссылка,
	|	 СНТДругиеТоварыЦифроваяМаркировка.ЕдиницаИзмерения,
	|	 СНТДругиеТоварыЦифроваяМаркировка.Товар
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СНТТоварыЭкспортныйКонтроль.ЕдиницаИзмерения.Код,
	|	ВЫБОР
	|		КОГДА СНТТоварыЭкспортныйКонтроль.ТоварНаименование <> &ПустаяСтрока
	|			ТОГДА СНТТоварыЭкспортныйКонтроль.ТоварНаименование
	|	КОНЕЦ,
	|	 СНТТоварыЭкспортныйКонтроль.Ссылка,
	|	 СНТТоварыЭкспортныйКонтроль.ЕдиницаИзмерения,
	|	 СНТТоварыЭкспортныйКонтроль.Товар
	|ИЗ
	|	Документ.СНТ.ТоварыЭкспортныйКонтроль КАК СНТТоварыЭкспортныйКонтроль
	|ГДЕ
	|	СНТТоварыЭкспортныйКонтроль.ТоварНаименование <> &ПустаяСтрока
	|	И СНТТоварыЭкспортныйКонтроль.Ссылка В(&МассивСНТ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА СНТТоварыЭкспортныйКонтроль.ТоварНаименование <> &ПустаяСтрока
	|			ТОГДА СНТТоварыЭкспортныйКонтроль.ТоварНаименование
	|	КОНЕЦ,
	|	СНТТоварыЭкспортныйКонтроль.ЕдиницаИзмерения.Код,
	|	 СНТТоварыЭкспортныйКонтроль.Ссылка,
	|	 СНТТоварыЭкспортныйКонтроль.ЕдиницаИзмерения,
	|	 СНТТоварыЭкспортныйКонтроль.Товар";
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

Процедура УстановитьНаименованиеРозничныйПокупатель(ОбъектСНТ, Реквизит) Экспорт
	
	//Если ОбъектСНТ[Реквизит] = ПредопределенноеЗначение("Справочник.Контрагенты.РозничныйПокупатель") Тогда
	//	ИмяРеквизита = Реквизит + "Наименование";
	//	ОбъектСНТ[ИмяРеквизита] = "Розничная реализация";
	//КонецЕсли;
	
КонецПроцедуры

#Область ВводЭДВСпоСНТ

Функция ТекстЗапросаСНТ(ПервыйЗапрос = Истина) Экспорт
	
	ТекстЗапроса = " 
	|ВЫБРАТЬ 
	|	Товары.Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК ОрганизацияПолучатель,
	|	Товары.СтруктурноеПодразделение КАК СтруктурноеПодразделение,
	|	&ПодразделенияОрганизацийПустаяСсылка КАК СтруктурноеПодразделениеПолучатель,
	|	Товары.Дата КАК ДатаИсходногоДокумента,
	|	Товары.Дата,
	|	Товары.Номер,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыФормВС.СписаниеТоваровНеВС) КАК ТипФормы,
	|	ЗНАЧЕНИЕ(Перечисление.ПричинаСписанияВС.ОтсутствуетТребованиеСНТ) КАК ПричинаСписания,
	|	ЗНАЧЕНИЕ(Перечисление.ВидДетализации.ПустаяСсылка) КАК ВидДетализации,
	|	ЗНАЧЕНИЕ(Перечисление.СтатусыУТТН.Созданный) КАК Статус,
	|	"""" КАК Комментарий,
	|	Товары.Ссылка КАК ДокументОснование,
	|	Товары.СкладОтправитель КАК СкладОтправитель,
	|	ЗНАЧЕНИЕ(Справочник.ВиртуальныеСклады.ПустаяСсылка) КАК СкладПолучатель,
	|	Товары.СкладОтправитель КАК ВиртуальныйСкладОтправитель,
	|	ЗНАЧЕНИЕ(Справочник.ВиртуальныеСклады.ПустаяСсылка) КАК ВиртуальныйСкладПолучатель,
	|	Товары.Номенклатура КАК Товар,
	|	Товары.ТоварНаименование КАК ТоварНаименование,
	|	Товары.ТоварНаименование КАК ТоварНаименованиеВРамкахТС,
	|	Товары.КодТНВЭД КАК КодТНВЭД,
	|	Товары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Товары.ЕдиницаИзмеренияКод КАК ЕдиницаИзмеренияКод,
	|	Товары.КоличествоОстаток КАК Количество,
	|	Товары.Цена КАК Цена,
	|	Товары.КоличествоОстаток * Товары.Цена КАК Сумма,
	|	Товары.СтранаПроисхожденияТовара КАК СтранаПроисхожденияТовара,
	|	ДанныеСтраныМира.КодАльфа2 КАК СтранаПроисхожденияТовараКод,
	|	Товары.ПризнакПроисхождения КАК ПризнакПроисхождения,
	|	Товары.НомерЗаявленияВРамкахТС КАК НомерЗаявленияВРамкахТС,
	|	Товары.НомерПозицииВДекларацииИлиЗаявлении КАК НомерПозицииВДекларацииИлиЗаявлении,
	|	Товары.ИсточникПроисхождения КАК ИсточникПроисхождения,
	|	""Товары"" КАК ИмяТабличнойЧасти,
	|	""СНТ"" КАК ИмяДокумента,
	|	Товары.ТипПошлины КАК ТипПошлины,
	|	Товары.ТипПроисхождения КАК ТипПроисхождения,
	|	ЛОЖЬ КАК ВозможенЭкспорт,
	|	ЛОЖЬ КАК ЗапрещеноРазбиватьДокумент,
	|	ЛОЖЬ КАК РаспределятьТоварыПоИП,
	|	ЛОЖЬ КАК РаспределятьИсходныеТоварыПоИП,
	|	"""""""" КАК ПрефиксВидаДокумента,
	|	"""""""" КАК НомерУчетногоДокумента,
	|	"""""""" КАК НомерПакета
	|ПОМЕСТИТЬ вт_ДанныеДокумента
	|ИЗ
	|	ТоварыНеПодлежащиеУчету КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК ДанныеСтраныМира
	|		ПО Товары.СтранаПроисхожденияТовара = ДанныеСтраныМира.Ссылка";	
	Если Не ПервыйЗапрос Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПОМЕСТИТЬ вт_ДанныеДокумента", "");	
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РАЗРЕШЕННЫЕ", "");
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции	

Функция ТекстЗапросаВыбораСНТ() Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СНТТоварыВС.Товар КАК Номенклатура,
	|	СНТТоварыВС.Ссылка КАК Ссылка,
	|	СНТТоварыВС.Ссылка.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА СНТТоварыВС.Ссылка.Получатель ССЫЛКА Справочник.ПодразделенияОрганизаций
	|			ТОГДА СНТТоварыВС.Ссылка.Получатель
	|		ИНАЧЕ &ПодразделенияОрганизацийПустаяСсылка
	|	КОНЕЦ КАК СтруктурноеПодразделение,
	|	СНТТоварыВС.Ссылка.Дата КАК Дата,
	|	СНТТоварыВС.Ссылка.Номер КАК Номер,
	|	СНТТоварыВС.Ссылка.СкладПолучатель КАК СкладОтправитель,
	|	СНТТоварыВС.ТоварНаименование КАК ТоварНаименование,
	|	СНТТоварыВС.ПризнакПроисхождения КАК ПризнакПроисхождения,
	|	СНТТоварыВС.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СНТТоварыВС.КодТНВЭД КАК КодТНВЭД,
	|	СНТТоварыВС.Цена КАК Цена,
	|	СНТТоварыВС.СуммаБезНалогов КАК СуммаБезНалогов,
	|	СНТТоварыВС.СтавкаАкциза КАК СтавкаАкциза,
	|	СНТТоварыВС.СтавкаАкцизаЧисло КАК СтавкаАкцизаЧисло,
	|	СНТТоварыВС.СуммаАкциза КАК СуммаАкциза,
	|	СНТТоварыВС.СтавкаНДСЧисло КАК СтавкаНДСЧисло,
	|	СНТТоварыВС.БезНДС КАК БезНДС,
	|	СНТТоварыВС.СтавкаНДС КАК СтавкаНДС,
	|	СНТТоварыВС.СуммаНДС КАК СуммаНДС,
	|	СНТТоварыВС.Сумма КАК Сумма,
	|	СНТТоварыВС.НомерЗаявленияВРамкахТС КАК НомерЗаявленияВРамкахТС,
	|	СНТТоварыВС.НомерПозицииВДекларацииИлиЗаявлении КАК НомерПозицииВДекларацииИлиЗаявлении,
	|	СНТТоварыВС.ИдентификаторТовара КАК ИдентификаторТовара,
	|	СНТТоварыВС.ЕдиницаИзмеренияКод КАК ЕдиницаИзмеренияКод,
	|	СНТТоварыВС.ДополнительныйИдентификатор КАК ДополнительныйИдентификатор,
	|	СНТТоварыВС.GTIN КАК GTIN,
	|	ЕСТЬNULL(СопоставленныеИсточникиПроисхождения.ИсточникПроисхожденияПослеСопоставления, СНТТоварыВС.ИсточникПроисхождения) КАК ИсточникПроисхождения
	|ПОМЕСТИТЬ ТоварыВССНТ
	|ИЗ
	|	Документ.СНТ.ТоварыВС КАК СНТТоварыВС
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СопоставленныеИсточникиПроисхождения КАК СопоставленныеИсточникиПроисхождения
	|		ПО СНТТоварыВС.ИсточникПроисхождения = СопоставленныеИсточникиПроисхождения.ИсточникПроисхожденияДоСопоставления
	|ГДЕ
	|	СНТТоварыВС.Ссылка В(&МассивДокументов)
	|	И (СНТТоварыВС.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСНТ.Ввоз)
	|			ИЛИ СНТТоварыВС.Ссылка.Направление = ЗНАЧЕНИЕ(Перечисление.НаправленияСНТ.Входящий)
	|				И СНТТоварыВС.Ссылка.ТипСНТ <> ЗНАЧЕНИЕ(Перечисление.ТипыСНТ.ВозвратТоваров))
	|	И (СНТТоварыВС.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСНТ.Подтвержден)
	|			ИЛИ СНТТоварыВС.Ссылка.ПолучательМалаяТорговаяТочка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СНТТоварыЭкспортныйКонтроль.Товар,
	|	СНТТоварыЭкспортныйКонтроль.Ссылка,
	|	СНТТоварыЭкспортныйКонтроль.Ссылка.Организация,
	|	ВЫБОР
	|		КОГДА СНТТоварыЭкспортныйКонтроль.Ссылка.Получатель ССЫЛКА Справочник.ПодразделенияОрганизаций
	|			ТОГДА СНТТоварыЭкспортныйКонтроль.Ссылка.Получатель
	|		ИНАЧЕ &ПодразделенияОрганизацийПустаяСсылка
	|	КОНЕЦ,
	|	СНТТоварыЭкспортныйКонтроль.Ссылка.Дата,
	|	СНТТоварыЭкспортныйКонтроль.Ссылка.Номер,
	|	СНТТоварыЭкспортныйКонтроль.Ссылка.СкладПолучатель,
	|	СНТТоварыЭкспортныйКонтроль.ТоварНаименование,
	|	СНТТоварыЭкспортныйКонтроль.ПризнакПроисхождения,
	|	СНТТоварыЭкспортныйКонтроль.ЕдиницаИзмерения,
	|	СНТТоварыЭкспортныйКонтроль.КодТНВЭД,
	|	СНТТоварыЭкспортныйКонтроль.Цена,
	|	СНТТоварыЭкспортныйКонтроль.СуммаБезНалогов,
	|	СНТТоварыЭкспортныйКонтроль.СтавкаАкциза,
	|	СНТТоварыЭкспортныйКонтроль.СтавкаАкцизаЧисло,
	|	СНТТоварыЭкспортныйКонтроль.СуммаАкциза,
	|	СНТТоварыЭкспортныйКонтроль.СтавкаНДСЧисло,
	|	СНТТоварыЭкспортныйКонтроль.БезНДС,
	|	СНТТоварыЭкспортныйКонтроль.СтавкаНДС,
	|	СНТТоварыЭкспортныйКонтроль.СуммаНДС,
	|	СНТТоварыЭкспортныйКонтроль.Сумма,
	|	СНТТоварыЭкспортныйКонтроль.НомерЗаявленияВРамкахТС,
	|	СНТТоварыЭкспортныйКонтроль.НомерПозицииВДекларацииИлиЗаявлении,
	|	СНТТоварыЭкспортныйКонтроль.ИдентификаторТовара,
	|	СНТТоварыЭкспортныйКонтроль.ЕдиницаИзмеренияКод,
	|	СНТТоварыЭкспортныйКонтроль.ДополнительныйИдентификатор,
	|	"""",
	|	ЕСТЬNULL(СопоставленныеИсточникиПроисхождения.ИсточникПроисхожденияПослеСопоставления, СНТТоварыЭкспортныйКонтроль.ИсточникПроисхождения)
	|ИЗ
	|	Документ.СНТ.ТоварыЭкспортныйКонтроль КАК СНТТоварыЭкспортныйКонтроль
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СопоставленныеИсточникиПроисхождения КАК СопоставленныеИсточникиПроисхождения
	|		ПО СНТТоварыЭкспортныйКонтроль.ИсточникПроисхождения = СопоставленныеИсточникиПроисхождения.ИсточникПроисхожденияДоСопоставления
	|ГДЕ
	|	СНТТоварыЭкспортныйКонтроль.Ссылка В(&МассивДокументов)
	|	И (СНТТоварыЭкспортныйКонтроль.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСНТ.Ввоз)
	|			ИЛИ СНТТоварыЭкспортныйКонтроль.Ссылка.Направление = ЗНАЧЕНИЕ(Перечисление.НаправленияСНТ.Входящий)
	|				И СНТТоварыЭкспортныйКонтроль.Ссылка.ТипСНТ <> ЗНАЧЕНИЕ(Перечисление.ТипыСНТ.ВозвратТоваров))
	|	И (СНТТоварыЭкспортныйКонтроль.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСНТ.Подтвержден)
	|			ИЛИ СНТТоварыЭкспортныйКонтроль.Ссылка.ПолучательМалаяТорговаяТочка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыНаВиртуальныхСкладахОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыНаВиртуальныхСкладахОстатки.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ТоварыВССНТ.ИсточникПроисхождения КАК ИсточникПроисхождения,
	|	ЕСТЬNULL(СведенияОНоменклатуреГСВССрезПоследних.ПризнакУчетаНаВиртуальномСкладе, ЛОЖЬ) КАК ПризнакУчетаНаВиртуальномСкладеГСВС,
	|	СправочникИсточникиПроисхождения.ПризнакУчетаНаВиртуальномСкладе КАК ПризнакУчетаНаВиртуальномСкладе,
	|	СправочникИсточникиПроисхождения.ТоварНаименованиеВРамкахТС КАК ТоварНаименованиеВРамкахТС,
	|	СправочникИсточникиПроисхождения.СтранаПроисхожденияТовара КАК СтранаПроисхожденияТовара,
	|	СправочникИсточникиПроисхождения.ТипПошлины КАК ТипПошлины,
	|	СправочникИсточникиПроисхождения.ТипПроисхождения КАК ТипПроисхождения,
	|	ЕСТЬNULL(ТоварыНаВиртуальныхСкладахОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ТоварыВиртуальногоСкладаВРезерве.КоличествоОстаток, 0) КАК КоличествоОстаток,
	|	ТоварыВССНТ.ПризнакПроисхождения КАК ПризнакПроисхождения,
	|	ТоварыВССНТ.КодТНВЭД КАК КодТНВЭД,
	|	ТоварыВССНТ.Цена КАК Цена,
	|	ТоварыВССНТ.СуммаБезНалогов КАК СуммаБезНалогов,
	|	ТоварыВССНТ.СтавкаАкциза КАК СтавкаАкциза,
	|	ТоварыВССНТ.СтавкаАкцизаЧисло КАК СтавкаАкцизаЧисло,
	|	ТоварыВССНТ.СуммаАкциза КАК СуммаАкциза,
	|	ТоварыВССНТ.СтавкаНДСЧисло КАК СтавкаНДСЧисло,
	|	ТоварыВССНТ.БезНДС КАК БезНДС,
	|	ТоварыВССНТ.СтавкаНДС КАК СтавкаНДС,
	|	ТоварыВССНТ.СуммаНДС КАК СуммаНДС,
	|	ТоварыВССНТ.Сумма КАК Сумма,
	|	СправочникИсточникиПроисхождения.НомерЗаявленияВРамкахТС КАК НомерЗаявленияВРамкахТС,
	|	СправочникИсточникиПроисхождения.НомерПозицииВДекларацииИлиЗаявлении КАК НомерПозицииВДекларацииИлиЗаявлении,
	|	ТоварыВССНТ.ИдентификаторТовара КАК ИдентификаторТовара,
	|	ТоварыВССНТ.ЕдиницаИзмеренияКод КАК ЕдиницаИзмеренияКод,
	|	ТоварыВССНТ.ДополнительныйИдентификатор КАК ДополнительныйИдентификатор,
	|	ТоварыВССНТ.GTIN КАК GTIN,
	|	ТоварыВССНТ.Организация КАК Организация,
	|	ТоварыВССНТ.СтруктурноеПодразделение КАК СтруктурноеПодразделение,
	|	ТоварыВССНТ.Дата КАК ДАТА,
	|	ТоварыВССНТ.Номер КАК Номер,
	|	ТоварыВССНТ.СкладОтправитель КАК СкладОтправитель,
	|	ТоварыВССНТ.Ссылка КАК Ссылка,
	|	ТоварыВССНТ.ТоварНаименование КАК ТоварНаименование
	|ПОМЕСТИТЬ ТоварыНеПодлежащиеУчету
	|ИЗ
	|	РегистрНакопления.ТоварыНаВиртуальныхСкладах.Остатки(
	|			&ДатаОстатка,
	|			(Номенклатура, ИсточникПроисхождения) В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					ТоварыВС.Номенклатура,
	|					ТоварыВС.ИсточникПроисхождения
	|				ИЗ
	|					ТоварыВССНТ КАК ТоварыВС)) КАК ТоварыНаВиртуальныхСкладахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИсточникиПроисхождения КАК СправочникИсточникиПроисхождения
	|		ПО ТоварыНаВиртуальныхСкладахОстатки.ИсточникПроисхождения = СправочникИсточникиПроисхождения.Ссылка
	|			И ТоварыНаВиртуальныхСкладахОстатки.Номенклатура = СправочникИсточникиПроисхождения.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОНоменклатуреГСВС.СрезПоследних(&ТекущаяДата, ) КАК СведенияОНоменклатуреГСВССрезПоследних
	|		ПО (СправочникИсточникиПроисхождения.ГСВС = СведенияОНоменклатуреГСВССрезПоследних.НоменклатураГСВС)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТоварыВССНТ КАК ТоварыВССНТ
	|		ПО ТоварыНаВиртуальныхСкладахОстатки.Номенклатура = ТоварыВССНТ.Номенклатура
	|			И ТоварыНаВиртуальныхСкладахОстатки.ИсточникПроисхождения = ТоварыВССНТ.ИсточникПроисхождения
	|			И ТоварыНаВиртуальныхСкладахОстатки.Организация = ТоварыВССНТ.Организация
	|			И ТоварыНаВиртуальныхСкладахОстатки.Склад = ТоварыВССНТ.СкладОтправитель
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВиртуальногоСкладаВРезерве.Остатки(
	|				&ДатаОстатка,
	|				(Номенклатура, ИсточникПроисхождения) В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						ТоварыВС.Номенклатура,
	|						ТоварыВС.ИсточникПроисхождения
	|					ИЗ
	|						ТоварыВССНТ КАК ТоварыВС)) КАК ТоварыВиртуальногоСкладаВРезерве
	|		ПО ТоварыНаВиртуальныхСкладахОстатки.Организация = ТоварыВиртуальногоСкладаВРезерве.Организация
	|			И (ВЫБОР
	|				КОГДА &ПоддержкаРаботыСоСтруктурнымиПодразделениями
	|					ТОГДА ТоварыНаВиртуальныхСкладахОстатки.СтруктурноеПодразделение = ТоварыВиртуальногоСкладаВРезерве.СтруктурноеПодразделение
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И ТоварыНаВиртуальныхСкладахОстатки.Склад = ТоварыВиртуальногоСкладаВРезерве.Склад
	|			И ТоварыНаВиртуальныхСкладахОстатки.Номенклатура = ТоварыВиртуальногоСкладаВРезерве.Номенклатура
	|			И ТоварыНаВиртуальныхСкладахОстатки.ЕдиницаИзмерения = ТоварыВиртуальногоСкладаВРезерве.ЕдиницаИзмерения
	|			И ТоварыНаВиртуальныхСкладахОстатки.ИсточникПроисхождения = ТоварыВиртуальногоСкладаВРезерве.ИсточникПроисхождения
	|			И ТоварыНаВиртуальныхСкладахОстатки.ДокументПартии = ТоварыВиртуальногоСкладаВРезерве.ДокументПартии
	|ГДЕ
	|	ЕСТЬNULL(ТоварыНаВиртуальныхСкладахОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ТоварыВиртуальногоСкладаВРезерве.КоличествоОстаток, 0) > 0
	|	И НЕ ЕСТЬNULL(СведенияОНоменклатуреГСВССрезПоследних.ПризнакУчетаНаВиртуальномСкладе, ЛОЖЬ)
	|	И СправочникИсточникиПроисхождения.ПризнакУчетаНаВиртуальномСкладе
	|;
	|///////////////////////////////////////////////////////////////////////////////////////////////////////
	|";

	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаСНТКонвертацияЕдиницИзмерения() Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СНТ.Ссылка КАК Ссылка,
	|	СНТ.Организация КАК Организация,
	|	СНТ.Дата,
	|	СНТ.Номер,
	|	СНТ.Ссылка КАК ДокументОснование,
	|	ВЫРАЗИТЬ(СНТ.Комментарий КАК СТРОКА(400)) КАК Комментарий,
	|	СНТ.СкладПолучатель КАК СкладОтправитель,
	|	СНТ.Организация КАК СтруктурноеПодразделение
	|
	|ПОМЕСТИТЬ вт_РеквизитыСНТ
	|ИЗ
	|	Документ.СНТ КАК СНТ
	|ГДЕ
	|	СНТ.Ссылка В(&МассивДокументов)
	|	И СНТ.Направление = ЗНАЧЕНИЕ(Перечисление.НаправленияСНТ.Входящий)
	|
	| ;
	| ///////////////////
    |
	|ВЫБРАТЬ 
	|	Товары.Ссылка КАК Ссылка,
	|	Товары.Товар КАК Товар,
	|	Товары.ТоварНаименование КАК ТоварНаименование,
	|	ДанныеИП.ТоварНаименованиеВРамкахТС КАК ТоварНаименованиеВРамкахТС,
	|	ДанныеИП.КодТНВЭД КАК КодТНВЭД,
	|	Товары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Товары.ЕдиницаИзмеренияКод КАК ЕдиницаИзмеренияКод,
	|	Товары.Количество КАК Количество,
	|	Товары.СуммаБезНалогов КАК Сумма,
	|	Товары.Цена КАК Цена,
	|	Товары.ПризнакПроисхождения КАК ПризнакПроисхождения,
	|	ДанныеИП.НомерЗаявленияВРамкахТС КАК НомерЗаявленияВРамкахТС,
	|	ДанныеИП.НомерПозицииВДекларацииИлиЗаявлении КАК НомерПозицииВДекларацииИлиЗаявлении,
	|	Товары.ИсточникПроисхождения КАК ИсточникПроисхождения,
	|	Товары.ЕдиницаИзмеренияХраненияОстатков,
	|	Товары.КоэффициентПересчета,
	|	КлассификаторЕдиницИзмеренияХраненияОстатков.КодЭСФ КАК ЕдиницаИзмеренияХраненияОстатковКод,
	|	Товары.Количество * Товары.КоэффициентПересчета КАК КоличествоЕдиницаИзмеренияХраненияОстатков,
	|	ДанныеИП.ТипПошлины КАК ТипПошлины,
	|	ДанныеИП.ТипПроисхождения КАК ТипПроисхождения,
	|	ВЫБОР
	|		КОГДА Товары.Количество = 0
	|				ИЛИ Товары.КоэффициентПересчета = 0
	|			ТОГДА Товары.Цена
	|		ИНАЧЕ ВЫРАЗИТЬ(Товары.СуммаБезНалогов / (Товары.Количество * Товары.КоэффициентПересчета) КАК ЧИСЛО(17, 2))
	|	КОНЕЦ КАК ЦенаЕдиницаИзмеренияХраненияОстатков,
	|	ДанныеИП.СтранаПроисхожденияТовара КАК СтранаПроисхожденияТовара,
	|	ДанныеСтраныМира.КодАльфа2 КАК СтранаПроисхожденияТовараКод
	|ПОМЕСТИТЬ вт_ТоварыЭСФ
	|ИЗ
	|	Документ.СНТ.ТоварыВС КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИсточникиПроисхождения КАК ДанныеИП
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК ДанныеСтраныМира
	|			ПО ДанныеИП.СтранаПроисхожденияТовара = ДанныеСтраныМира.Ссылка
	|		ПО Товары.ИсточникПроисхождения = ДанныеИП.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмеренияХраненияОстатков
	|		ПО Товары.ЕдиницаИзмеренияХраненияОстатков = КлассификаторЕдиницИзмеренияХраненияОстатков.Ссылка
	|ГДЕ
	|	Товары.ПризнакПроисхождения <> ""6""
	|	И (Товары.КоэффициентПересчета <> 1
	|	ИЛИ (Товары.ЕдиницаИзмерения <> Значение(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка) И 
	|	Товары.ЕдиницаИзмеренияХраненияОстатков <> Значение(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|	И Товары.ЕдиницаИзмерения <> Товары.ЕдиницаИзмеренияХраненияОстатков))
	|	И Товары.ИдентификаторТовара <> ""1""
	|
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
    |ВЫБРАТЬ 
	|	Товары.Ссылка КАК Ссылка,
	|	Товары.Товар КАК Товар,
	|	Товары.ТоварНаименование КАК ТоварНаименование,
	|	ДанныеИП.ТоварНаименованиеВРамкахТС КАК ТоварНаименованиеВРамкахТС,
	|	ДанныеИП.КодТНВЭД КАК КодТНВЭД,
	|	Товары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	КлассификаторЕдиницИзмерения.КодЭСФ КАК ЕдиницаИзмеренияКод,
	|	Товары.Количество КАК Количество,
	|	Товары.СуммаБезНалогов КАК Сумма,
	|	Товары.Цена КАК Цена,
	|	Товары.ПризнакПроисхождения КАК ПризнакПроисхождения,
	|	ДанныеИП.НомерЗаявленияВРамкахТС КАК НомерЗаявленияВРамкахТС,
	|	ДанныеИП.НомерПозицииВДекларацииИлиЗаявлении КАК НомерПозицииВДекларацииИлиЗаявлении,
	|	Товары.ИсточникПроисхождения КАК ИсточникПроисхождения,
	|	Товары.ЕдиницаИзмеренияХраненияОстатков,
	|	Товары.КоэффициентПересчета,
	|	КлассификаторЕдиницИзмеренияХраненияОстатков.КодЭСФ,
	|	Товары.Количество * Товары.КоэффициентПересчета КАК КоличествоЕдиницаИзмеренияХраненияОстатков,
	|	ДанныеИП.ТипПошлины КАК ТипПошлины,
	|	ДанныеИП.ТипПроисхождения КАК ТипПроисхождения,
	|	ВЫБОР
	|		КОГДА Товары.Количество = 0
	|				ИЛИ Товары.КоэффициентПересчета = 0
	|			ТОГДА Товары.Цена
	|		ИНАЧЕ ВЫРАЗИТЬ(Товары.СуммаБезНалогов / (Товары.Количество * Товары.КоэффициентПересчета) КАК ЧИСЛО(17, 2))
	|	КОНЕЦ КАК ЦенаЕдиницаИзмеренияХраненияОстатков,
	|	ДанныеИП.СтранаПроисхожденияТовара КАК СтранаПроисхожденияТовара,
	|	ДанныеСтраныМира.КодАльфа2 КАК СтранаПроисхожденияТовараКод
	|ИЗ
	|	Документ.СНТ.ЭтиловыйСпирт КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИсточникиПроисхождения КАК ДанныеИП
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК ДанныеСтраныМира
	|			ПО ДанныеИП.СтранаПроисхожденияТовара = ДанныеСтраныМира.Ссылка
	|		ПО Товары.ИсточникПроисхождения = ДанныеИП.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
	|		ПО Товары.ЕдиницаИзмерения = КлассификаторЕдиницИзмерения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмеренияХраненияОстатков
	|		ПО Товары.ЕдиницаИзмеренияХраненияОстатков = КлассификаторЕдиницИзмеренияХраненияОстатков.Ссылка
	|ГДЕ
	|	Товары.ПризнакПроисхождения <> ""6""
	|	И (Товары.КоэффициентПересчета <> 1
	|	ИЛИ (Товары.ЕдиницаИзмерения <> Значение(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка) И 
	|	Товары.ЕдиницаИзмеренияХраненияОстатков <> Значение(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|	И Товары.ЕдиницаИзмерения <> Товары.ЕдиницаИзмеренияХраненияОстатков))
	|	И Товары.ИдентификаторТовара <> ""1""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Товары.Ссылка КАК Ссылка,
	|	Товары.Товар КАК Товар,
	|	Товары.ТоварНаименование КАК ТоварНаименование,
	|	ДанныеИП.ТоварНаименованиеВРамкахТС КАК ТоварНаименованиеВРамкахТС,
	|	ДанныеИП.КодТНВЭД КАК КодТНВЭД,
	|	Товары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	КлассификаторЕдиницИзмерения.КодЭСФ КАК ЕдиницаИзмеренияКод,
	|	Товары.Количество КАК Количество,
	|	Товары.СуммаБезНалогов КАК Сумма,
	|	Товары.Цена КАК Цена,
	|	Товары.ПризнакПроисхождения КАК ПризнакПроисхождения,
	|	ДанныеИП.НомерЗаявленияВРамкахТС КАК НомерЗаявленияВРамкахТС,
	|	ДанныеИП.НомерПозицииВДекларацииИлиЗаявлении КАК НомерПозицииВДекларацииИлиЗаявлении,
	|	Товары.ИсточникПроисхождения КАК ИсточникПроисхождения,
	|	Товары.ЕдиницаИзмеренияХраненияОстатков,
	|	Товары.КоэффициентПересчета,
	|	КлассификаторЕдиницИзмеренияХраненияОстатков.КодЭСФ,
	|	Товары.Количество * Товары.КоэффициентПересчета КАК КоличествоЕдиницаИзмеренияХраненияОстатков,
	|	ДанныеИП.ТипПошлины КАК ТипПошлины,
	|	ДанныеИП.ТипПроисхождения КАК ТипПроисхождения,
	|	ВЫБОР
	|		КОГДА Товары.Количество = 0
	|				ИЛИ Товары.КоэффициентПересчета = 0
	|			ТОГДА Товары.Цена
	|		ИНАЧЕ ВЫРАЗИТЬ(Товары.СуммаБезНалогов / (Товары.Количество * Товары.КоэффициентПересчета) КАК ЧИСЛО(17, 2))
	|	КОНЕЦ КАК ЦенаЕдиницаИзмеренияХраненияОстатков,
	|	ДанныеИП.СтранаПроисхожденияТовара КАК СтранаПроисхожденияТовара,
	|	ДанныеСтраныМира.КодАльфа2 КАК СтранаПроисхожденияТовараКод
	|ИЗ
	|	Документ.СНТ.Виноматериал КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИсточникиПроисхождения КАК ДанныеИП
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК ДанныеСтраныМира
	|			ПО ДанныеИП.СтранаПроисхожденияТовара = ДанныеСтраныМира.Ссылка
	|		ПО Товары.ИсточникПроисхождения = ДанныеИП.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
	|		ПО Товары.ЕдиницаИзмерения = КлассификаторЕдиницИзмерения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмеренияХраненияОстатков
	|		ПО Товары.ЕдиницаИзмеренияХраненияОстатков = КлассификаторЕдиницИзмеренияХраненияОстатков.Ссылка
	|ГДЕ
	|	Товары.ПризнакПроисхождения <> ""6""
	|	И (Товары.КоэффициентПересчета <> 1
	|	ИЛИ (Товары.ЕдиницаИзмерения <> Значение(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка) И 
	|	Товары.ЕдиницаИзмеренияХраненияОстатков <> Значение(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|	И Товары.ЕдиницаИзмерения <> Товары.ЕдиницаИзмеренияХраненияОстатков))
	|	И Товары.ИдентификаторТовара <> ""1""
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ 
	|	Товары.Ссылка КАК Ссылка,
	|	Товары.Товар КАК Товар,
	|	Товары.ТоварНаименование КАК ТоварНаименование,
	|	ДанныеИП.ТоварНаименованиеВРамкахТС КАК ТоварНаименованиеВРамкахТС,
	|	ДанныеИП.КодТНВЭД КАК КодТНВЭД,
	|	Товары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Товары.ЕдиницаИзмеренияКод КАК ЕдиницаИзмеренияКод,
	|	Товары.КоличествоУпаковок КАК Количество,
	|	Товары.СуммаБезНалогов КАК Сумма,
	|	Товары.Цена КАК Цена,
	|	Товары.ПризнакПроисхождения КАК ПризнакПроисхождения,
	|	ДанныеИП.НомерЗаявленияВРамкахТС КАК НомерЗаявленияВРамкахТС,
	|	ДанныеИП.НомерПозицииВДекларацииИлиЗаявлении КАК НомерПозицииВДекларацииИлиЗаявлении,
	|	Товары.ИсточникПроисхождения КАК ИсточникПроисхождения,
	|	Товары.ЕдиницаИзмеренияХраненияОстатков,
	|	Товары.КоэффициентПересчета,
	|	КлассификаторЕдиницИзмеренияХраненияОстатков.КодЭСФ КАК ЕдиницаИзмеренияХраненияОстатковКод,
	|	Товары.КоличествоУпаковок * Товары.КоэффициентПересчета КАК КоличествоЕдиницаИзмеренияХраненияОстатков,
	|	ДанныеИП.ТипПошлины КАК ТипПошлины,
	|	ДанныеИП.ТипПроисхождения КАК ТипПроисхождения,
	|	ВЫБОР
	|		КОГДА Товары.КоличествоУпаковок = 0
	|				ИЛИ Товары.КоэффициентПересчета = 0
	|			ТОГДА Товары.Цена
	|		ИНАЧЕ ВЫРАЗИТЬ(Товары.СуммаБезНалогов / (Товары.КоличествоУпаковок * Товары.КоэффициентПересчета) КАК ЧИСЛО(17, 2))
	|	КОНЕЦ КАК ЦенаЕдиницаИзмеренияХраненияОстатков,
	|	ДанныеИП.СтранаПроисхожденияТовара КАК СтранаПроисхожденияТовара,
	|	ДанныеСтраныМира.КодАльфа2 КАК СтранаПроисхожденияТовараКод
	|ИЗ
	|	Документ.СНТ.ПивоПивныеНапитки КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИсточникиПроисхождения КАК ДанныеИП
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК ДанныеСтраныМира
	|			ПО ДанныеИП.СтранаПроисхожденияТовара = ДанныеСтраныМира.Ссылка
	|		ПО Товары.ИсточникПроисхождения = ДанныеИП.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмеренияХраненияОстатков
	|		ПО Товары.ЕдиницаИзмеренияХраненияОстатков = КлассификаторЕдиницИзмеренияХраненияОстатков.Ссылка
	|ГДЕ
	|	Товары.ПризнакПроисхождения <> ""6""
	|	И (Товары.КоэффициентПересчета <> 1
	|	ИЛИ (Товары.ЕдиницаИзмерения <> Значение(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка) И 
	|	Товары.ЕдиницаИзмеренияХраненияОстатков <> Значение(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|	И Товары.ЕдиницаИзмерения <> Товары.ЕдиницаИзмеренияХраненияОстатков))
	|	И Товары.ИдентификаторТовара <> ""1""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Товары.Ссылка КАК Ссылка,
	|	Товары.Товар КАК Товар,
	|	Товары.ТоварНаименование КАК ТоварНаименование,
	|	ДанныеИП.ТоварНаименованиеВРамкахТС КАК ТоварНаименованиеВРамкахТС,
	|	ДанныеИП.КодТНВЭД КАК КодТНВЭД,
	|	Товары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	КлассификаторЕдиницИзмерения.КодЭСФ КАК ЕдиницаИзмеренияКод,
	|	Товары.КоличествоБутылок КАК Количество,
	|	Товары.СуммаБезНалогов КАК Сумма,
	|	Товары.Цена КАК Цена,
	|	Товары.ПризнакПроисхождения КАК ПризнакПроисхождения,
	|	ДанныеИП.НомерЗаявленияВРамкахТС КАК НомерЗаявленияВРамкахТС,
	|	ДанныеИП.НомерПозицииВДекларацииИлиЗаявлении КАК НомерПозицииВДекларацииИлиЗаявлении,
	|	Товары.ИсточникПроисхождения КАК ИсточникПроисхождения,
	|	Товары.ЕдиницаИзмеренияХраненияОстатков,
	|	Товары.КоэффициентПересчета,
	|	КлассификаторЕдиницИзмеренияХраненияОстатков.КодЭСФ,
	|	Товары.КоличествоБутылок * Товары.КоэффициентПересчета КАК КоличествоЕдиницаИзмеренияХраненияОстатков,
	|	ДанныеИП.ТипПошлины КАК ТипПошлины,
	|	ДанныеИП.ТипПроисхождения КАК ТипПроисхождения,
	|	ВЫБОР
	|		КОГДА Товары.КоличествоБутылок = 0
	|				ИЛИ Товары.КоэффициентПересчета = 0
	|			ТОГДА Товары.Цена
	|		ИНАЧЕ ВЫРАЗИТЬ(Товары.СуммаБезНалогов / (Товары.КоличествоБутылок * Товары.КоэффициентПересчета) КАК ЧИСЛО(17, 2))	
	|	КОНЕЦ КАК ЦенаЕдиницаИзмеренияХраненияОстатков,
	|	ДанныеИП.СтранаПроисхожденияТовара КАК СтранаПроисхожденияТовара,
	|	ДанныеСтраныМира.КодАльфа2 КАК СтранаПроисхожденияТовараКод
	|ИЗ
	|	Документ.СНТ.АлкогольнаяПродукцияКромеПива КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИсточникиПроисхождения КАК ДанныеИП
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК ДанныеСтраныМира
	|			ПО ДанныеИП.СтранаПроисхожденияТовара = ДанныеСтраныМира.Ссылка
	|		ПО Товары.ИсточникПроисхождения = ДанныеИП.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
	|		ПО Товары.ЕдиницаИзмерения = КлассификаторЕдиницИзмерения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмеренияХраненияОстатков
	|		ПО Товары.ЕдиницаИзмеренияХраненияОстатков = КлассификаторЕдиницИзмеренияХраненияОстатков.Ссылка
	|ГДЕ
	|	Товары.ПризнакПроисхождения <> ""6""
	|	И (Товары.КоэффициентПересчета <> 1
	|	ИЛИ (Товары.ЕдиницаИзмерения <> Значение(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка) И 
	|	Товары.ЕдиницаИзмеренияХраненияОстатков <> Значение(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|	И Товары.ЕдиницаИзмерения <> Товары.ЕдиницаИзмеренияХраненияОстатков))
	|	И Товары.ИдентификаторТовара <> ""1""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ 
	|	Товары.Ссылка КАК Ссылка,
	|	Товары.Товар КАК Товар,
	|	Товары.ТоварНаименование КАК ТоварНаименование,
	|	ДанныеИП.ТоварНаименованиеВРамкахТС КАК ТоварНаименованиеВРамкахТС,
	|	ДанныеИП.КодТНВЭД КАК КодТНВЭД,
	|	Товары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Товары.ЕдиницаИзмеренияКод КАК ЕдиницаИзмеренияКод,
	|	Товары.Количество КАК Количество,
	|	Товары.СуммаБезНалогов КАК Сумма,
	|	Товары.Цена КАК Цена,
	|	Товары.ПризнакПроисхождения КАК ПризнакПроисхождения,
	|	ДанныеИП.НомерЗаявленияВРамкахТС КАК НомерЗаявленияВРамкахТС,
	|	ДанныеИП.НомерПозицииВДекларацииИлиЗаявлении КАК НомерПозицииВДекларацииИлиЗаявлении,
	|	Товары.ИсточникПроисхождения КАК ИсточникПроисхождения,
	|	Товары.ЕдиницаИзмеренияХраненияОстатков,
	|	Товары.КоэффициентПересчета,
	|	КлассификаторЕдиницИзмеренияХраненияОстатков.КодЭСФ КАК ЕдиницаИзмеренияХраненияОстатковКод,
	|	Товары.Количество * Товары.КоэффициентПересчета КАК КоличествоЕдиницаИзмеренияХраненияОстатков,
	|	ДанныеИП.ТипПошлины КАК ТипПошлины,
	|	ДанныеИП.ТипПроисхождения КАК ТипПроисхождения,
	|	ВЫБОР
	|		КОГДА Товары.Количество = 0
	|				ИЛИ Товары.КоэффициентПересчета = 0
	|			ТОГДА Товары.Цена
	|		ИНАЧЕ ВЫРАЗИТЬ(Товары.СуммаБезНалогов / (Товары.Количество * Товары.КоэффициентПересчета) КАК ЧИСЛО(17, 2))
	|	КОНЕЦ КАК ЦенаЕдиницаИзмеренияХраненияОстатков,
	|	ДанныеИП.СтранаПроисхожденияТовара КАК СтранаПроисхожденияТовара,
	|	ДанныеСтраныМира.КодАльфа2 КАК СтранаПроисхожденияТовараКод
	|ИЗ
	|	Документ.СНТ.ДанныеПоНефтепродуктам КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИсточникиПроисхождения КАК ДанныеИП
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК ДанныеСтраныМира
	|			ПО ДанныеИП.СтранаПроисхожденияТовара = ДанныеСтраныМира.Ссылка
	|		ПО Товары.ИсточникПроисхождения = ДанныеИП.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмеренияХраненияОстатков
	|		ПО Товары.ЕдиницаИзмеренияХраненияОстатков = КлассификаторЕдиницИзмеренияХраненияОстатков.Ссылка
	|ГДЕ
	|	Товары.ПризнакПроисхождения <> ""6""
	|	И (Товары.КоэффициентПересчета <> 1
	|	ИЛИ (Товары.ЕдиницаИзмерения <> Значение(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка) И 
	|	Товары.ЕдиницаИзмеренияХраненияОстатков <> Значение(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|	И Товары.ЕдиницаИзмерения <> Товары.ЕдиницаИзмеренияХраненияОстатков))
	|	И Товары.ИдентификаторТовара <> ""1""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Товары.Ссылка КАК Ссылка,
	|	Товары.Товар КАК Товар,
	|	Товары.ТоварНаименование КАК ТоварНаименование,
	|	ДанныеИП.ТоварНаименованиеВРамкахТС КАК ТоварНаименованиеВРамкахТС,
	|	ДанныеИП.КодТНВЭД КАК КодТНВЭД,
	|	Товары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Товары.ЕдиницаИзмеренияКод КАК ЕдиницаИзмеренияКод,
	|	Товары.Количество КАК Количество,
	|	Товары.СуммаБезНалогов КАК Сумма,
	|	Товары.Цена КАК Цена,
	|	Товары.ПризнакПроисхождения КАК ПризнакПроисхождения,
	|	ДанныеИП.НомерЗаявленияВРамкахТС КАК НомерЗаявленияВРамкахТС,
	|	ДанныеИП.НомерПозицииВДекларацииИлиЗаявлении КАК НомерПозицииВДекларацииИлиЗаявлении,
	|	Товары.ИсточникПроисхождения КАК ИсточникПроисхождения,
	|	Товары.ЕдиницаИзмеренияХраненияОстатков,
	|	Товары.КоэффициентПересчета,
	|	КлассификаторЕдиницИзмеренияХраненияОстатков.КодЭСФ КАК ЕдиницаИзмеренияХраненияОстатковКод,
	|	Товары.Количество * Товары.КоэффициентПересчета КАК КоличествоЕдиницаИзмеренияХраненияОстатков,
	|	ДанныеИП.ТипПошлины КАК ТипПошлины,
	|	ДанныеИП.ТипПроисхождения КАК ТипПроисхождения,
	|	ВЫБОР
	|		КОГДА Товары.Количество = 0
	|				ИЛИ Товары.КоэффициентПересчета = 0
	|			ТОГДА Товары.Цена
	|		ИНАЧЕ ВЫРАЗИТЬ(Товары.СуммаБезНалогов / (Товары.Количество * Товары.КоэффициентПересчета) КАК ЧИСЛО(17, 2))
	|	КОНЕЦ КАК ЦенаЕдиницаИзмеренияХраненияОстатков,
	|	ДанныеИП.СтранаПроисхожденияТовара КАК СтранаПроисхожденияТовара,
	|	ДанныеСтраныМира.КодАльфа2 КАК СтранаПроисхожденияТовараКод
	|ИЗ
	|	Документ.СНТ.ДанныеПоБиотопливу КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИсточникиПроисхождения КАК ДанныеИП
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК ДанныеСтраныМира
	|			ПО ДанныеИП.СтранаПроисхожденияТовара = ДанныеСтраныМира.Ссылка
	|		ПО Товары.ИсточникПроисхождения = ДанныеИП.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмеренияХраненияОстатков
	|		ПО Товары.ЕдиницаИзмеренияХраненияОстатков = КлассификаторЕдиницИзмеренияХраненияОстатков.Ссылка
	|ГДЕ
	|	Товары.ПризнакПроисхождения <> ""6""
	|	И (Товары.КоэффициентПересчета <> 1
	|	ИЛИ (Товары.ЕдиницаИзмерения <> Значение(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка) И 
	|	Товары.ЕдиницаИзмеренияХраненияОстатков <> Значение(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|	И Товары.ЕдиницаИзмерения <> Товары.ЕдиницаИзмеренияХраненияОстатков))
	|	И Товары.ИдентификаторТовара <> ""1""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ 
	|	Товары.Ссылка КАК Ссылка,
	|	Товары.Товар КАК Товар,
	|	Товары.ТоварНаименование КАК ТоварНаименование,
	|	ДанныеИП.ТоварНаименованиеВРамкахТС КАК ТоварНаименованиеВРамкахТС,
	|	ДанныеИП.КодТНВЭД КАК КодТНВЭД,
	|	Товары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Товары.ЕдиницаИзмеренияКод КАК ЕдиницаИзмеренияКод,
	|	Товары.Количество КАК Количество,
	|	Товары.СуммаБезНалогов КАК Сумма,
	|	Товары.Цена КАК Цена,
	|	Товары.ПризнакПроисхождения КАК ПризнакПроисхождения,
	|	ДанныеИП.НомерЗаявленияВРамкахТС КАК НомерЗаявленияВРамкахТС,
	|	ДанныеИП.НомерПозицииВДекларацииИлиЗаявлении КАК НомерПозицииВДекларацииИлиЗаявлении,
	|	Товары.ИсточникПроисхождения КАК ИсточникПроисхождения,
	|	Товары.ЕдиницаИзмеренияХраненияОстатков,
	|	Товары.КоэффициентПересчета,
	|	КлассификаторЕдиницИзмеренияХраненияОстатков.КодЭСФ КАК ЕдиницаИзмеренияХраненияОстатковКод,
	|	Товары.Количество * Товары.КоэффициентПересчета КАК КоличествоЕдиницаИзмеренияХраненияОстатков,
	|	ДанныеИП.ТипПошлины КАК ТипПошлины,
	|	ДанныеИП.ТипПроисхождения КАК ТипПроисхождения,
	|	ВЫБОР
	|		КОГДА Товары.Количество = 0
	|				ИЛИ Товары.КоэффициентПересчета = 0
	|			ТОГДА Товары.Цена
	|		ИНАЧЕ ВЫРАЗИТЬ(Товары.СуммаБезНалогов / (Товары.Количество * Товары.КоэффициентПересчета) КАК ЧИСЛО(17, 2))
	|	КОНЕЦ КАК ЦенаЕдиницаИзмеренияХраненияОстатков,
	|	ДанныеИП.СтранаПроисхожденияТовара КАК СтранаПроисхожденияТовара,
	|	ДанныеСтраныМира.КодАльфа2 КАК СтранаПроисхожденияТовараКод
	|ИЗ
	|	Документ.СНТ.ТабачнаяПродукция КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИсточникиПроисхождения КАК ДанныеИП
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК ДанныеСтраныМира
	|			ПО ДанныеИП.СтранаПроисхожденияТовара = ДанныеСтраныМира.Ссылка
	|		ПО Товары.ИсточникПроисхождения = ДанныеИП.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмеренияХраненияОстатков
	|		ПО Товары.ЕдиницаИзмеренияХраненияОстатков = КлассификаторЕдиницИзмеренияХраненияОстатков.Ссылка
	|ГДЕ
	|	Товары.ПризнакПроисхождения <> ""6""
	|	И (Товары.КоэффициентПересчета <> 1
	|	ИЛИ (Товары.ЕдиницаИзмерения <> Значение(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка) И 
	|	Товары.ЕдиницаИзмеренияХраненияОстатков <> Значение(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|	И Товары.ЕдиницаИзмерения <> Товары.ЕдиницаИзмеренияХраненияОстатков))
	|	И Товары.ИдентификаторТовара <> ""1""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Товары.Ссылка КАК Ссылка,
	|	Товары.Товар КАК Товар,
	|	Товары.ТоварНаименование КАК ТоварНаименование,
	|	ДанныеИП.ТоварНаименованиеВРамкахТС КАК ТоварНаименованиеВРамкахТС,
	|	ДанныеИП.КодТНВЭД КАК КодТНВЭД,
	|	Товары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Товары.ЕдиницаИзмеренияКод КАК ЕдиницаИзмеренияКод,
	|	Товары.Количество КАК Количество,
	|	Товары.СуммаБезНалогов КАК Сумма,
	|	Товары.Цена КАК Цена,
	|	Товары.ПризнакПроисхождения КАК ПризнакПроисхождения,
	|	ДанныеИП.НомерЗаявленияВРамкахТС КАК НомерЗаявленияВРамкахТС,
	|	ДанныеИП.НомерПозицииВДекларацииИлиЗаявлении КАК НомерПозицииВДекларацииИлиЗаявлении,
	|	Товары.ИсточникПроисхождения КАК ИсточникПроисхождения,
	|	Товары.ЕдиницаИзмеренияХраненияОстатков,
	|	Товары.КоэффициентПересчета,
	|	КлассификаторЕдиницИзмеренияХраненияОстатков.КодЭСФ КАК ЕдиницаИзмеренияХраненияОстатковКод,
	|	Товары.Количество * Товары.КоэффициентПересчета КАК КоличествоЕдиницаИзмеренияХраненияОстатков,
	|	ДанныеИП.ТипПошлины КАК ТипПошлины,
	|	ДанныеИП.ТипПроисхождения КАК ТипПроисхождения,
	|	ВЫБОР
	|		КОГДА Товары.Количество = 0
	|				ИЛИ Товары.КоэффициентПересчета = 0
	|			ТОГДА Товары.Цена
	|		ИНАЧЕ ВЫРАЗИТЬ(Товары.СуммаБезНалогов / (Товары.Количество * Товары.КоэффициентПересчета) КАК ЧИСЛО(17, 2))
	|	КОНЕЦ КАК ЦенаЕдиницаИзмеренияХраненияОстатков,
	|	ДанныеИП.СтранаПроисхожденияТовара КАК СтранаПроисхожденияТовара,
	|	ДанныеСтраныМира.КодАльфа2 КАК СтранаПроисхожденияТовараКод
	|ИЗ
	|	Документ.СНТ.ДругиеТоварыЦифроваяМаркировка КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИсточникиПроисхождения КАК ДанныеИП
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК ДанныеСтраныМира
	|			ПО ДанныеИП.СтранаПроисхожденияТовара = ДанныеСтраныМира.Ссылка
	|		ПО Товары.ИсточникПроисхождения = ДанныеИП.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмеренияХраненияОстатков
	|		ПО Товары.ЕдиницаИзмеренияХраненияОстатков = КлассификаторЕдиницИзмеренияХраненияОстатков.Ссылка
	|ГДЕ
	|	Товары.ПризнакПроисхождения <> ""6""
	|	И (Товары.КоэффициентПересчета <> 1
	|	ИЛИ (Товары.ЕдиницаИзмерения <> Значение(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка) И 
	|	Товары.ЕдиницаИзмеренияХраненияОстатков <> Значение(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|	И Товары.ЕдиницаИзмерения <> Товары.ЕдиницаИзмеренияХраненияОстатков))
	|	И Товары.ИдентификаторТовара <> ""1""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ 
	|	Товары.Ссылка КАК Ссылка,
	|	Товары.Товар КАК Товар,
	|	Товары.ТоварНаименование КАК ТоварНаименование,
	|	ДанныеИП.ТоварНаименованиеВРамкахТС КАК ТоварНаименованиеВРамкахТС,
	|	ДанныеИП.КодТНВЭД КАК КодТНВЭД,
	|	Товары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Товары.ЕдиницаИзмеренияКод КАК ЕдиницаИзмеренияКод,
	|	Товары.Количество КАК Количество,
	|	Товары.СуммаБезНалогов КАК Сумма,
	|	Товары.Цена КАК Цена,
	|	Товары.ПризнакПроисхождения КАК ПризнакПроисхождения,
	|	ДанныеИП.НомерЗаявленияВРамкахТС КАК НомерЗаявленияВРамкахТС,
	|	ДанныеИП.НомерПозицииВДекларацииИлиЗаявлении КАК НомерПозицииВДекларацииИлиЗаявлении,
	|	Товары.ИсточникПроисхождения КАК ИсточникПроисхождения,
	|	Товары.ЕдиницаИзмеренияХраненияОстатков,
	|	Товары.КоэффициентПересчета,
	|	КлассификаторЕдиницИзмеренияХраненияОстатков.КодЭСФ КАК ЕдиницаИзмеренияХраненияОстатковКод,
	|	Товары.Количество * Товары.КоэффициентПересчета КАК КоличествоЕдиницаИзмеренияХраненияОстатков,
	|	ДанныеИП.ТипПошлины КАК ТипПошлины,
	|	ДанныеИП.ТипПроисхождения КАК ТипПроисхождения,
	|	ВЫБОР
	|		КОГДА Товары.Количество = 0
	|				ИЛИ Товары.КоэффициентПересчета = 0
	|			ТОГДА Товары.Цена
	|		ИНАЧЕ ВЫРАЗИТЬ(Товары.СуммаБезНалогов / (Товары.Количество * Товары.КоэффициентПересчета) КАК ЧИСЛО(17, 2))
	|	КОНЕЦ КАК ЦенаЕдиницаИзмеренияХраненияОстатков,
	|	ДанныеИП.СтранаПроисхожденияТовара КАК СтранаПроисхожденияТовара,
	|	ДанныеСтраныМира.КодАльфа2 КАК СтранаПроисхожденияТовараКод
	|ИЗ
	|	Документ.СНТ.ТоварыЭкспортныйКонтроль КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИсточникиПроисхождения КАК ДанныеИП
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК ДанныеСтраныМира
	|			ПО ДанныеИП.СтранаПроисхожденияТовара = ДанныеСтраныМира.Ссылка
	|		ПО Товары.ИсточникПроисхождения = ДанныеИП.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмеренияХраненияОстатков
	|		ПО Товары.ЕдиницаИзмеренияХраненияОстатков = КлассификаторЕдиницИзмеренияХраненияОстатков.Ссылка
	|ГДЕ
	|	Товары.ПризнакПроисхождения <> ""6""
	|	И (Товары.КоэффициентПересчета <> 1
	|	ИЛИ (Товары.ЕдиницаИзмерения <> Значение(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка) И 
	|	Товары.ЕдиницаИзмеренияХраненияОстатков <> Значение(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|	И Товары.ЕдиницаИзмерения <> Товары.ЕдиницаИзмеренияХраненияОстатков))
	|	И Товары.ИдентификаторТовара <> ""1""
	|	
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_РеквизитыСНТ.Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК ОрганизацияПолучатель,
	|	вт_РеквизитыСНТ.СтруктурноеПодразделение КАК СтруктурноеПодразделение,
	|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК СтруктурноеПодразделениеПолучатель,
	|	вт_РеквизитыСНТ.Дата КАК ДатаИсходногоДокумента,
	|	вт_РеквизитыСНТ.Дата,
	|	вт_РеквизитыСНТ.Номер,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыФормВС.Детализация) КАК ТипФормы,
	|	ЗНАЧЕНИЕ(Перечисление.ПричинаСписанияВС.ПустаяСсылка) КАК ПричинаСписания,
	|	ЗНАЧЕНИЕ(Перечисление.ВидДетализации.КонвертацияМеждуЕИ) КАК ВидДетализации,
	|	ЗНАЧЕНИЕ(Перечисление.СтатусыУТТН.Созданный) КАК Статус,
	|	вт_РеквизитыСНТ.Комментарий КАК Комментарий,
	|	вт_РеквизитыСНТ.ДокументОснование КАК ДокументОснование,
	|	вт_РеквизитыСНТ.СкладОтправитель КАК СкладОтправитель,
	|	ЗНАЧЕНИЕ(Справочник.ВиртуальныеСклады.ПустаяСсылка) КАК СкладПолучатель,
	|	вт_РеквизитыСНТ.СкладОтправитель КАК ВиртуальныйСкладОтправитель,
	|	ЗНАЧЕНИЕ(Справочник.ВиртуальныеСклады.ПустаяСсылка) КАК ВиртуальныйСкладПолучатель,
	|	Товары.Товар КАК Товар,
	|	Товары.ТоварНаименование КАК ТоварНаименование,
	|	Товары.ТоварНаименованиеВРамкахТС КАК ТоварНаименованиеВРамкахТС,
	|	Товары.КодТНВЭД КАК КодТНВЭД,
	|	Товары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Товары.ЕдиницаИзмеренияКод КАК ЕдиницаИзмеренияКод,
	|	Товары.Количество КАК Количество,
	|	Товары.Сумма КАК Сумма,
	|	ВЫБОР
	|		КОГДА Товары.Количество = 0
	|			ТОГДА Товары.Цена
	|		ИНАЧЕ Товары.Сумма / Товары.Количество
	|	КОНЕЦ КАК Цена,
	|	Товары.СтранаПроисхожденияТовара КАК СтранаПроисхожденияТовара,
	|	Товары.СтранаПроисхожденияТовараКод КАК СтранаПроисхожденияТовараКод,
	|	Товары.ПризнакПроисхождения КАК ПризнакПроисхождения,
	|	Товары.НомерЗаявленияВРамкахТС КАК НомерЗаявленияВРамкахТС,
	|	Товары.НомерПозицииВДекларацииИлиЗаявлении КАК НомерПозицииВДекларацииИлиЗаявлении,
	|	Товары.ИсточникПроисхождения КАК ИсточникПроисхождения,
	|	""ИсходныеТовары"" КАК ИмяТабличнойЧасти,
	|	""СНТ"" КАК ИмяДокумента,
	|	Товары.ТипПошлины КАК ТипПошлины,
	|	Товары.ТипПроисхождения КАК ТипПроисхождения,
	|	ЛОЖЬ КАК ВозможенЭкспорт,
	|	ЛОЖЬ КАК ЗапрещеноРазбиватьДокумент,
	|	ЛОЖЬ КАК РаспределятьТоварыПоИП,
	|	ЛОЖЬ КАК РаспределятьИсходныеТоварыПоИП,
	|	"""" КАК ПрефиксВидаДокумента,
	|	"""" КАК НомерУчетногоДокумента,
	|	"""" КАК НомерПакета
	|ПОМЕСТИТЬ вт_ДанныеДокумента
	|ИЗ
	|	вт_ТоварыЭСФ КАК Товары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_РеквизитыСНТ КАК вт_РеквизитыСНТ
	|			ПО Товары.Ссылка = вт_РеквизитыСНТ.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	вт_РеквизитыСНТ.Организация,
	|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка),
	|	вт_РеквизитыСНТ.СтруктурноеПодразделение КАК СтруктурноеПодразделение,
	|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК СтруктурноеПодразделениеПолучатель,
	|	вт_РеквизитыСНТ.Дата,
	|	вт_РеквизитыСНТ.Дата,
	|	вт_РеквизитыСНТ.Номер,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыФормВС.Детализация),
	|	ЗНАЧЕНИЕ(Перечисление.ПричинаСписанияВС.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Перечисление.ВидДетализации.КонвертацияМеждуЕИ),
	|	ЗНАЧЕНИЕ(Перечисление.СтатусыУТТН.Созданный),
	|	вт_РеквизитыСНТ.Комментарий,
	|	вт_РеквизитыСНТ.ДокументОснование,
	|	вт_РеквизитыСНТ.СкладОтправитель,
	|	ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка),
	|	вт_РеквизитыСНТ.СкладОтправитель,
	|	ЗНАЧЕНИЕ(Справочник.ВиртуальныеСклады.ПустаяСсылка) КАК ВиртуальныйСкладПолучатель,
	|	Товары.Товар,
	|	Товары.ТоварНаименование,
	|	Товары.ТоварНаименованиеВРамкахТС,
	|	Товары.КодТНВЭД,
	|	Товары.ЕдиницаИзмеренияХраненияОстатков,
	|	Товары.ЕдиницаИзмеренияХраненияОстатковКод,
	|	Товары.КоличествоЕдиницаИзмеренияХраненияОстатков,
	|	Товары.ЦенаЕдиницаИзмеренияХраненияОстатков * Товары.КоличествоЕдиницаИзмеренияХраненияОстатков,
	|	Товары.ЦенаЕдиницаИзмеренияХраненияОстатков,
	|	Товары.СтранаПроисхожденияТовара,
	|	Товары.СтранаПроисхожденияТовараКод,
	|	Товары.ПризнакПроисхождения,
	|	Товары.НомерЗаявленияВРамкахТС,
	|	Товары.НомерПозицииВДекларацииИлиЗаявлении,
	|	Товары.ИсточникПроисхождения,
	|	""Товары"",
	|	""СНТ"",
	|	Товары.ТипПошлины,
	|	Товары.ТипПроисхождения,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	"""",
	|	"""",
	|	""""
	|ИЗ
	|	вт_ТоварыЭСФ КАК Товары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_РеквизитыСНТ КАК вт_РеквизитыСНТ
	|			ПО Товары.Ссылка = вт_РеквизитыСНТ.Ссылка";
	
	Возврат  ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаНаПеремещениеИзВходящегоСНТ() Экспорт

	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СНТ.Ссылка КАК Ссылка,
	|	СНТ.Организация КАК Организация,
	|	СНТ.Организация КАК ОрганизацияПолучатель,	
	|	СНТ.Дата КАК Дата,
	|	СНТ.Номер КАК Номер,
	|	СНТ.Ссылка КАК ДокументОснование,
	|	ВЫРАЗИТЬ(СНТ.Комментарий КАК СТРОКА(400)) КАК Комментарий,
	|	СНТ.СкладПолучатель КАК СкладОтправитель,
	|	СНТ.Организация КАК СтруктурноеПодразделение
	|ПОМЕСТИТЬ вт_РеквизитыСНТ
	|ИЗ
	|	Документ.СНТ КАК СНТ
	|ГДЕ
	|	СНТ.Ссылка В(&МассивДокументов)
	|	И СНТ.Направление = ЗНАЧЕНИЕ(Перечисление.НаправленияСНТ.Входящий)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Ссылка КАК Ссылка,
	|	Товары.Товар КАК Товар,
	|	Товары.ТоварНаименование КАК ТоварНаименование,
	|	ДанныеИП.ТоварНаименованиеВРамкахТС КАК ТоварНаименованиеВРамкахТС,
	|	ДанныеИП.КодТНВЭД КАК КодТНВЭД,
	|	Товары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Товары.ЕдиницаИзмеренияКод КАК ЕдиницаИзмеренияКод,
	|	Товары.Количество КАК Количество,
	|	Товары.СуммаБезНалогов КАК Сумма,
	|	Товары.Цена КАК Цена,
	|	Товары.ПризнакПроисхождения КАК ПризнакПроисхождения,
	|	ДанныеИП.НомерЗаявленияВРамкахТС КАК НомерЗаявленияВРамкахТС,
	|	ДанныеИП.НомерПозицииВДекларацииИлиЗаявлении КАК НомерПозицииВДекларацииИлиЗаявлении,
	|	Товары.ИсточникПроисхождения КАК ИсточникПроисхождения,
	|	ДанныеИП.ТипПошлины КАК ТипПошлины,
	|	ДанныеИП.ТипПроисхождения КАК ТипПроисхождения,
	|	ДанныеИП.СтранаПроисхожденияТовара КАК СтранаПроисхожденияТовара,
	|	ДанныеСтраныМира.КодАльфа2 КАК СтранаПроисхожденияТовараКод
	|ПОМЕСТИТЬ вт_ТоварыСНТ
	|ИЗ
	|	Документ.СНТ.ТоварыВС КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИсточникиПроисхождения КАК ДанныеИП
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК ДанныеСтраныМира
	|			ПО ДанныеИП.СтранаПроисхожденияТовара = ДанныеСтраныМира.Ссылка
	|		ПО Товары.ИсточникПроисхождения = ДанныеИП.Ссылка
	|ГДЕ
	|	Товары.Ссылка В(&МассивДокументов)
	|	И Товары.ПризнакПроисхождения <> ""6""
	|	И Товары.ИдентификаторТовара <> ""1""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Товары.Ссылка,
	|	Товары.Товар,
	|	Товары.ТоварНаименование,
	|	ДанныеИП.ТоварНаименованиеВРамкахТС,
	|	ДанныеИП.КодТНВЭД,
	|	Товары.ЕдиницаИзмерения,
	|	КлассификаторЕдиницИзмерения.КодЭСФ,
	|	Товары.Количество,
	|	Товары.СуммаБезНалогов,
	|	Товары.Цена,
	|	Товары.ПризнакПроисхождения,
	|	ДанныеИП.НомерЗаявленияВРамкахТС,
	|	ДанныеИП.НомерПозицииВДекларацииИлиЗаявлении,
	|	Товары.ИсточникПроисхождения,
	|	ДанныеИП.ТипПошлины,
	|	ДанныеИП.ТипПроисхождения,
	|	ДанныеИП.СтранаПроисхожденияТовара,
	|	ДанныеСтраныМира.КодАльфа2
	|ИЗ
	|	Документ.СНТ.ЭтиловыйСпирт КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИсточникиПроисхождения КАК ДанныеИП
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК ДанныеСтраныМира
	|			ПО ДанныеИП.СтранаПроисхожденияТовара = ДанныеСтраныМира.Ссылка
	|		ПО Товары.ИсточникПроисхождения = ДанныеИП.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
	|		ПО Товары.ЕдиницаИзмерения = КлассификаторЕдиницИзмерения.Ссылка
	|ГДЕ
	|	Товары.Ссылка В(&МассивДокументов)
	|	И Товары.ПризнакПроисхождения <> ""6""
	|	И Товары.ИдентификаторТовара <> ""1""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Товары.Ссылка,
	|	Товары.Товар,
	|	Товары.ТоварНаименование,
	|	ДанныеИП.ТоварНаименованиеВРамкахТС,
	|	ДанныеИП.КодТНВЭД,
	|	Товары.ЕдиницаИзмерения,
	|	КлассификаторЕдиницИзмерения.КодЭСФ,
	|	Товары.Количество,
	|	Товары.СуммаБезНалогов,
	|	Товары.Цена,
	|	Товары.ПризнакПроисхождения,
	|	ДанныеИП.НомерЗаявленияВРамкахТС,
	|	ДанныеИП.НомерПозицииВДекларацииИлиЗаявлении,
	|	Товары.ИсточникПроисхождения,
	|	ДанныеИП.ТипПошлины,
	|	ДанныеИП.ТипПроисхождения,
	|	ДанныеИП.СтранаПроисхожденияТовара,
	|	ДанныеСтраныМира.КодАльфа2
	|ИЗ
	|	Документ.СНТ.Виноматериал КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИсточникиПроисхождения КАК ДанныеИП
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК ДанныеСтраныМира
	|			ПО ДанныеИП.СтранаПроисхожденияТовара = ДанныеСтраныМира.Ссылка
	|		ПО Товары.ИсточникПроисхождения = ДанныеИП.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
	|		ПО Товары.ЕдиницаИзмерения = КлассификаторЕдиницИзмерения.Ссылка
	|ГДЕ
	|	Товары.Ссылка В(&МассивДокументов)
	|	И Товары.ПризнакПроисхождения <> ""6""
	|	И Товары.ИдентификаторТовара <> ""1""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Товары.Ссылка,
	|	Товары.Товар,
	|	Товары.ТоварНаименование,
	|	ДанныеИП.ТоварНаименованиеВРамкахТС,
	|	ДанныеИП.КодТНВЭД,
	|	Товары.ЕдиницаИзмерения,
	|	Товары.ЕдиницаИзмеренияКод,
	|	Товары.КоличествоУпаковок,
	|	Товары.СуммаБезНалогов,
	|	Товары.Цена,
	|	Товары.ПризнакПроисхождения,
	|	ДанныеИП.НомерЗаявленияВРамкахТС,
	|	ДанныеИП.НомерПозицииВДекларацииИлиЗаявлении,
	|	Товары.ИсточникПроисхождения,
	|	ДанныеИП.ТипПошлины,
	|	ДанныеИП.ТипПроисхождения,
	|	ДанныеИП.СтранаПроисхожденияТовара,
	|	ДанныеСтраныМира.КодАльфа2
	|ИЗ
	|	Документ.СНТ.ПивоПивныеНапитки КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИсточникиПроисхождения КАК ДанныеИП
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК ДанныеСтраныМира
	|			ПО ДанныеИП.СтранаПроисхожденияТовара = ДанныеСтраныМира.Ссылка
	|		ПО Товары.ИсточникПроисхождения = ДанныеИП.Ссылка
	|ГДЕ
	|	Товары.Ссылка В(&МассивДокументов)
	|	И Товары.ПризнакПроисхождения <> ""6""
	|	И Товары.ИдентификаторТовара <> ""1""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Товары.Ссылка,
	|	Товары.Товар,
	|	Товары.ТоварНаименование,
	|	ДанныеИП.ТоварНаименованиеВРамкахТС,
	|	ДанныеИП.КодТНВЭД,
	|	Товары.ЕдиницаИзмерения,
	|	КлассификаторЕдиницИзмерения.КодЭСФ,
	|	Товары.Количество,
	|	Товары.СуммаБезНалогов,
	|	Товары.Цена,
	|	Товары.ПризнакПроисхождения,
	|	ДанныеИП.НомерЗаявленияВРамкахТС,
	|	ДанныеИП.НомерПозицииВДекларацииИлиЗаявлении,
	|	Товары.ИсточникПроисхождения,
	|	ДанныеИП.ТипПошлины,
	|	ДанныеИП.ТипПроисхождения,
	|	ДанныеИП.СтранаПроисхожденияТовара,
	|	ДанныеСтраныМира.КодАльфа2
	|ИЗ
	|	Документ.СНТ.АлкогольнаяПродукцияКромеПива КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИсточникиПроисхождения КАК ДанныеИП
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК ДанныеСтраныМира
	|			ПО ДанныеИП.СтранаПроисхожденияТовара = ДанныеСтраныМира.Ссылка
	|		ПО Товары.ИсточникПроисхождения = ДанныеИП.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
	|		ПО Товары.ЕдиницаИзмерения = КлассификаторЕдиницИзмерения.Ссылка
	|ГДЕ
	|	Товары.Ссылка В(&МассивДокументов)
	|	И Товары.ПризнакПроисхождения <> ""6""
	|	И Товары.ИдентификаторТовара <> ""1""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Товары.Ссылка,
	|	Товары.Товар,
	|	Товары.ТоварНаименование,
	|	ДанныеИП.ТоварНаименованиеВРамкахТС,
	|	ДанныеИП.КодТНВЭД,
	|	Товары.ЕдиницаИзмерения,
	|	Товары.ЕдиницаИзмеренияКод,
	|	Товары.Количество,
	|	Товары.СуммаБезНалогов,
	|	Товары.Цена,
	|	Товары.ПризнакПроисхождения,
	|	ДанныеИП.НомерЗаявленияВРамкахТС,
	|	ДанныеИП.НомерПозицииВДекларацииИлиЗаявлении,
	|	Товары.ИсточникПроисхождения,
	|	ДанныеИП.ТипПошлины,
	|	ДанныеИП.ТипПроисхождения,
	|	ДанныеИП.СтранаПроисхожденияТовара,
	|	ДанныеСтраныМира.КодАльфа2
	|ИЗ
	|	Документ.СНТ.ДанныеПоНефтепродуктам КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИсточникиПроисхождения КАК ДанныеИП
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК ДанныеСтраныМира
	|			ПО ДанныеИП.СтранаПроисхожденияТовара = ДанныеСтраныМира.Ссылка
	|		ПО Товары.ИсточникПроисхождения = ДанныеИП.Ссылка
	|ГДЕ
	|	Товары.Ссылка В(&МассивДокументов)
	|	И Товары.ПризнакПроисхождения <> ""6""
	|	И Товары.ИдентификаторТовара <> ""1""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Товары.Ссылка,
	|	Товары.Товар,
	|	Товары.ТоварНаименование,
	|	ДанныеИП.ТоварНаименованиеВРамкахТС,
	|	ДанныеИП.КодТНВЭД,
	|	Товары.ЕдиницаИзмерения,
	|	Товары.ЕдиницаИзмеренияКод,
	|	Товары.Количество,
	|	Товары.СуммаБезНалогов,
	|	Товары.Цена,
	|	Товары.ПризнакПроисхождения,
	|	ДанныеИП.НомерЗаявленияВРамкахТС,
	|	ДанныеИП.НомерПозицииВДекларацииИлиЗаявлении,
	|	Товары.ИсточникПроисхождения,
	|	ДанныеИП.ТипПошлины,
	|	ДанныеИП.ТипПроисхождения,
	|	ДанныеИП.СтранаПроисхожденияТовара,
	|	ДанныеСтраныМира.КодАльфа2
	|ИЗ
	|	Документ.СНТ.ДанныеПоБиотопливу КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИсточникиПроисхождения КАК ДанныеИП
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК ДанныеСтраныМира
	|			ПО ДанныеИП.СтранаПроисхожденияТовара = ДанныеСтраныМира.Ссылка
	|		ПО Товары.ИсточникПроисхождения = ДанныеИП.Ссылка
	|ГДЕ
	|	Товары.Ссылка В(&МассивДокументов)
	|	И Товары.ПризнакПроисхождения <> ""6""
	|	И Товары.ИдентификаторТовара <> ""1""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Товары.Ссылка,
	|	Товары.Товар,
	|	Товары.ТоварНаименование,
	|	ДанныеИП.ТоварНаименованиеВРамкахТС,
	|	ДанныеИП.КодТНВЭД,
	|	Товары.ЕдиницаИзмерения,
	|	Товары.ЕдиницаИзмеренияКод,
	|	Товары.Количество,
	|	Товары.СуммаБезНалогов,
	|	Товары.Цена,
	|	Товары.ПризнакПроисхождения,
	|	ДанныеИП.НомерЗаявленияВРамкахТС,
	|	ДанныеИП.НомерПозицииВДекларацииИлиЗаявлении,
	|	Товары.ИсточникПроисхождения,
	|	ДанныеИП.ТипПошлины,
	|	ДанныеИП.ТипПроисхождения,
	|	ДанныеИП.СтранаПроисхожденияТовара,
	|	ДанныеСтраныМира.КодАльфа2
	|ИЗ
	|	Документ.СНТ.ТабачнаяПродукция КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИсточникиПроисхождения КАК ДанныеИП
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК ДанныеСтраныМира
	|			ПО ДанныеИП.СтранаПроисхожденияТовара = ДанныеСтраныМира.Ссылка
	|		ПО Товары.ИсточникПроисхождения = ДанныеИП.Ссылка
	|ГДЕ
	|	Товары.Ссылка В(&МассивДокументов)
	|	И Товары.ПризнакПроисхождения <> ""6""
	|	И Товары.ИдентификаторТовара <> ""1""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Товары.Ссылка,
	|	Товары.Товар,
	|	Товары.ТоварНаименование,
	|	ДанныеИП.ТоварНаименованиеВРамкахТС,
	|	ДанныеИП.КодТНВЭД,
	|	Товары.ЕдиницаИзмерения,
	|	Товары.ЕдиницаИзмеренияКод,
	|	Товары.Количество,
	|	Товары.СуммаБезНалогов,
	|	Товары.Цена,
	|	Товары.ПризнакПроисхождения,
	|	ДанныеИП.НомерЗаявленияВРамкахТС,
	|	ДанныеИП.НомерПозицииВДекларацииИлиЗаявлении,
	|	Товары.ИсточникПроисхождения,
	|	ДанныеИП.ТипПошлины,
	|	ДанныеИП.ТипПроисхождения,
	|	ДанныеИП.СтранаПроисхожденияТовара,
	|	ДанныеСтраныМира.КодАльфа2
	|ИЗ
	|	Документ.СНТ.ДругиеТоварыЦифроваяМаркировка КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИсточникиПроисхождения КАК ДанныеИП
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК ДанныеСтраныМира
	|			ПО ДанныеИП.СтранаПроисхожденияТовара = ДанныеСтраныМира.Ссылка
	|		ПО Товары.ИсточникПроисхождения = ДанныеИП.Ссылка
	|ГДЕ
	|	Товары.Ссылка В(&МассивДокументов)
	|	И Товары.ПризнакПроисхождения <> ""6""
	|	И Товары.ИдентификаторТовара <> ""1""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Товары.Ссылка,
	|	Товары.Товар,
	|	Товары.ТоварНаименование,
	|	ДанныеИП.ТоварНаименованиеВРамкахТС,
	|	ДанныеИП.КодТНВЭД,
	|	Товары.ЕдиницаИзмерения,
	|	Товары.ЕдиницаИзмеренияКод,
	|	Товары.Количество,
	|	Товары.СуммаБезНалогов,
	|	Товары.Цена,
	|	Товары.ПризнакПроисхождения,
	|	ДанныеИП.НомерЗаявленияВРамкахТС,
	|	ДанныеИП.НомерПозицииВДекларацииИлиЗаявлении,
	|	Товары.ИсточникПроисхождения,
	|	ДанныеИП.ТипПошлины,
	|	ДанныеИП.ТипПроисхождения,
	|	ДанныеИП.СтранаПроисхожденияТовара,
	|	ДанныеСтраныМира.КодАльфа2
	|ИЗ
	|	Документ.СНТ.ТоварыЭкспортныйКонтроль КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИсточникиПроисхождения КАК ДанныеИП
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК ДанныеСтраныМира
	|			ПО ДанныеИП.СтранаПроисхожденияТовара = ДанныеСтраныМира.Ссылка
	|		ПО Товары.ИсточникПроисхождения = ДанныеИП.Ссылка
	|ГДЕ
	|	Товары.Ссылка В(&МассивДокументов)
	|	И Товары.ПризнакПроисхождения <> ""6""
	|	И Товары.ИдентификаторТовара <> ""1""
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_РеквизитыСНТ.Организация КАК Организация,
	|	вт_РеквизитыСНТ.ОрганизацияПолучатель КАК ОрганизацияПолучатель,
	|	вт_РеквизитыСНТ.СтруктурноеПодразделение КАК СтруктурноеПодразделение,
	|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК СтруктурноеПодразделениеПолучатель,
	|	вт_РеквизитыСНТ.Дата КАК ДатаИсходногоДокумента,
	|	вт_РеквизитыСНТ.Дата,
	|	вт_РеквизитыСНТ.Номер,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыФормВС.ВнутреннееПеремещение) КАК ТипФормы,
	|	ЗНАЧЕНИЕ(Перечисление.ПричинаСписанияВС.ПустаяСсылка) КАК ПричинаСписания,
	|	ЗНАЧЕНИЕ(Перечисление.ВидДетализации.ПустаяСсылка) КАК ВидДетализации,
	|	ЗНАЧЕНИЕ(Перечисление.СтатусыУТТН.Созданный) КАК Статус,
	|	вт_РеквизитыСНТ.Комментарий КАК Комментарий,
	|	вт_РеквизитыСНТ.ДокументОснование КАК ДокументОснование,
	|	вт_РеквизитыСНТ.СкладОтправитель КАК СкладОтправитель,
	|	ЗНАЧЕНИЕ(Справочник.ВиртуальныеСклады.ПустаяСсылка) КАК СкладПолучатель,
	|	вт_РеквизитыСНТ.СкладОтправитель КАК ВиртуальныйСкладОтправитель,
	|	ЗНАЧЕНИЕ(Справочник.ВиртуальныеСклады.ПустаяСсылка) КАК ВиртуальныйСкладПолучатель,
	|	Товары.Товар КАК Товар,
	|	Товары.ТоварНаименование КАК ТоварНаименование,
	|	Товары.ТоварНаименованиеВРамкахТС КАК ТоварНаименованиеВРамкахТС,
	|	Товары.КодТНВЭД КАК КодТНВЭД,
	|	Товары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Товары.ЕдиницаИзмеренияКод КАК ЕдиницаИзмеренияКод,
	|	Товары.Количество КАК Количество,
	|	Товары.Сумма КАК Сумма,
	|	ВЫБОР
	|		КОГДА Товары.Количество = 0
	|			ТОГДА Товары.Цена
	|		ИНАЧЕ Товары.Сумма / Товары.Количество
	|	КОНЕЦ КАК Цена,
	|	Товары.СтранаПроисхожденияТовара КАК СтранаПроисхожденияТовара,
	|	Товары.СтранаПроисхожденияТовараКод КАК СтранаПроисхожденияТовараКод,
	|	Товары.ПризнакПроисхождения КАК ПризнакПроисхождения,
	|	Товары.НомерЗаявленияВРамкахТС КАК НомерЗаявленияВРамкахТС,
	|	Товары.НомерПозицииВДекларацииИлиЗаявлении КАК НомерПозицииВДекларацииИлиЗаявлении,
	|	Товары.ИсточникПроисхождения КАК ИсточникПроисхождения,
	|	""Товары"" КАК ИмяТабличнойЧасти,
	|	""СНТ"" КАК ИмяДокумента,
	|	Товары.ТипПошлины КАК ТипПошлины,
	|	Товары.ТипПроисхождения КАК ТипПроисхождения,
	|	ЛОЖЬ КАК ВозможенЭкспорт,
	|	ЛОЖЬ КАК ЗапрещеноРазбиватьДокумент,
	|	ЛОЖЬ КАК РаспределятьТоварыПоИП,
	|	ЛОЖЬ КАК РаспределятьИсходныеТоварыПоИП,
	|	"""" КАК ПрефиксВидаДокумента,
	|	"""" КАК НомерУчетногоДокумента,
	|	"""" КАК НомерПакета
	|ПОМЕСТИТЬ вт_ДанныеДокумента
	|ИЗ
	|	вт_ТоварыСНТ КАК Товары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_РеквизитыСНТ КАК вт_РеквизитыСНТ
	|		ПО Товары.Ссылка = вт_РеквизитыСНТ.Ссылка ";	

 Возврат ТекстЗапроса;
 
КонецФункции

#КонецОбласти

#Область СсылкаНаСНТ

Процедура ОбновитьРеквизитыСНТ(ДанныеФормы, РеквизитНадписьСНТ = "НадписьСНТ", ТребуетсяСНТ = Истина, ГруппаДляВключенияМеню = "ГруппаПодвалЛевая", ПослеГруппы = "") Экспорт
	
	Если ПолучитьДанныеСНТ(ДанныеФормы, ГруппаДляВключенияМеню, ПослеГруппы) Тогда 
		ЗаполнитьТекстПроСНТ(ДанныеФормы, РеквизитНадписьСНТ, ТребуетсяСНТ);
		УправлениеГруппойСНТ(ДанныеФормы, ТребуетсяСНТ);
	КонецЕсли;	
	
КонецПроцедуры

Функция ПолучитьДанныеСНТ(ДанныеФормы, ГруппаДляВключенияМеню = "ГруппаПодвалЛевая", ПослеГруппы = "") Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЭлектронныеСНТ") Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	Если ДанныеФормы.Элементы.Найти("ГруппаСНТ") = Неопределено Тогда
		Если ДанныеФормы.Элементы.Найти("ГруппаПодвалЛевая") = Неопределено Тогда
			Если ДанныеФормы.Элементы.Найти("ГруппаКомментарийАвтор") <> Неопределено Тогда
				СоздатьЭлементыФормыДляВводаСНТ(ДанныеФормы, "ГруппаКомментарийАвтор", ПослеГруппы);
			ИначеЕсли ДанныеФормы.Элементы.Найти("Подвал") <> Неопределено Тогда // УПК Подвал
				СоздатьЭлементыФормыДляВводаСНТ(ДанныеФормы, "Подвал", ПослеГруппы);
			Иначе
				СоздатьЭлементыФормыДляВводаСНТ(ДанныеФормы, ГруппаДляВключенияМеню, ПослеГруппы);
			КонецЕсли; 
		Иначе
			СоздатьЭлементыФормыДляВводаСНТ(ДанныеФормы, ГруппаДляВключенияМеню, ПослеГруппы);
		КонецЕсли;
				
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеФормы.СНТ) Тогда
		СНТ = ДанныеФормы.СНТ;
	Иначе
		ДанныеПоСНТ = СНТСервер.ПроверитьНаличиеСвязанногоСНТ(ДанныеФормы.Объект.Ссылка, Истина);
		Если (ТипЗнч(ДанныеПоСНТ) <> Тип("СписокЗначений")) И (ДанныеПоСНТ <> Неопределено) Тогда
			СНТ = ДанныеПоСНТ.Ссылка;
		ИначеЕсли (ТипЗнч(ДанныеПоСНТ) = Тип("СписокЗначений")) И (ДанныеПоСНТ.Количество()> 1) Тогда
			Если ДанныеФормы.СписокСНТ.Количество() = 0 Тогда
				Для каждого СтрокаТаблицыИсточник Из ДанныеПоСНТ Цикл
					ЗаполнитьЗначенияСвойств(ДанныеФормы.СписокСНТ.Добавить(), СтрокаТаблицыИсточник);
				КонецЦикла;
			КонецЕсли;
		ИначеЕсли (ТипЗнч(ДанныеПоСНТ) = Тип("СписокЗначений")) И (ДанныеПоСНТ.Количество() = 1) Тогда
			СНТ = ДанныеПоСНТ[0].Значение;
		Иначе 
			СНТ = ПредопределенноеЗначение("Документ.СНТ.ПустаяСсылка");
		КонецЕсли;
		
	КонецЕсли;
	
	ДанныеСНТ = Неопределено;
		
	Если ЗначениеЗаполнено(СНТ) Тогда
		
		РеквизитыСНТ = Новый Структура(
		"Ссылка, ТипСНТ, Дата, Проведен, ПометкаУдаления",
		СНТ, Перечисления.ТипыСНТ.Первичная, '00010101', Ложь, Ложь);
		
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		СНТ, "Дата, ТипСНТ, Проведен, ПометкаУдаления");
		ЗаполнитьЗначенияСвойств(РеквизитыСНТ, ЗначенияРеквизитов);
		
		ТекстСНТ = ПолучитьТекстСНТ(РеквизитыСНТ);
		
		ДанныеСНТ = Новый Структура("СНТ, ТекстСНТ, Проведен, ТипСНТ, ПометкаУдаления", СНТ, ТекстСНТ, РеквизитыСНТ.Проведен, РеквизитыСНТ.ТипСНТ, РеквизитыСНТ.ПометкаУдаления);
		ДанныеФормы.СНТ = СНТ;
		ДанныеФормы.ДанныеСНТ = ДанныеСНТ;
	
	ИначеЕсли ДанныеФормы.СписокСНТ.Количество()<> 0 Тогда
		
		СписокСсылокСНТ = Новый СписокЗначений;
		
		Для каждого СсылкаСНТ Из ДанныеФормы.СписокСНТ Цикл
			
			РеквизитыСНТ = Новый Структура(
			"Ссылка, ТипСНТ, Дата, Проведен, ПометкаУдаления",
			СсылкаСНТ.Значение, Перечисления.ТипыСНТ.Первичная, '00010101', Ложь, Ложь);
			
			ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			СсылкаСНТ.Значение, "Дата, ТипСНТ, Проведен, ПометкаУдаления");
			ЗаполнитьЗначенияСвойств(РеквизитыСНТ, ЗначенияРеквизитов);
			
			СписокСсылокСНТ.Добавить(РеквизитыСНТ);
			
		КонецЦикла; 
		
		ТекстСНТ = ПолучитьТекстСНТ(СписокСсылокСНТ);
		
		Если СписокСсылокСНТ.Количество() <> 0 Тогда
			
			СписокСНТ = Новый СписокЗначений;
			
			Для каждого Ссылки Из СписокСсылокСНТ Цикл
				СсылкаСНТ = Ссылки.Значение.Ссылка;
				СписокСНТ.Добавить(СсылкаСНТ);
			КонецЦикла; 
			
			ДанныеСНТ = Новый Структура("СНТ, ТекстСНТ, Проведен, ТипСНТ, ПометкаУдаления", СписокСНТ, ТекстСНТ, РеквизитыСНТ.Проведен, РеквизитыСНТ.ТипСНТ, РеквизитыСНТ.ПометкаУдаления);
			ДанныеФормы.СписокСНТ = СписокСНТ;
			ДанныеФормы.ДанныеСНТ = ДанныеСНТ;
			
		КонецЕсли;
		
	Иначе
		
		ДанныеФормы.СНТ = СНТ;
		ДанныеФормы.ДанныеСНТ = ДанныеСНТ;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьТекстСНТ(ДанныеСНТ) Экспорт
	
	Если ТипЗнч(ДанныеСНТ) = Тип("СписокЗначений") Тогда
		
		НадписьКоличествоСНТ = НСтр("ru='Всего СНТ: (%КоличествоДокументов%)'");
		Текст = СтрЗаменить(НадписьКоличествоСНТ, "%КоличествоДокументов%", ДанныеСНТ.Количество());
	
	Иначе
		
		СНТ = ?(ДанныеСНТ.Свойство("Ссылка"), ДанныеСНТ.Ссылка, Неопределено);
		ДополнительныйТекст = "";
		
		Если ДанныеСНТ.ПометкаУдаления Тогда
			ДополнительныйТекст = НСтр("ru=' (помечен на удаление)'");
		Иначе
			Если НЕ ДанныеСНТ.Проведен Тогда
				ДополнительныйТекст = НСтр("ru=' (не проведен)'");
			КонецЕсли;
		КонецЕсли;
		
		Текст = Строка(СНТ)+ ДополнительныйТекст;
		
	КонецЕсли;
		
	Возврат Текст;
	
КонецФункции 

Процедура ЗаполнитьТекстПроСНТ(Форма, РеквизитНадписьСНТ = "НадписьСНТ", ТребуетсяСНТ = Истина) Экспорт
	
	ДанныеСНТ = Форма.ДанныеСНТ;
	
	Если ТребуетсяСНТ И ДанныеСНТ = Неопределено Тогда
		Форма[РеквизитНадписьСНТ] = "";
		Возврат;
	КонецЕсли;
	
	Если НЕ ТребуетсяСНТ Тогда
		Форма[РеквизитНадписьСНТ] = НСтр("ru='Не требуется'");
		Форма.Элементы[РеквизитНадписьСНТ].ЦветТекста = Новый Цвет(51, 51, 51); // текст формы
	Иначе
		Форма[РеквизитНадписьСНТ] = ДанныеСНТ.ТекстСНТ;
		
		Если ТребуетсяСНТ И (ДанныеСНТ.ПометкаУдаления ИЛИ НЕ ДанныеСНТ.Проведен) Тогда
			Форма.Элементы[РеквизитНадписьСНТ].ЦветТекста = Новый Цвет(255, 0, 0);  // красный
		Иначе
			Форма.Элементы[РеквизитНадписьСНТ].ЦветТекста = Новый Цвет(51, 51, 51); // текст формы
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

Процедура УправлениеГруппойСНТ(Форма, ТребуетсяСНТ = Истина) Экспорт
	
	Элементы = Форма.Элементы;
	
	Если ТребуетсяСНТ И (ЗначениеЗаполнено(Форма.СписокСНТ) ИЛИ ЗначениеЗаполнено(Форма.СНТ)) Тогда
		Элементы.ГруппаСНТ.ТекущаяСтраница = Элементы.ГруппаСсылкаСНТ;
	КонецЕсли;
	
КонецПроцедуры

Процедура СоздатьЭлементыФормыДляВводаСНТ(Форма, ГруппаДляВключенияМеню = "ГруппаСсылки", ПослеГруппы = "") Экспорт

	ДокументИсточник = Форма.Объект.Ссылка;
	
	//Добавим необходимые для работы реквизиты формы
	ДобавляемыеРеквизиты = Новый Массив;
	НовыйРеквизитНадписиСНТ = Новый РеквизитФормы("НадписьСНТ", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(500))); 
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизитНадписиСНТ);
	
	НовыйРеквизитДанныеСНТ = Новый РеквизитФормы("ДанныеСНТ", Новый ОписаниеТипов());
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизитДанныеСНТ);
	
	НовыйРеквизитСНТ = Новый РеквизитФормы("СНТ", Новый ОписаниеТипов("ДокументСсылка.СНТ"));
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизитСНТ);
	
	НовыйРеквизитСписокСНТ = Новый РеквизитФормы("СписокСНТ", Новый ОписаниеТипов("СписокЗначений"));
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизитСписокСНТ);
	
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	Если ЗначениеЗаполнено(ПослеГруппы) Тогда
		
		//Создадим группу страниц для работы с СНТ
		ГруппаСНТ = Форма.Элементы.Вставить("ГруппаСНТ", Тип("ГруппаФормы"),, Форма.Элементы[ПослеГруппы]);
		ГруппаСНТ.Вид = ВидГруппыФормы.Страницы;
		ГруппаСНТ.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
		
	Иначе 
		//Получим группу в котороую встроим элементы
		ПодменюРазмещения = Форма.Элементы[ГруппаДляВключенияМеню];
		//Создадим группу страниц для работы с СНТ
		ГруппаСНТ = Форма.Элементы.Добавить("ГруппаСНТ", Тип("ГруппаФормы"), ПодменюРазмещения);
		ГруппаСНТ.Вид = ВидГруппыФормы.Страницы;
		ГруппаСНТ.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
		
	КонецЕсли;
	
	//Создадим страницу ссылки СНТ
	ГруппаСсылкаСНТ = Форма.Элементы.Добавить("ГруппаСсылкаСНТ", Тип("ГруппаФормы"), ГруппаСНТ);
	ГруппаСсылкаСНТ.Вид = ВидГруппыФормы.Страница;
	
	ПолеНадписиСНТ = Форма.Элементы.Добавить("НадписьСНТ", Тип("ПолеФормы"), ГруппаСсылкаСНТ);
	ПолеНадписиСНТ.Вид = ВидПоляФормы.ПолеНадписи;
	ПолеНадписиСНТ.Гиперссылка = Истина;
	ПолеНадписиСНТ.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	ПолеНадписиСНТ.ПутьКДанным = "НадписьСНТ";
	
	ПолеНадписиСНТ.УстановитьДействие("Нажатие", "НадписьСНТНажатие");
	
КонецПроцедуры

Процедура СоздатьЭлементыФормыСпискаДляВводаСНТ(Форма, ГруппаДляВключенияМеню = "ФормаКоманднаяПанель", СписокДокументов = "Список") Экспорт

	//Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЭлектронныеСНТ") Тогда 
	//	Возврат;
	//КонецЕсли;
	//
	////Получим группу в котороую встроим элементы
	//ПодменюРазмещения = Форма.Элементы[ГруппаДляВключенияМеню];
	//
	////Добавим подменю создания СНТ
	//ГруппаСозданиеСНТ = Форма.Элементы.Добавить("ГруппаСозданиеСНТ", Тип("ГруппаФормы"), ПодменюРазмещения);
	//ГруппаСозданиеСНТ.Вид = ВидГруппыФормы.Подменю;
	//ГруппаСозданиеСНТ.Видимость = Истина;
	//ГруппаСозданиеСНТ.Заголовок = "СНТ";
	//ГруппаСозданиеСНТ.РастягиватьПоГоризонтали = Истина;
	//
	////Создание команду обработки создания СНТ
	//НоваяКоманда = Форма.Команды.Добавить("СоздатьСНТ");
	//НоваяКоманда.Заголовок = "Ввести новую СНТ";
	//НоваяКоманда.Действие = "ОбработкаКомандыСозданияСНТ";
	//НоваяКоманда.ИзменяетСохраняемыеДанные = Ложь;
	//НоваяКоманда.Отображение = ОтображениеКнопки.КартинкаИТекст;
	//
	//НовыйЭлемент = Форма.Элементы.Добавить("СоздатьСНТ", Тип("КнопкаФормы"), ГруппаСозданиеСНТ);
	//НовыйЭлемент.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	//НовыйЭлемент.ИмяКоманды = "СоздатьСНТ";
	
КонецПроцедуры

#КонецОбласти

#Область ОбновлениеИнформационнойБазы

// Заполняет список обработчиков обновления информационной базы.
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики, ЗавершениеОбновления = Ложь) Экспорт
	

	
КонецПроцедуры

#КонецОбласти

#Область ИнтеграцияПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

Процедура ПриЗаполненииОграниченияДоступа(Ограничение, ИмяДокумента) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#Область СинхронизацияИСЭСФ

// Получение СНТ при автосинхронизации с ИС ЭСФ
Процедура ПолучитьВходящиеСНТРегламентноеЗадание(ДанныеПрофиляИСЭСФ, ИдентификаторСессии, ВерсияИСЭСФ) Экспорт
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьЭлектронныеСНТ") Тогда 
		
		ДанныеПрофиля = ДанныеПрофиляИСЭСФ.ПрофильИСЭСФ;
		
		ПараметрыМетодаВходящихСНТ = ЭСФСервер.ПолучитьПараметрыМетода(ДанныеПрофиля.СтруктурнаяЕдиница.Ссылка, ВРег("querySntUpdates"), Перечисления.НаправленияЭСФ.ПустаяСсылка());
		
		ЭтоПоследняяПорция = Ложь;
		МассивИдентификаторовДляОбновленияСтатусаПриемаСНТ = Новый Массив(); // накапливаем идентификаторы, чтобы отправить уведомление после получения всех документов
		МассивСНТДляПолученияИдентификаторовТоваровСНТ = Новый Массив(); // накапливаем ссылки СНТ, чтобы отправить завтрос на получение идентификаторов товаров
		
		// Получить новые входящие СНТ.
		Пока НЕ ЭтоПоследняяПорция Цикл
			ЭтоПоследняяПорция = ПолучитьДанныеНовыхСНТ(Перечисления.НаправленияЭСФ.Входящий, ДанныеПрофиляИСЭСФ, Ложь, Ложь, ИдентификаторСессии, ВерсияИСЭСФ, ПараметрыМетодаВходящихСНТ, МассивИдентификаторовДляОбновленияСтатусаПриемаСНТ);
		КонецЦикла;
		
		// Получить новые исходящих СНТ.
		ЭтоПоследняяПорция = Ложь;
		Пока НЕ ЭтоПоследняяПорция Цикл
			ЭтоПоследняяПорция = ПолучитьДанныеНовыхСНТ(Перечисления.НаправленияЭСФ.Исходящий, ДанныеПрофиляИСЭСФ, Ложь, Ложь, ИдентификаторСессии, ВерсияИСЭСФ, ПараметрыМетодаВходящихСНТ, МассивИдентификаторовДляОбновленияСтатусаПриемаСНТ);
		КонецЦикла;
		
		ПодтвердитьДоставкуВходящихСНТ(МассивИдентификаторовДляОбновленияСтатусаПриемаСНТ, ДанныеПрофиляИСЭСФ, ИдентификаторСессии); // Отправка уведомления о приеме
		
	КонецЕсли;
	
КонецПроцедуры
	
	// Выполняет метод queryUpdate() сервиса API ИС ЭСФ.
Функция ПолучитьДанныеНовыхСНТ(Знач НаправлениеСНТ, Знач ПрофильИСЭСФ, Знач ПолучитьОднуПорцию, Знач ТолькоСоздатьОбновитьФайлы, ИдентификаторСессии, ВерсияИСЭСФ, ПараметрыМетодаСНТ, МассивИдентификаторовДляОбновленияСтатусаПриемаСНТ) Экспорт
	  
	Возврат СНТСерверПовтИсп.ОбработкаОбменСНТ().ПолучитьДанныеНовыхСНТ(НаправлениеСНТ, ПрофильИСЭСФ, ПолучитьОднуПорцию, ТолькоСоздатьОбновитьФайлы, ИдентификаторСессии, ВерсияИСЭСФ, ПараметрыМетодаСНТ, МассивИдентификаторовДляОбновленияСтатусаПриемаСНТ);

КонецФункции

Процедура ПодтвердитьДоставкуВходящихСНТ(МассивИдентификаторовСНТ, Знач ПрофильИСЭСФ, ИдентификаторСессии) Экспорт
	
	СНТСерверПовтИсп.ОбработкаОбменСНТ().ПодтвердитьДоставкуВходящихСНТ(МассивИдентификаторовСНТ, ПрофильИСЭСФ, ИдентификаторСессии);
	
КонецПроцедуры


#КонецОбласти

#Область СверкаДанныхСНТ
//Сравнивает суммовые значения между СНТ и первичным документом
Процедура СверитьЧисловыеДанныеСНТиПервичногоДокумента(ОбъектСНТ, РезультатПроверки) Экспорт
	
	Если ОбъектСНТ.ДокументОснование <> Неопределено Тогда
		СсылкаСНТ = ОбъектСНТ.Ссылка;
		СсылкаПервичныйДокумент = ОбъектСНТ.ДокументОснование.Ссылка;
		Если ТипЗнч(СсылкаПервичныйДокумент) = Тип("ДокументСсылка.РеализацияТоваровУслуг") 
			ИЛИ ТипЗнч(СсылкаПервичныйДокумент) = Тип("ДокументСсылка.ОтчетОРозничныхПродажах") Тогда
			МетаданныеДокумента = СсылкаПервичныйДокумент.Метаданные();
			ПолноеИмяДокумента = МетаданныеДокумента.ПолноеИмя();
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПервичныйДокумент.Ссылка,
			|	ПервичныйДокумент.СуммаВключаетАкциз,
			|	ПервичныйДокумент.СуммаВключаетНДС,
			|	ПервичныйДокумент.УчитыватьАкциз,
			|	ПервичныйДокумент.УчитыватьНДС
			|ПОМЕСТИТЬ ПервичныеДокументы
			|ИЗ
			|	" + ПолноеИмяДокумента + " КАК ПервичныйДокумент
			|ГДЕ
			|	ПервичныйДокумент.Ссылка = &СсылкаПервичныйДокумент
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ПервичныйДокументТовары.СуммаНДС КАК СуммаНДС,
			|	ПервичныйДокументТовары.Сумма КАК Сумма,
			|	ПервичныйДокументТовары.СуммаАкциза КАК СуммаАкциза,
			|	ПервичныйДокументТовары.Количество КАК Количество,
			|	ПервичныйДокументТовары.Сумма КАК СуммаДляРасчетаСНалогами,
			|	ПервичныйДокументТовары.Ссылка
			|ПОМЕСТИТЬ ТоварыПервичныйДокумент
			|ИЗ
			|	" + ПолноеИмяДокумента + ".Товары КАК ПервичныйДокументТовары
			|ГДЕ
			|	ПервичныйДокументТовары.Ссылка = &СсылкаПервичныйДокумент
			|
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СУММА(ТоварыПервичныйДокумент.СуммаНДС) КАК СуммаНДС,
			|	СУММА(ВЫБОР
			|		КОГДА ПервичныеДокументы.УчитыватьНДС
			|				И ПервичныеДокументы.СуммаВключаетНДС
			|			ТОГДА ВЫБОР
			|					КОГДА ПервичныеДокументы.УчитыватьАкциз
			|							И ПервичныеДокументы.СуммаВключаетАкциз
			|						ТОГДА ТоварыПервичныйДокумент.Сумма - ТоварыПервичныйДокумент.СуммаАкциза - ТоварыПервичныйДокумент.СуммаНДС
			|					ИНАЧЕ ТоварыПервичныйДокумент.Сумма - ТоварыПервичныйДокумент.СуммаНДС
			|				КОНЕЦ
			|		ИНАЧЕ ВЫБОР
			|				КОГДА ПервичныеДокументы.УчитыватьАкциз
			|						И ПервичныеДокументы.СуммаВключаетАкциз
			|					ТОГДА ТоварыПервичныйДокумент.Сумма - ТоварыПервичныйДокумент.СуммаАкциза
			|				ИНАЧЕ ТоварыПервичныйДокумент.Сумма
			|			КОНЕЦ
			|	КОНЕЦ) КАК СуммаБезНалогов,
			|	СУММА(ВЫБОР
			|		КОГДА ПервичныеДокументы.УчитыватьНДС
			|				И ПервичныеДокументы.СуммаВключаетНДС
			|			ТОГДА ВЫБОР
			|					КОГДА ПервичныеДокументы.УчитыватьАкциз
			|							И ПервичныеДокументы.СуммаВключаетАкциз
			|						ТОГДА ТоварыПервичныйДокумент.Сумма
			|					ИНАЧЕ ТоварыПервичныйДокумент.Сумма + ТоварыПервичныйДокумент.СуммаАкциза
			|				КОНЕЦ
			|		ИНАЧЕ ВЫБОР
			|				КОГДА ПервичныеДокументы.УчитыватьАкциз
			|						И ПервичныеДокументы.СуммаВключаетАкциз
			|					ТОГДА ТоварыПервичныйДокумент.Сумма + ТоварыПервичныйДокумент.СуммаНДС
			|				ИНАЧЕ ТоварыПервичныйДокумент.Сумма + ТоварыПервичныйДокумент.СуммаНДС + ТоварыПервичныйДокумент.СуммаАкциза
			|			КОНЕЦ
			|	КОНЕЦ) КАК СуммаСНалогами,
			|	СУММА(ТоварыПервичныйДокумент.СуммаАкциза) КАК СуммаАкциза,
			|	СУММА(ТоварыПервичныйДокумент.Количество) КАК Количество
			|ПОМЕСТИТЬ ТоварыПервичныйДокументСгруппированные
			|ИЗ
			|	ТоварыПервичныйДокумент КАК ТоварыПервичныйДокумент
			|		ЛЕВОЕ СОЕДИНЕНИЕ ПервичныеДокументы КАК ПервичныеДокументы
			|		ПО ТоварыПервичныйДокумент.Ссылка = ПервичныеДокументы.Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СНТТовары.СуммаНДС КАК СуммаНДС,
			|	СНТТовары.Сумма КАК Сумма,
			|	СНТТовары.СуммаАкциза КАК СуммаАкциза,
			|	СНТТовары.Количество КАК Количество,
			|	СНТТовары.СуммаБезНалогов КАК СуммаБезНалогов
			|ПОМЕСТИТЬ ТоварыСНТ
			|ИЗ
			|	Документ.СНТ.Товары КАК СНТТовары
			|ГДЕ
			|	СНТТовары.Ссылка = &СсылкаСНТ
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	СНТТоварыВС.СуммаНДС,
			|	СНТТоварыВС.Сумма,
			|	СНТТоварыВС.СуммаАкциза,
			|	СНТТоварыВС.Количество,
			|	СНТТоварыВС.СуммаБезНалогов
			|ИЗ
			|	Документ.СНТ.ТоварыВС КАК СНТТоварыВС
			|ГДЕ
			|	СНТТоварыВС.Ссылка = &СсылкаСНТ
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	СНТЭтиловыйСпирт.СуммаНДС,
			|	СНТЭтиловыйСпирт.Сумма,
			|	СНТЭтиловыйСпирт.СуммаАкциза,
			|	СНТЭтиловыйСпирт.Количество,
			|	СНТЭтиловыйСпирт.СуммаБезНалогов
			|ИЗ
			|	Документ.СНТ.ЭтиловыйСпирт КАК СНТЭтиловыйСпирт
			|ГДЕ
			|	СНТЭтиловыйСпирт.Ссылка = &СсылкаСНТ
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	СНТВиноматериал.СуммаНДС,
			|	СНТВиноматериал.Сумма,
			|	СНТВиноматериал.СуммаАкциза,
			|	СНТВиноматериал.Количество,
			|	СНТВиноматериал.СуммаБезНалогов
			|ИЗ
			|	Документ.СНТ.Виноматериал КАК СНТВиноматериал
			|ГДЕ
			|	СНТВиноматериал.Ссылка = &СсылкаСНТ
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	СНТПивоПивныеНапитки.СуммаНДС,
			|	СНТПивоПивныеНапитки.Сумма,
			|	СНТПивоПивныеНапитки.СуммаАкциза,
			|	СНТПивоПивныеНапитки.КоличествоУпаковок,
			|	СНТПивоПивныеНапитки.СуммаБезНалогов
			|ИЗ
			|	Документ.СНТ.ПивоПивныеНапитки КАК СНТПивоПивныеНапитки
			|ГДЕ
			|	СНТПивоПивныеНапитки.Ссылка = &СсылкаСНТ
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	СНТАлкогольнаяПродукцияКромеПива.СуммаНДС,
			|	СНТАлкогольнаяПродукцияКромеПива.Сумма,
			|	СНТАлкогольнаяПродукцияКромеПива.СуммаАкциза,
			|	СНТАлкогольнаяПродукцияКромеПива.КоличествоБутылок,
			|	СНТАлкогольнаяПродукцияКромеПива.СуммаБезНалогов
			|ИЗ
			|	Документ.СНТ.АлкогольнаяПродукцияКромеПива КАК СНТАлкогольнаяПродукцияКромеПива
			|ГДЕ
			|	СНТАлкогольнаяПродукцияКромеПива.Ссылка = &СсылкаСНТ
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	СНТДанныеПоНефтепродуктам.СуммаНДС,
			|	СНТДанныеПоНефтепродуктам.Сумма,
			|	СНТДанныеПоНефтепродуктам.СуммаАкциза,
			|	СНТДанныеПоНефтепродуктам.Количество,
			|	СНТДанныеПоНефтепродуктам.СуммаБезНалогов
			|ИЗ
			|	Документ.СНТ.ДанныеПоНефтепродуктам КАК СНТДанныеПоНефтепродуктам
			|ГДЕ
			|	СНТДанныеПоНефтепродуктам.Ссылка = &СсылкаСНТ
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	СНТДанныеПоБиотопливу.СуммаНДС,
			|	СНТДанныеПоБиотопливу.Сумма,
			|	СНТДанныеПоБиотопливу.СуммаАкциза,
			|	СНТДанныеПоБиотопливу.Количество,
			|	СНТДанныеПоБиотопливу.СуммаБезНалогов
			|ИЗ
			|	Документ.СНТ.ДанныеПоБиотопливу КАК СНТДанныеПоБиотопливу
			|ГДЕ
			|	СНТДанныеПоБиотопливу.Ссылка = &СсылкаСНТ
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	СНТТабачнаяПродукция.СуммаНДС,
			|	СНТТабачнаяПродукция.Сумма,
			|	СНТТабачнаяПродукция.СуммаАкциза,
			|	СНТТабачнаяПродукция.Количество,
			|	СНТТабачнаяПродукция.СуммаБезНалогов
			|ИЗ
			|	Документ.СНТ.ТабачнаяПродукция КАК СНТТабачнаяПродукция
			|ГДЕ
			|	СНТТабачнаяПродукция.Ссылка = &СсылкаСНТ
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	СНТДругиеТоварыЦифроваяМаркировка.СуммаНДС,
			|	СНТДругиеТоварыЦифроваяМаркировка.Сумма,
			|	СНТДругиеТоварыЦифроваяМаркировка.СуммаАкциза,
			|	СНТДругиеТоварыЦифроваяМаркировка.Количество,
			|	СНТДругиеТоварыЦифроваяМаркировка.СуммаБезНалогов
			|ИЗ
			|	Документ.СНТ.ДругиеТоварыЦифроваяМаркировка КАК СНТДругиеТоварыЦифроваяМаркировка
			|ГДЕ
			|	СНТДругиеТоварыЦифроваяМаркировка.Ссылка = &СсылкаСНТ
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	СНТТоварыЭкспортныйКонтроль.СуммаНДС,
			|	СНТТоварыЭкспортныйКонтроль.Сумма,
			|	СНТТоварыЭкспортныйКонтроль.СуммаАкциза,
			|	СНТТоварыЭкспортныйКонтроль.Количество,
			|	СНТТоварыЭкспортныйКонтроль.СуммаБезНалогов
			|ИЗ
			|	Документ.СНТ.ТоварыЭкспортныйКонтроль КАК СНТТоварыЭкспортныйКонтроль
			|ГДЕ
			|	СНТТоварыЭкспортныйКонтроль.Ссылка = &СсылкаСНТ
			|
			|;
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СУММА(ТоварыСНТ.СуммаНДС) КАК СуммаНДС,
			|	СУММА(ТоварыСНТ.Сумма) КАК Сумма,
			|	СУММА(ТоварыСНТ.СуммаАкциза) КАК СуммаАкциза,
			|	СУММА(ТоварыСНТ.Количество) КАК Количество,
			|	СУММА(ТоварыСНТ.СуммаБезНалогов) КАК СуммаБезНалогов
			|ПОМЕСТИТЬ ВсеТоварыСНТ
			|ИЗ
			|	ТоварыСНТ КАК ТоварыСНТ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВЫБОР
			|		КОГДА ТоварыПервичныйДокументСгруппированные.СуммаНДС = ВсеТоварыСНТ.СуммаНДС
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ КАК СуммаНДСРавна,
			|	ВЫБОР
			|		КОГДА ТоварыПервичныйДокументСгруппированные.СуммаБезНалогов = ВсеТоварыСНТ.СуммаБезНалогов
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ КАК СуммаБезНалоговРавна,
			|	ВЫБОР
			|		КОГДА ТоварыПервичныйДокументСгруппированные.СуммаАкциза = ВсеТоварыСНТ.СуммаАкциза
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ КАК СуммаАкцизаРавна,
			|	ВЫБОР
			|		КОГДА ТоварыПервичныйДокументСгруппированные.Количество = ВсеТоварыСНТ.Количество
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ КАК КоличествоРавно,
			|	ВЫБОР
			|		КОГДА ТоварыПервичныйДокументСгруппированные.СуммаСНалогами = ВсеТоварыСНТ.Сумма
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ КАК СуммаСНалогамиРавна
			|ИЗ
			|	ТоварыПервичныйДокументСгруппированные КАК ТоварыПервичныйДокументСгруппированные,
			|	ВсеТоварыСНТ КАК ВсеТоварыСНТ";
			
			Запрос.УстановитьПараметр("СсылкаПервичныйДокумент", СсылкаПервичныйДокумент);
			Запрос.УстановитьПараметр("СсылкаСНТ", СсылкаСНТ);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Если ВыборкаДетальныеЗаписи.Следующий() Тогда
				
				Если Не ВыборкаДетальныеЗаписи.КоличествоРавно Тогда
					
					ТекстСообщения = НСтр("ru = 'Отличаются итоговые данные по колонке ""Количество"" между первичным документом и СНТ'"); 
					
					РезультатПроверки.УведомительныеОшибки.Добавить(ТекстСообщения);
					
				КонецЕсли;
				
				Если Не ВыборкаДетальныеЗаписи.СуммаАкцизаРавна Тогда
					
					ТекстСообщения = НСтр("ru = 'Отличаются итоговые данные по колонке ""Сумма акциза"" между первичным документом и СНТ'"); 
					
					РезультатПроверки.УведомительныеОшибки.Добавить(ТекстСообщения);
					
				КонецЕсли;
				
				Если Не ВыборкаДетальныеЗаписи.СуммаБезНалоговРавна Тогда
					
					ТекстСообщения = НСтр("ru = 'Отличаются итоговые данные по колонке ""Сумма Без Налогов"" между первичным документом и СНТ'"); 
					
					РезультатПроверки.УведомительныеОшибки.Добавить(ТекстСообщения);
					
				КонецЕсли;
				
				Если Не ВыборкаДетальныеЗаписи.СуммаНДСРавна Тогда
					
					ТекстСообщения = НСтр("ru = 'Отличаются итоговые данные по колонке ""Сумма НДС"" между первичным документом и СНТ'"); 
					
					РезультатПроверки.УведомительныеОшибки.Добавить(ТекстСообщения);
					
				КонецЕсли;
				
				Если Не ВыборкаДетальныеЗаписи.СуммаСНалогамиРавна Тогда
					
					ТекстСообщения = НСтр("ru = 'Отличаются итоговые данные по колонке ""Сумма с налогами"" между первичным документом и СНТ'"); 
					
					РезультатПроверки.УведомительныеОшибки.Добавить(ТекстСообщения);
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти