
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Организация") Тогда
		Отбор = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Отбор.Использование = Истина;
		Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Организация");
		Отбор.ПравоеЗначение = Параметры.Организация;
	КонецЕсли;
	
	Если Параметры.Свойство("Сотрудник") Тогда
		Отбор = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Отбор.Использование = Истина;
		Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Сотрудник");
		Отбор.ПравоеЗначение = Параметры.Сотрудник;
	КонецЕсли;
	
	Если Параметры.Свойство("ЭтоДополнительноеСоглашение") Тогда
		Отбор = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Отбор.Использование = Истина;
		Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЭтоДополнительноеСоглашение");
		Отбор.ПравоеЗначение = Параметры.ЭтоДополнительноеСоглашение;
	КонецЕсли;
	
	Если Параметры.Свойство("ВыбранноеЗначение") Тогда
		Элементы.Список.ТекущаяСтрока = Документы.ЭТД.НайтиПоРеквизиту(Новый ПараметрКомпоновкиДанных("Идентификатор"), Параметры.ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ТолькоПросмотр = Истина;
	
КонецПроцедуры

#КонецОбласти