
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭТДСервер.ПриСозданииНаСервереФормыСпискаЭТД(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
	ЭТДСервер.ПроверитьИспользованиеСервернойКриптографии(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийМестоУстановкиБиблиотекиНаСервереОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	ЭТДКлиент.ОбработкаНавигационнойСсылкиМестоУстановкиБиблиотеки(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Элементы, "ФормаСоздатьДопСоглашение") Тогда
	
		ТекущиеДанные = Элементы.Список.ТекущиеДанные;
		
		Если ТекущиеДанные = Неопределено Тогда
			Элементы.ФормаСоздатьДопСоглашение.Доступность = Ложь;
			Возврат;
		КонецЕсли;
		
		Элементы.ФормаСоздатьДопСоглашение.Доступность = 
			Не ТекущиеДанные.ЭтоДополнительноеСоглашение
			И  ТекущиеДанные.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭТД.Зарегистрирован");
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьДопСоглашение(Команда)
	
	ПараметрыОткрытияФормы = Новый Структура("Основание",  Элементы.Список.ТекущаяСтрока);
	ОткрытьФорму("Документ.ЭТД.ФормаОбъекта", ПараметрыОткрытияФормы);
	
КонецПроцедуры

#КонецОбласти
