
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Контейнер = ЭСФКлиентСервер.КонтейнерМетодов();	
	Контейнер.ПриОткрытииФормы(ЭтаФорма, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	Если ПроверитьЗаполнение() Тогда
		Закрыть(Пароль);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьПароль(Команда)
	
	ИмяЭлементаВвода = "Пароль";
	ИмяЭлементаПереключателя = "ПоказыватьПароль";
	ПереключитьРежимПароля(ИмяЭлементаВвода, ИмяЭлементаПереключателя);
	
КонецПроцедуры

&НаСервере
Процедура ПереключитьРежимПароля(ИмяЭлементаВвода, ИмяЭлементаПереключателя)
	
	Если Элементы.Найти(ИмяЭлементаВвода) <> Неопределено Тогда
		Элементы[ИмяЭлементаВвода].РежимПароля = НЕ Элементы[ИмяЭлементаВвода].РежимПароля;
		
		Если Элементы.Найти(ИмяЭлементаПереключателя) <> Неопределено Тогда
			
			Элементы[ИмяЭлементаПереключателя].Картинка = ?(Элементы[ИмяЭлементаВвода].РежимПароля,
				БиблиотекаКартинок.ПоказыватьПарольЭСФ,
				БиблиотекаКартинок.НеПоказыватьПарольЭСФ);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры