
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	СхемаКомпоновкиДанных = Неопределено;
	Если Параметры.Свойство("АдресСКД")
		И ЗначениеЗаполнено(Параметры.АдресСКД) Тогда
		СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(Параметры.АдресСКД);
	КонецЕсли;
	
	// Заполнение доступных полей
	ЭтаФорма.АвтоЗаголовок = Ложь;
	Если СхемаКомпоновкиДанных = Неопределено Тогда
		СхемаКомпоновкиДанных = Обработки.ПечатьКодовМаркировкиИСМПТК.ПолучитьМакет("ПоляШаблонаИСМП");
	КонецЕсли;
	
	ЭтаФорма.Заголовок = НСтр("ru = 'Редактирование шаблона печати этикетки'");
	Элементы.ГруппаШаблоныПоУмолчанию.Видимость = Ложь;
	Элементы.ФормаЗагрузитьШаблонИСМППоУмолчанию.Видимость = Истина;
	
	СтруктураШаблона = СтруктураШаблона();
	АдресВХранилище  = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, Новый УникальныйИдентификатор);
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресВХранилище));
	
	НеGS1 = Параметры.Ссылка.НеGS1;
	
	Если СтруктураШаблона <> Неопределено Тогда
		// Загрузка ранее сохраненного шаблона
		СтруктураШаблона.Свойство("РедакторТабличныйДокумент"	, ПолеТабличногоДокумента);
		СтруктураШаблона.Свойство("КоличествоПоВертикали"		, КоличествоПоВертикали);
		СтруктураШаблона.Свойство("КоличествоПоГоризонтали"		, КоличествоПоГоризонтали);
		СтруктураШаблона.Свойство("ТипКода"						, ?(НеGS1, 18, 24)); //18 - DataMatrix, 24 - GS1 DataMatrix
		СтруктураШаблона.Свойство("УровеньКоррекцииQR"			, УровеньКоррекцииQR);
		СтруктураШаблона.Свойство("РазмерШрифта"				, РазмерШрифта);
		СтруктураШаблона.Свойство("ОтображатьТекст"				, ОтображатьТекст);
		СтруктураШаблона.Свойство("УголПоворота"				, УголПоворота);
		
		ТипКода = ?(ЭтаФорма.НеGS1, 18, 24);
	Иначе
		
		//Создание нового со значениями по умолчанию
		ЗаполнитьНовыйШаблонПоУмолчанию();
		
	КонецЕсли;
	
	Элементы.РазмерШрифта.Доступность = ОтображатьТекст;
	Элементы.УровеньКоррекцииQR.Видимость = (ТипКода = 16 ИЛИ ТипКода = 99);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если СохранятьИзменения ИЛИ Модифицированность Тогда
		
		Если ЗавершениеРаботы Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Если СохранятьИзменения Тогда
		Если ПолеТабличногоДокумента.ОбластьПечати = Неопределено Тогда
			ОбщегоНазначенияИСМПТККлиентСерверПереопределяемый.СообщитьПользователю(НСтр("ru = 'Не установлена область печати'"),
																				   ЭтаФорма,
																				   "ПолеТабличногоДокумента",
																				   ,
																				   Отказ);
			Возврат;
		КонецЕсли;
		
		НаличиеСтрокСАвтовысотой = Ложь;
		
		Если Не РазрешитьАвтовысотуСтрок Тогда
			
			Для Индекс = ПолеТабличногоДокумента.ОбластьПечати.Верх По ПолеТабличногоДокумента.ОбластьПечати.Низ Цикл
				
				Если ПолеТабличногоДокумента.Область("R" + Формат(Индекс, "ЧГ=0")).АвтоВысотаСтроки Тогда
					НаличиеСтрокСАвтовысотой = Истина;
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
			Если НаличиеСтрокСАвтовысотой Тогда
				
				ОбработчикОповещения = Новый ОписаниеОповещения("ОповещениеВопросаОВключеннойАвтовысотеСтрок", ЭтотОбъект);
				ТекстВопроса = НСтр("ru = 'В шаблоне содержатся строки с автоопределением высоты.'")
							 + Символы.ПС
							 + НСтр("ru = 'Продолжить сохранение изменений?'");
							
				ПоказатьВопрос(ОбработчикОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если РазрешитьАвтовысотуСтрок ИЛИ НЕ НаличиеСтрокСАвтовысотой Тогда
			
			АдресШаблона = СохранитьЗакрытьСервер(Отказ);
			
			Если НЕ Отказ Тогда
				Оповестить("ИзмененШаблон", АдресШаблона, ЭтаФорма);
			Иначе
				ДополнительныеПараметры = Новый Структура("АдресШаблона", АдресШаблона);
				ОбработчикОповещения 	= Новый ОписаниеОповещения("ОповещениеВопросаОНеСоответствииКоличества",
																   ЭтотОбъект,
																   ДополнительныеПараметры);
					
				ПоказатьВопрос(ОбработчикОповещения,
							   НСтр("ru = 'Превышено максимальное количество на странице. Сохранить изменения?'"),
							   РежимДиалогаВопрос.ОКОтмена,
							   ,
							   КодВозвратаДиалога.Отмена);
				
			КонецЕсли;
			
		Иначе
			
			Отказ = Истина;
			
		КонецЕсли;
		
	ИначеЕсли Модифицированность Тогда
		Отказ = Истина;
		ДополнительныеПараметры = Новый Структура;
		ОбработчикОповещения = Новый ОписаниеОповещения("ОповещениеВопросаОЗакрытии",
													    ЭтотОбъект,
														ДополнительныеПараметры);
		ПоказатьВопрос(ОбработчикОповещения,
					   НСтр("ru = 'Данные были изменены. Сохранить изменения?'"),
					   РежимДиалогаВопрос.ДаНетОтмена,
					   ,
					   КодВозвратаДиалога.Да);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьПредставлениеТипаКода();
	
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

&НаКлиенте
Процедура ОповещениеЗаполнитьШаблонИСМППоУмолчанию(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		ОповещениеОВыбореШаблона = Новый ОписаниеОповещения("ОбработатьВыборШаблонаЭтикетки", ЭтаФорма);
		ОткрытьФорму("Справочник.ХранилищеШаблоновИСМПТК.Форма.ФормаВыбораШаблона",,ЭтотОбъект, Истина,,,ОповещениеОВыбореШаблона, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
КонецПроцедуры

#Область ОповещенияИмпортаИзФайла

&НаКлиенте
Процедура ОповещениеИмпортироватьШаблонИзФайла(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	
	ДиалогОткрытияФайла.Заголовок = НСтр("ru = 'Открыть шаблон'");
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	ДиалогОткрытияФайла.ПредварительныйПросмотр = Ложь;
	ДиалогОткрытияФайла.Фильтр = "Шаблоны|*.mxl";
	
	ОбработчикОповещения = Новый ОписаниеОповещения(
										"ВыборФайлаИмпортаШаблонаЗавершение",
										ЭтотОбъект,
										ДополнительныеПараметры);
	ДиалогОткрытияФайла.Показать(ОбработчикОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборФайлаИмпортаШаблонаЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено
		И ВыбранныеФайлы.Количество() > 0 Тогда
		ДополнительныеПараметры.Вставить("ИмяФайла", ВыбранныеФайлы[0]);
		ОбработчикОповещения = Новый ОписаниеОповещения(
										"ИмпортШаблонаИзФайлаЗавершение",
										ЭтотОбъект,
										ДополнительныеПараметры);
		НачатьПомещениеФайлов(ОбработчикОповещения, Неопределено, ВыбранныеФайлы[0], Ложь) 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИмпортШаблонаИзФайлаЗавершение(ПомещенныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ПомещенныеФайлы.Количество() > 0 Тогда
		АдресФайла = ПомещенныеФайлы[0].Хранение;
		ЗагрузкаШаблонаИзФайлаЗавершениеСервер(АдресФайла);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ОповещениеЭкспортироватьШаблонВФайл(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено
		И ВыбранныеФайлы.Количество() > 0 Тогда
		ПолеТабличногоДокумента.Записать(ВыбранныеФайлы[0]);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеДобавитьШтрихкод(Ответ, ДополнительныеПараметры) Экспорт
	
	ТекущаяОбласть  = ДополнительныеПараметры.ТекущаяОбласть;
	ИмяПоляВШаблоне = ДополнительныеПараметры.ИмяПоляВШаблоне;
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		ВставитьВШаблонРисунокШтрихкода(ТекущаяОбласть.Имя, ИмяПоляВШаблоне);
		
	Иначе
		
		ТекущаяОбласть.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Шаблон;
		ТекущаяОбласть.Текст = ТекущаяОбласть.Текст + "["+ИмяПоляВШаблоне+"]";
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеВопросаОЗакрытии(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		СохранитьЗакрыть(Неопределено);
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеВопросаОНеСоответствииКоличества(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.ОК Тогда
		Оповестить("ИзмененШаблон", ДополнительныеПараметры.АдресШаблона, ЭтаФорма);
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеВопросаОВключеннойАвтовысотеСтрок(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		РазрешитьАвтовысотуСтрок = Истина;
		СохранятьИзменения  	 = Истина;
		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтображатьТекстПриИзменении(Элемент)
	
	Элементы.РазмерШрифта.Доступность = ОтображатьТекст;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипКодаПриИзменении(Элемент)
	
	Элементы.УровеньКоррекцииQR.Видимость = (ТипКода = 16 ИЛИ ТипКода = 99 ИЛИ ТипКода = 17 ИЛИ ТипКода = 18);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДоступныеПоля

&НаКлиенте
Процедура ДоступныеПоляВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ЭтаФорма.ТолькоПросмотр Тогда
		Возврат;
	КонецЕсли;

	Модифицированность = Истина;
	ВыбратьДоступнуюСтрокуВШаблон(ВыбраннаяСтрока);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Процедура устанавливает область печати в табличном документе и рисует по краю пунктирную рамку.
//
&НаКлиенте
Процедура УстановитьОбластьПечати(Команда)
	
	Если (ПолеТабличногоДокумента.ВыделенныеОбласти[0].Лево <> 0 И ПолеТабличногоДокумента.ВыделенныеОбласти[0].Верх <> 0)
		И ПолеТабличногоДокумента.ВыделенныеОбласти.Количество() = 1
		И ТипЗнч(ПолеТабличногоДокумента.ВыделенныеОбласти[0]) = Тип("ОбластьЯчеекТабличногоДокумента") Тогда
		
		УстановитьОбластьПечатиНаСервере(ПолеТабличногоДокумента.ВыделенныеОбласти[0].Имя);
		
	Иначе
		
		ОчиститьСообщения();
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Некорректная область печати'");
		Сообщение.Поле = "ПолеТабличногоДокумента";
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьШаблонИСМППоУмолчанию(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОповещениеЗаполнитьШаблонИСМППоУмолчанию", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, НСтр("ru = 'Редактируемый шаблон будет заменен на выбранный стандартный шаблон. Продолжить?'"), РежимДиалогаВопрос.ДаНет);

КонецПроцедуры

&НаКлиенте
Процедура ОбъединитьОбластьЯчеекШаблона(Команда)
	
	Если ПолеТабличногоДокумента.ВыделенныеОбласти.Количество() = 1
		И ТипЗнч(ПолеТабличногоДокумента.ВыделенныеОбласти[0]) = Тип("ОбластьЯчеекТабличногоДокумента") Тогда
		
		ТекущаяОбласть = ПолеТабличногоДокумента.ТекущаяОбласть;
		ОбъединитьОбластьЯчеекШаблонаСервер(ТекущаяОбласть.Имя);
		
	Иначе
		
		ОчиститьСообщения();
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Некорректная область.'");
		Сообщение.Поле = "ПолеТабличногоДокумента";
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РазъединитьОбластьЯчеекШаблона(Команда)
	
	Если ПолеТабличногоДокумента.ВыделенныеОбласти.Количество() = 1
		И ТипЗнч(ПолеТабличногоДокумента.ВыделенныеОбласти[0]) = Тип("ОбластьЯчеекТабличногоДокумента") Тогда
		
		ТекущаяОбласть = ПолеТабличногоДокумента.ТекущаяОбласть;
		РазъединитьОбластьЯчеекШаблонаСервер(ТекущаяОбласть.Имя);
		
	Иначе
		
		ОчиститьСообщения();
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Некорректная область.'");
		Сообщение.Поле = "ПолеТабличногоДокумента";
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВШаблонДоступнуюСтроку(Команда)
	
	ТекущаяСтрока = Элементы.ДоступныеПоля.ТекущаяСтрока;
	Если ТекущаяСтрока <> Неопределено Тогда
		ВыбратьДоступнуюСтрокуВШаблон(ТекущаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСоставПолей(Команда)

	ОбновитьСоставПолейНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСоставПолейНаСервере()

	НоваяСКД = Обработки.ПечатьКодовМаркировкиИСМПТК.ПолучитьМакет("ПоляШаблонаИСМП");
	АдресВХранилище = ПоместитьВоВременноеХранилище(НоваяСКД, Новый УникальныйИдентификатор);
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресВХранилище));	
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьЗакрыть(Команда)
	
	СохранятьИзменения = Модифицированность;
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ИмпортироватьШаблонИзФайла(Команда)
	
	ДополнительныеПараметры = Новый Структура;
	ОписаниеОповещения = Новый ОписаниеОповещения(
								"ОповещениеИмпортироватьШаблонИзФайла",
								ЭтотОбъект,
								ДополнительныеПараметры);
	ПоказатьВопрос(ОписаниеОповещения, НСтр("ru = 'Текущий шаблон будет потерян. Продолжить?'"), РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ЭкспортШаблонаВФайл(Команда)
	
	Режим = РежимДиалогаВыбораФайла.Сохранение;
	ДиалогСохраненияФайла = Новый ДиалогВыбораФайла(Режим);
	
	ДиалогСохраненияФайла.Заголовок = НСтр("ru = 'Сохранить шаблон'");
	ДиалогСохраненияФайла.ПолноеИмяФайла = "";
	ДиалогСохраненияФайла.ПредварительныйПросмотр = Ложь;
	ДиалогСохраненияФайла.Фильтр = "Шаблоны|*.mxl";
	
	ДополнительныеПараметры = Новый Структура;
	ОбработчикОповещения = Новый ОписаниеОповещения(
										"ОповещениеЭкспортироватьШаблонВФайл",
										ЭтотОбъект,
										ДополнительныеПараметры);
	ДиалогСохраненияФайла.Показать(ОбработчикОповещения);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СтруктураШаблона()
	
	ШаблонОбъекта = ?(ПустаяСтрока(Параметры.АдресШаблона), Неопределено, ПолучитьИзВременногоХранилища(Параметры.АдресШаблона));
	
	СтруктураШаблона = Неопределено;
	
	Если ТипЗнч(ШаблонОбъекта) = Тип("Структура") Тогда
		СтруктураШаблона = ШаблонОбъекта;
	Иначе
		ЗначениеКопирования = Неопределено;
		Параметры.Свойство("ЗначениеКопирования", ЗначениеКопирования);
		Если ЗначениеКопирования <> Неопределено Тогда
			СтруктураШаблона = ЗначениеКопирования.Шаблон.Получить();
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтруктураШаблона;
	
КонецФункции

// Возвращает параметры из строки-шаблона табличного документа.
//
&НаСервере
Функция ПозицииПараметров(ТекстЯчейки)
	
	Массив = Новый Массив;
	
	Начало = -1;
	Конец  = -1;
	СчетчикСкобокОткрывающих = 0;
	СчетчикСкобокЗакрывающих = 0;
	
	Для Индекс = 1 По СтрДлина(ТекстЯчейки) Цикл
		Символ = Сред(ТекстЯчейки, Индекс, 1);
		Если Символ = "[" Тогда
			СчетчикСкобокОткрывающих = СчетчикСкобокОткрывающих + 1;
			Если СчетчикСкобокОткрывающих = 1 Тогда
				Начало = Индекс;
			КонецЕсли;
		ИначеЕсли Символ = "]" Тогда
			СчетчикСкобокЗакрывающих = СчетчикСкобокЗакрывающих + 1;
			Если СчетчикСкобокЗакрывающих = СчетчикСкобокОткрывающих Тогда
				Конец = Индекс;
				
				Массив.Добавить(Новый Структура("Начало, Конец", Начало, Конец));
				
				Начало = -1;
				Конец  = -1;
				СчетчикСкобокОткрывающих = 0;
				СчетчикСкобокЗакрывающих = 0;
				
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Массив;
	
КонецФункции

// Возвращает структуру макета шаблона ценников и этикеток.
//
&НаСервере
Функция СтруктураМакетаШаблона()
	
	СтруктураМакетаШаблона = Новый Структура;
	
	ПараметрыШаблона       = Новый Соответствие;
	СчетчикПараметров      = 0;
	ПрефиксИмениПараметра  = "ПараметрМакета";
	
	ОбластьМакетаЭтикетки = ПолеТабличногоДокумента.ПолучитьОбласть();
	
	// Копирование настроек табличного документа.
	ЗаполнитьЗначенияСвойств(ОбластьМакетаЭтикетки, ПолеТабличногоДокумента);
	
	Для НомерКолонки = 1 По ОбластьМакетаЭтикетки.ШиринаТаблицы Цикл
		
		Для НомерСтроки = 1 По ОбластьМакетаЭтикетки.ВысотаТаблицы Цикл
			
			Ячейка = ОбластьМакетаЭтикетки.Область(НомерСтроки, НомерКолонки);
			Если Ячейка.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Шаблон Тогда
				
				МассивПараметров = ПозицииПараметров(Ячейка.Текст);
				
				КоличествоПараметров = МассивПараметров.Количество();
				Для Индекс = 0 По КоличествоПараметров - 1 Цикл
					
					Структура = МассивПараметров[КоличествоПараметров - 1 - Индекс];
					
					ИмяПараметра = Сред(Ячейка.Текст, Структура.Начало + 1, Структура.Конец - Структура.Начало - 1);
					Если Найти(ИмяПараметра, ПрефиксИмениПараметра) = 0 Тогда
						
						ЛеваяЧасть = Лев(Ячейка.Текст, Структура.Начало);
						ПраваяЧасть = Прав(Ячейка.Текст, СтрДлина(Ячейка.Текст) - Структура.Конец+1);
						
						СохраненноеИмяПараметраМакета = ПараметрыШаблона.Получить(ИмяПараметра);
						Если СохраненноеИмяПараметраМакета = Неопределено Тогда
							СчетчикПараметров = СчетчикПараметров + 1;
							Ячейка.Текст = ЛеваяЧасть + (ПрефиксИмениПараметра + СчетчикПараметров) + ПраваяЧасть;
							ПараметрыШаблона.Вставить(ИмяПараметра, ПрефиксИмениПараметра + СчетчикПараметров);
						Иначе
							Ячейка.Текст = ЛеваяЧасть + (СохраненноеИмяПараметраМакета) + ПраваяЧасть;
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЦикла;
				
			ИначеЕсли Ячейка.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Параметр Тогда
				
				Если Найти(Ячейка.Параметр, ПрефиксИмениПараметра) = 0 Тогда
					СохраненноеИмяПараметраМакета = ПараметрыШаблона.Получить(Ячейка.Параметр);
					Если СохраненноеИмяПараметраМакета = Неопределено Тогда
						СчетчикПараметров = СчетчикПараметров + 1;
						ПараметрыШаблона.Вставить(Ячейка.Параметр, ПрефиксИмениПараметра + СчетчикПараметров);
						Ячейка.Параметр = ПрефиксИмениПараметра + СчетчикПараметров;
					Иначе
						Ячейка.Параметр = СохраненноеИмяПараметраМакета;
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	// Вставляем в параметры штрихкод
	Если ПараметрыШаблона.Получить(ИмяПараметраШтрихкод()) = Неопределено 
		ИЛИ ПараметрыШаблона.Получить(ИмяПараметраШтрихкодEAN()) = Неопределено Тогда
		Для Каждого Рисунок Из ОбластьМакетаЭтикетки.Рисунки Цикл
			Если Лев(Рисунок.Имя,8) = ИмяПараметраШтрихкод() Тогда
				ПараметрыШаблона.Вставить(ИмяПараметраШтрихкод(), ПрефиксИмениПараметра + (СчетчикПараметров+1));
			ИначеЕсли Лев(Рисунок.Имя,6) = ИмяПараметраШтрихкодEAN() Тогда
				ПараметрыШаблона.Вставить(ИмяПараметраШтрихкодEAN(), ПрефиксИмениПараметра + (СчетчикПараметров+1));		
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// Заменяем на пустую картинку.
	Для Каждого Рисунок Из ОбластьМакетаЭтикетки.Рисунки Цикл
		Если Лев(Рисунок.Имя,8) = ИмяПараметраШтрихкод() 
			ИЛИ Лев(Рисунок.Имя,6) = ИмяПараметраШтрихкодEAN() Тогда
			Рисунок.Картинка = Новый Картинка;
		КонецЕсли;
	КонецЦикла;
	
	СтруктураМакетаШаблона.Вставить("МакетЭтикетки"				, ОбластьМакетаЭтикетки);
	СтруктураМакетаШаблона.Вставить("ИмяОбластиПечати"			, ПолеТабличногоДокумента.ОбластьПечати.Имя);
	СтруктураМакетаШаблона.Вставить("ТипКода"					, ТипКода);
	СтруктураМакетаШаблона.Вставить("УровеньКоррекцииQR"		, УровеньКоррекцииQR);
	СтруктураМакетаШаблона.Вставить("РазмерШрифта"				, РазмерШрифта);
	СтруктураМакетаШаблона.Вставить("ОтображатьТекст"			, ОтображатьТекст);
	СтруктураМакетаШаблона.Вставить("ПараметрыШаблона"			, ПараметрыШаблона);
	СтруктураМакетаШаблона.Вставить("РедакторТабличныйДокумент"	, ПолеТабличногоДокумента);
	СтруктураМакетаШаблона.Вставить("КоличествоПоВертикали"		, КоличествоПоВертикали);
	СтруктураМакетаШаблона.Вставить("КоличествоПоГоризонтали"	, КоличествоПоГоризонтали);
	СтруктураМакетаШаблона.Вставить("УголПоворота"				, УголПоворота);
	СтруктураМакетаШаблона.Вставить("АдресСКДВХранилище"		, АдресВХранилище);
	
	Возврат СтруктураМакетаШаблона;
	
КонецФункции

// Выполняет проверку размещения ценников и этикеток на листе с заданными параметрами.
//
&НаСервере
Процедура ПроверитьРазмещение(Отказ)
	
	ОбластьМакета = ПолеТабличногоДокумента.ПолучитьОбласть(ПолеТабличногоДокумента.ОбластьПечати.Имя);
	
	НовыйТабличныйДокумент = Новый ТабличныйДокумент;
	НовыйТабличныйДокумент.РазмерСтраницы 	  = ПолеТабличногоДокумента.РазмерСтраницы;
	НовыйТабличныйДокумент.ОриентацияСтраницы = ПолеТабличногоДокумента.ОриентацияСтраницы;
	
	НовыйТабличныйДокумент.ПолеСлева  = ПолеТабличногоДокумента.ПолеСлева;
	НовыйТабличныйДокумент.ПолеСправа = ПолеТабличногоДокумента.ПолеСправа;
	НовыйТабличныйДокумент.ПолеСверху = ПолеТабличногоДокумента.ПолеСверху;
	НовыйТабличныйДокумент.ПолеСнизу  = ПолеТабличногоДокумента.ПолеСнизу;
	
	НовыйТабличныйДокумент.РазмерКолонтитулаСверху = ПолеТабличногоДокумента.РазмерКолонтитулаСверху;
	НовыйТабличныйДокумент.РазмерКолонтитулаСнизу  = ПолеТабличногоДокумента.РазмерКолонтитулаСнизу;
	
	НовыйТабличныйДокумент.МасштабПечати 		 = ПолеТабличногоДокумента.МасштабПечати;
	НовыйТабличныйДокумент.ЭкземпляровНаСтранице = ПолеТабличногоДокумента.ЭкземпляровНаСтранице;
	
	Если НЕ (ПолеТабличногоДокумента.ОбластьПечати.Лево = 0 
		 И ПолеТабличногоДокумента.ОбластьПечати.Право = 0) Тогда
		
		МассивТаблиц = Новый Массив;
		Для Инд = 1 По КоличествоПоГоризонтали Цикл
			МассивТаблиц.Добавить(ОбластьМакета);
		КонецЦикла;
		
		Пока НЕ НовыйТабличныйДокумент.ПроверитьПрисоединение(МассивТаблиц) Цикл
			МассивТаблиц.Удалить(МассивТаблиц.Количество()-1);
		КонецЦикла;
		
		Если КоличествоПоГоризонтали <> МассивТаблиц.Количество() Тогда
			СообщениеПоГоризонтали = НСтр("ru = 'Максимальное количество по горизонтали: %1'");
			СообщениеПоГоризонтали = ОбщегоНазначенияИСМПТККлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(СообщениеПоГоризонтали, МассивТаблиц.Количество());
			ОбщегоНазначенияИСМПТККлиентСерверПереопределяемый.СообщитьПользователю(СообщениеПоГоризонтали,, "КоличествоПоГоризонтали",, Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ (ПолеТабличногоДокумента.ОбластьПечати.Верх = 0 
		 И ПолеТабличногоДокумента.ОбластьПечати.Низ = 0) Тогда
		
		МассивТаблиц = Новый Массив;
		Для Инд = 1 По КоличествоПоВертикали Цикл
			МассивТаблиц.Добавить(ОбластьМакета);
		КонецЦикла;
		
		Пока НЕ НовыйТабличныйДокумент.ПроверитьВывод(МассивТаблиц) Цикл
			МассивТаблиц.Удалить(МассивТаблиц.Количество()-1);
		КонецЦикла;
		
		Если КоличествоПоВертикали <> МассивТаблиц.Количество() Тогда
			СообщениеПоВертикали = НСтр("ru = 'Максимальное количество по вертикали: %1'");
			СообщениеПоВертикали = ОбщегоНазначенияИСМПТККлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(СообщениеПоВертикали, МассивТаблиц.Количество());
			ОбщегоНазначенияИСМПТККлиентСерверПереопределяемый.СообщитьПользователю(СообщениеПоВертикали,, "КоличествоПоВертикали",, Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
	Если Отказ Тогда
		СохранятьИзменения = Ложь;
	КонецЕсли;
	
КонецПроцедуры

// Устанавливает область печати в табличном документе и рисует по краю пунктирную рамку.
//
&НаСервере
Процедура УстановитьОбластьПечатиНаСервере(ИмяОбласти)
	
	ВыделеннаяОбласть = ПолеТабличногоДокумента.Область(ИмяОбласти);
	
	НетЛинии = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии, 0);
	РедкийПунктир = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.РедкийПунктир, 1);
	
	Если ПолеТабличногоДокумента.ОбластьПечати <> Неопределено Тогда
		ПолеТабличногоДокумента.ОбластьПечати.Обвести(НетЛинии,НетЛинии,НетЛинии,НетЛинии);
	КонецЕсли;
	
	ПолеТабличногоДокумента.ОбластьПечати = ВыделеннаяОбласть;
	ПолеТабличногоДокумента.ОбластьПечати.Обвести(РедкийПунктир,РедкийПунктир,РедкийПунктир,РедкийПунктир);
	
	ПолеТабличногоДокумента.ОбластьПечати.АвтоВысотаСтроки = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ВставитьВШаблонРисунокШтрихкода(ИмяТекущейОбласти, ИмяПоляВШаблоне)
	
	РисунокШтрихкода = ПолеТабличногоДокумента.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);
	Индекс = ПолеТабличногоДокумента.Рисунки.Индекс(РисунокШтрихкода);
	
	РисунокШтрихкода.Расположить(ПолеТабличногоДокумента.Область(ИмяТекущейОбласти));
	РисунокШтрихкода.Имя = ИмяПоляВШаблоне + СтрЗаменить(Новый УникальныйИдентификатор, "-", "_");
	РисунокШтрихкода.РазмерКартинки = РазмерКартинки.Растянуть;
	РисунокШтрихкода.Линия = Новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии, 0);

	УстановитьКартинкуШтрихкода(ПолеТабличногоДокумента.Рисунки[Индекс]);

КонецПроцедуры

&НаСервере
Процедура УстановитьКартинкуШтрихкода(РисунокШтрихкода)

	Эталон = Справочники.ХранилищеШаблоновИСМПТК.ПолучитьМакет("ЭталонШтрихкода");
	КоличествоМиллиметровВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;
	
	//Определяем, какой штрихкод выводится в макет
	Если Лев(РисунокШтрихкода.Имя, 8) = "Штрихкод" Тогда
		ТипКодаШаблон = 24; //GS1-DataMatrix
	Иначе
		ТипКодаШаблон = 1; //EAN13
	КонецЕсли;
	
	ПримерШтрихкода = Неопределено;
	Коды = ПолучитьКоды();
	Для Каждого СтрокаТЧ Из Коды Цикл
		Если СтрокаТЧ.ТипКода = ТипКодаШаблон Тогда
			ПримерШтрихкода = СтрокаТЧ;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Штрихкод = СокрЛП(ПримерШтрихкода.Пример);

	ЗначениеШтрихкодаДляКомпоненты = Штрихкод;
	РазборИОбработкаКодовМаркировкиИСМПТКСлужебный.КодGS1ДляКомпонентыПечати(ЗначениеШтрихкодаДляКомпоненты, 24);
	
	ПараметрыШтрихкода = Новый Структура;
	ПараметрыШтрихкода.Вставить("Ширина",	Окр(РисунокШтрихкода.Ширина / КоличествоМиллиметровВПикселе));
	ПараметрыШтрихкода.Вставить("Высота", 	Окр(РисунокШтрихкода.Высота / КоличествоМиллиметровВПикселе));
	ПараметрыШтрихкода.Вставить("Штрихкод", ЗначениеШтрихкодаДляКомпоненты);
	ПараметрыШтрихкода.Вставить("ТипВходныхДанных", 0); // Штрихкод - это строка
	//По умолчанию картинка во всех шаблонах генерируется в формате GS1-DataMatrix для кода маркировки и ЕАН13 для обычных штрихкодов
	ПараметрыШтрихкода.Вставить("ТипКода", ТипКодаШаблон); 
	ПараметрыШтрихкода.Вставить("ОтображатьТекст", ОтображатьТекст);
	ПараметрыШтрихкода.Вставить("РазмерШрифта",    РазмерШрифта);
	ПараметрыШтрихкода.Вставить("УголПоворота",    УголПоворота);
	
	РезультатГенерацииШтрихкода = ПечатьКодовМаркировкиИСМПТК.ИзображениеШтрихкода(ПараметрыШтрихкода);
	Если РезультатГенерацииШтрихкода.Картинка <> Неопределено Тогда
		РисунокШтрихкода.Картинка = РезультатГенерацииШтрихкода.Картинка;
	Иначе
		ОбщегоНазначенияИСМПТККлиентСерверПереопределяемый.СообщитьПользователю(НСтр("ru = 'При генерации картинки штрихкода произошла ошибка.'"));
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКоды()

	Возврат Справочники.ХранилищеШаблоновИСМПТК.ПолучитьОбразцыШтрихкодов();

КонецФункции

// Возвращает строку с именем параметра штрихкода для передачи в СКД (Схему Компоновки Данных).
//
&НаКлиентеНаСервереБезКонтекста
Функция ИмяПараметраШтрихкод()
	
	Возврат "Штрихкод";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИмяПараметраШтрихАвтопроверки()
	
	Возврат "ШтрихАвтопроверки";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИмяПараметраШтрихкодEAN()
	
	Возврат "КодEAN";
	
КонецФункции

&НаСервере
Процедура ОбъединитьОбластьЯчеекШаблонаСервер(ИмяОбласти)
	
	Область = ПолеТабличногоДокумента.Область(ИмяОбласти);
	Область.Объединить();
	
КонецПроцедуры

&НаСервере
Процедура РазъединитьОбластьЯчеекШаблонаСервер(ИмяОбласти)
	
	Область = ПолеТабличногоДокумента.Область(ИмяОбласти);
	Область.Разъединить();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьДоступнуюСтрокуВШаблон(ВыбраннаяСтрока)
	
	// Перед началом добавления необходимо выделить область в табличном документе.
	Если ТипЗнч(ПолеТабличногоДокумента.ТекущаяОбласть) <> Тип("ОбластьЯчеекТабличногоДокумента") Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Для переноса поля шаблона нужно выделить ячейку или область ячеек.'"));
		Возврат;
	Иначе
		ТекущаяОбласть = ПолеТабличногоДокумента.ТекущаяОбласть;
		ОбъединитьОбластьЯчеекШаблонаСервер(ТекущаяОбласть.Имя);
	КонецЕсли;

	// Подготовка данных.
	ИмяПоляВШаблоне = Строка(КомпоновщикНастроек.Настройки.ДоступныеПоляПорядка.ПолучитьОбъектПоИдентификатору(ВыбраннаяСтрока).Поле);
	
	// Размещение поля в шаблоне.
	Если ИмяПоляВШаблоне = ИмяПараметраШтрихкод() Или ИмяПоляВШаблоне = ИмяПараметраШтрихАвтопроверки() 
		ИЛИ ИмяПоляВШаблоне = ИмяПараметраШтрихкодEAN() Тогда
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ТекущаяОбласть",  ТекущаяОбласть);
		ДополнительныеПараметры.Вставить("ИмяПоляВШаблоне", ИмяПоляВШаблоне);

		ОписаниеОповещения = Новый ОписаниеОповещения("ОповещениеДобавитьШтрихкод", ЭтотОбъект, ДополнительныеПараметры);
		ПоказатьВопрос(ОписаниеОповещения, НСтр("ru = 'Добавить штрихкод как картинку?'"), РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ТекущаяОбласть.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Шаблон;
		ТекущаяОбласть.Текст = ТекущаяОбласть.Текст + "["+ИмяПоляВШаблоне+"]";
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПоместитьВТабличныйДокументШаблонПоУмолчанию(ИмяШаблона)
	
	Если Не ЗначениеЗаполнено(ИмяШаблона) Тогда
		Возврат;
	КонецЕсли;
	
	ШаблонПоУмолчанию = Справочники.ХранилищеШаблоновИСМПТК.ПолучитьМакет(ИмяШаблона);
	
	ПолеТабличногоДокумента = ШаблонПоУмолчанию;
	СхемаКомпоновкиДанных	= Обработки.ПечатьКодовМаркировкиИСМПТК.ПолучитьМакет("ПоляШаблонаИСМП");
	
	АдресВХранилище = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, Новый УникальныйИдентификатор);
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресВХранилище));
		
КонецПроцедуры

&НаСервере
Функция СохранитьЗакрытьСервер(Отказ)
	
	ПроверитьРазмещение(Отказ);
	
	Возврат ПоместитьВоВременноеХранилище(СтруктураМакетаШаблона(), Новый УникальныйИдентификатор);
	
КонецФункции

&НаКлиенте
Процедура ПолеТабличногоДокументаПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузкаШаблонаИзФайлаЗавершениеСервер(АдресФайла)
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресФайла);
	Каталог = КаталогВременныхФайлов();
	ИмяВременногоФайла = Строка(Новый УникальныйИдентификатор) + ".xml";
	ИмяПромежуточногоФайла = Каталог + ИмяВременногоФайла;
	ДвоичныеДанные.Записать(ИмяПромежуточногоФайла);
	ПолеТабличногоДокумента.Очистить();
	ПолеТабличногоДокумента.Прочитать(ИмяПромежуточногоФайла);
	УдалитьФайлы(ИмяПромежуточногоФайла);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборШаблонаЭтикетки(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоместитьВТабличныйДокументШаблонПоУмолчанию(Результат);
	ТипКода = ?(ЭтаФорма.НеGS1, 18, 24);
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНовыйШаблонПоУмолчанию() 
	
	ПоместитьВТабличныйДокументШаблонПоУмолчанию("ШаблонЭтикетки_58х40_Пустой");
	ТипКода = ?(ЭтаФорма.НеGS1, 18, 24);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПредставлениеТипаКода()
	
	ТипКодаПредставление = ПечатьКодовМаркировкиИСМПТККлиент.ЗаполнитьПредставлениеТипаКода(ТипКода);
	
КонецПроцедуры

#КонецОбласти
