#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения,ТаблицаДокумента)
	
	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ДОКУМЕНТА
	ПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	Если РучнаяКорректировка Тогда
		Возврат;
	КонецЕсли;
	ПараметрыПроведения = Документы.си_ВыработкаМатериаловВЭксплуатации.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	си_УчетСпецодеждыУправлениеПроведениемДокументовСервер.СформироватьДвиженияПоРегистрам(ПараметрыПроведения.Реквизиты, ПараметрыПроведения.ТаблицаМатериалы, Движения, Отказ,"Материалы",,,"си_ВыработкаМатериаловВЭксплуатации",);
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Отказ = си_УчетСпецодеждыСервер.ПроверкаЗаполненияСтруктурнойЕдиницы(Организация,СтруктурноеПодразделение);
	
	Для Каждого СтрокаМатериал Из Материалы Цикл
		Если НЕ СтрокаМатериал.НазначениеИспользования.СпособПогашенияСтоимости = Перечисления.си_СпособыПогашенияСтоимости.Производственный Тогда 
			ТекстСообщения = "Проведение документа невозможно. Для материалов указан не производственный способ погашения стоимости.";
			ОбщегоНазначения.СообщитьПользователю("Проведение """ + Ссылка + """" + ТекстСообщения);
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.си_ПередачаМатериаловВЭксплуатацию") Тогда
		// Заполнение шапки
		ВидУчетаНУ = ДанныеЗаполнения.ВидУчетаНУ;
		Организация = ДанныеЗаполнения.Организация;
		Ответственный = ДанныеЗаполнения.Ответственный;
		ПодразделениеОрганизации = ДанныеЗаполнения.ПодразделениеОрганизации;
		РучнаяКорректировка = ДанныеЗаполнения.РучнаяКорректировка;
		Склад = ДанныеЗаполнения.Склад;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		СтруктурноеПодразделение = ДанныеЗаполнения.СтруктурноеПодразделение;
		УчитыватьКПН = ДанныеЗаполнения.УчитыватьКПН;
		
		Для Каждого ВыборкаПоТоварам Из ДанныеЗаполнения.Материалы Цикл
			Если ВыборкаПоТоварам.НазначениеИспользования.СпособПогашенияСтоимости<>Перечисления.си_СпособыПогашенияСтоимости.Производственный Тогда
				Продолжить;
			КонецЕсли;
			НоваяСтрока = Материалы.Добавить();
			НоваяСтрока.ЕдиницаИзмерения = ВыборкаПоТоварам.ЕдиницаИзмерения;
			НоваяСтрока.Количество = ВыборкаПоТоварам.Количество;
			НоваяСтрока.Коэффициент = ВыборкаПоТоварам.Коэффициент;
			НоваяСтрока.НазначениеИспользования = ВыборкаПоТоварам.НазначениеИспользования;
			НоваяСтрока.Номенклатура = ВыборкаПоТоварам.Номенклатура;
			НоваяСтрока.Сотрудник = ВыборкаПоТоварам.Сотрудник;
			НоваяСтрока.Характеристика = ВыборкаПоТоварам.Характеристика;
			НоваяСтрока.ДокументПередачи = ?(ДанныеЗаполнения.ВидОперации = Перечисления.си_ВидыОперацийПередачиВЭксплуатацию.ПервичнаяПередача,ДанныеЗаполнения.Ссылка,ВыборкаПоТоварам.ДокументПередачи);
		КонецЦикла;
		Возврат;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.си_ПеремещениеМатериаловВЭксплуатации") Тогда
		// Заполнение шапки
		ВидУчетаНУ = ДанныеЗаполнения.ВидУчетаНУ;
		Организация = ДанныеЗаполнения.Организация;
		Ответственный = ДанныеЗаполнения.Ответственный;
		ПодразделениеОрганизации = ДанныеЗаполнения.ПодразделениеОрганизацииПолучатель;
		РучнаяКорректировка = ДанныеЗаполнения.РучнаяКорректировка;
		Склад = ДанныеЗаполнения.СкладПолучатель;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		СтруктурноеПодразделение = ДанныеЗаполнения.СтруктурноеПодразделениеПолучатель;
		УчитыватьКПН = ДанныеЗаполнения.УчитыватьКПН;
		СостояниеМатериалов = ДанныеЗаполнения.СостояниеМатериалов;
		УчитыватьКПН = ДанныеЗаполнения.УчитыватьКПН;
		
		Для Каждого ВыборкаПоТоварам Из ДанныеЗаполнения.Материалы Цикл
			Если ВыборкаПоТоварам.НазначениеИспользования.СпособПогашенияСтоимости<>Перечисления.си_СпособыПогашенияСтоимости.Производственный Тогда
				Продолжить;
			КонецЕсли;
			НоваяСтрока = Материалы.Добавить();
			НоваяСтрока.ЕдиницаИзмерения = ВыборкаПоТоварам.ЕдиницаИзмерения;
			НоваяСтрока.Количество = ВыборкаПоТоварам.Количество;
			НоваяСтрока.Коэффициент = ВыборкаПоТоварам.Коэффициент;
			НоваяСтрока.НазначениеИспользования = ВыборкаПоТоварам.НазначениеИспользованияПолучатель;
			НоваяСтрока.Номенклатура = ВыборкаПоТоварам.Номенклатура;
			НоваяСтрока.Сотрудник = ВыборкаПоТоварам.СотрудникПолучатель;
			НоваяСтрока.ДокументПередачи = ВыборкаПоТоварам.ДокументПередачи;
			НоваяСтрока.Характеристика = ВыборкаПоТоварам.Характеристика;
		КонецЦикла;
		возврат;
	КонецЕсли;
	общ_ПереопределяемыеПроцедурыБКСервер.ЗаполнитьШапкуДокумента(ЭтотОбъект, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли