
#Область ИмяСобытия

#Область ИСМПТ

// Служебные параметры, необходимые для определения совершаемого в текущий момент действия. 
// Не выводятся в сообщения пользователя и в интерфейс.

Функция ИмяСобытияЗаписьПервичногоДокументаПриСоздании() Экспорт 
	
	Возврат "ВыполненаЗаписьДокумента";
	
КонецФункции

Функция ИмяСобытияЗаписьАктПриемаПередачи() Экспорт 
	
	Возврат "Запись_АктПриемаПередачи";
	
КонецФункции

Функция ИмяСобытияЗаписьАППКорректировка() Экспорт 
	
	Возврат "Запись_АктКорректировка";
	
КонецФункции

Функция ИмяСобытияВыборАПП() Экспорт 
	
	Возврат "Выбор_АктПриемаПередачи";
	
КонецФункции

Функция ИмяСобытияЗаписьУведомлениеОРасхождении() Экспорт 
	
	Возврат "Запись_УведомлениеОРасхождении";
	
КонецФункции

Функция ИмяСобытияЗаписьУведомлениеОВвозеИзТретьихСтран() Экспорт 
	
	Возврат "Запись_УведомлениеОВвозеИзТретьихСтран";
	
КонецФункции

Функция ИмяСобытияЗаписьУведомлениеОВвозеИзЕАЭС() Экспорт 
	
	Возврат "Запись_УведомлениеОВвозеИзЕАЭС";
	
КонецФункции

Функция ИмяСобытияЗаписьУведомлениеОВводеВОборот() Экспорт 
	
	Возврат "Запись_УведомлениеОВводеВОборот";
	
КонецФункции

Функция ИмяСобытияЗаписьУведомлениеОВыводеИзОборота() Экспорт 
	
	Возврат "Запись_УведомлениеОВыводеИзОборота";
	
КонецФункции

Функция ИмяСобытияСинхронизацияИСМПТ() Экспорт 
	
	Возврат "Синхронизация_ИСМПТ";	
	
КонецФункции

Функция ИмяСобытияЗаписьЗаказНаЭмиссию() Экспорт 
	
	Возврат "Запись_ЗаказНаЭмиссию";
	
КонецФункции

Функция ИмяСобытияОбновлениеСтатусаЗаказНаЭмиссию() Экспорт 
	
	Возврат "ОбновлениеСтатуса_ЗаказНаЭмиссию";
	
КонецФункции

Функция ИмяСобытияПолучениеПричиныОтказаЗаказНаЭмиссию() Экспорт 
	
	Возврат "ПолучениеПричиныОтказа_ЗаказНаЭмиссию";
	
КонецФункции

Функция ИмяСобытияПолучениеКмПоЗаказу() Экспорт 
	
	Возврат "ПолучениеКМ";
	
КонецФункции

Функция ИмяСобытияЗаписьАгрегацияКодовМаркировки() Экспорт 
	
	Возврат "Запись_АгрегацияКодовМаркировки";
	
КонецФункции

Функция ИмяСобытияЗаписьНанесениеКодовМаркировки() Экспорт 
	
	Возврат "Запись_НанесениеКодовМаркировки";
	
КонецФункции

Функция ИмяСобытияЗаписьУведомлениеОбЭкспортеЕАЭС() Экспорт 
	
	Возврат "Запись_УведомлениеОбЭкспортеЕАЭС";
	
КонецФункции   

Функция ИмяСобытияУведомлениеОПриемкеЕАЭС() Экспорт 
	
	Возврат "Запись_УведомлениеОПриемкеЕАЭС";
	
КонецФункции

Функция ИмяСобытияЗаписьУведомлениеОПриемкеЕАЭС() Экспорт 
	
	Возврат "Запись_УведомлениеОПриемкеЕАЭС";
	
КонецФункции

Функция ИмяСобытияЗаписьУведомлениеОбОтгрузкеЕАЭС() Экспорт 
	
	Возврат "Запись_УведомлениеОбОтгрузкеЕАЭС";
	
КонецФункции

#КонецОбласти

#Область ИСЦЭДМ

// Служебные параметры, необходимые для определения совершаемого в текущий момент действия. 
// Не выводятся в сообщения пользователя и в интерфейс.

Функция ИмяСобытияЗаписьАктПриемаПередачиИСЦЭДМ() Экспорт 
	
	Возврат "Запись_АктПриемаПередачиИСЦЭДМ";
	
КонецФункции

Функция ИмяСобытияЗаписьУведомлениеОВводеВОборотИСЦЭДМ() Экспорт 
	
	Возврат "Запись_УведомлениеОВводеВОборотИСЦЭДМ";
	
КонецФункции

Функция ИмяСобытияЗаписьУведомлениеОВыводеИзОборотаИСЦЭДМ() Экспорт 
	
	Возврат "Запись_УведомлениеОВыводеИзОборотаИСЦЭДМ";
	
КонецФункции

Функция ИмяСобытияЗаписьАгрегацияВнеПроизводстваИСЦЭДМ() Экспорт 
	
	Возврат "Запись_АгрегацияВнеПроизводстваИСЦЭДМ";
	
КонецФункции

Функция ИмяСобытияЗаписьАктВнутреннегоПеремещенияИСЦЭДМ() Экспорт 
	
	Возврат "Запись_АктВнутреннегоПеремещенияИСЦЭДМ";
	
КонецФункции 

Функция ИмяСобытияЗаписьОтчетОПередачеКИОтНерезидентаРКИСЦЭДМ() Экспорт 
	
	Возврат "Запись_ОтчетОПередачеКИОтНерезидентаРКИСЦЭДМ";
	
КонецФункции

Функция ИмяСобытияЗаписьУведомлениеОВвозеИзЕАЭСИСЦЭДМ() Экспорт 
	
	Возврат "Запись_УведомлениеОВвозеИзЕАЭСИСЦЭДМ";
	
КонецФункции 

Функция ИмяСобытияЗаписьУведомлениеОВвозеИзТретьихСтранИСЦЭДМ() Экспорт 
	
	Возврат "Запись_УведомлениеОВвозеИзТретьихСтранИСЦЭДМ";
	
КонецФункции

Функция ИмяСобытияСинхронизацияИСЦЭДМ() Экспорт 
	
	Возврат "Синхронизация_ИСЦЭДМ";	
	
КонецФункции

Функция ИмяСобытияЗаписьУведомлениеОРасхожденияхИСЦЭДМ() Экспорт 
	
	Возврат "Запись_УведомлениеОРасхожденияхИСЦЭДМ";
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ДействияСДокументами

// Служебные параметры, необходимые для определения совершаемого в текущий момент действия. 
// Не выводятся в сообщения пользователя и в интерфейс.

Функция ДействиеОткрыть() Экспорт
	
	Возврат "ОткрытьДокумент";
	
КонецФункции

Функция ДействиеОтсоединить() Экспорт
	
	Возврат "ОтсоединитьДокумент";
	
КонецФункции

#КонецОбласти