#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ	
////////////////////////////////////////////////////////////////////////////////
// Проведение

Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ) Экспорт 
	
	ПараметрыПроведения = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	НомераТаблиц = Новый Структура;

	Запрос.Текст = ТекстЗапросаРеквизитыДокумента(НомераТаблиц);
	Результат = Запрос.ВыполнитьПакет();
	ТаблицаРеквизиты = Результат[НомераТаблиц["Реквизиты"]].Выгрузить();
	ПараметрыПроведения.Вставить("Реквизиты", ТаблицаРеквизиты);
	
	Реквизиты = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ТаблицаРеквизиты[0]);
			
	Возврат ПараметрыПроведения;
	
КонецФункции

Функция ТекстЗапросаРеквизитыДокумента(НомераТаблиц) 
	
	НомераТаблиц.Вставить("ВТ_ДанныеДокумента", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("Реквизиты", НомераТаблиц.Количество());
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИсполнительныйЛист.ДатаДействия КАК Период,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(УчетнаяПолитикаПоПерсоналуОрганизаций.ВестиУчетПоГоловнойОрганизации, ИСТИНА)
	|			ТОГДА ВЫБОР
	|					КОГДА ИсполнительныйЛист.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|						ТОГДА ИсполнительныйЛист.Организация
	|					ИНАЧЕ ИсполнительныйЛист.Организация.ГоловнаяОрганизация
	|				КОНЕЦ
	|		ИНАЧЕ ИсполнительныйЛист.Организация
	|	КОНЕЦ КАК Организация,
	|	ИсполнительныйЛист.Физлицо,
	|	ВЫБОР
	|		КОГДА ИсполнительныйЛист.СпособРасчетаИЛ = 1
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовРасчета.УдержанияОрганизаций.ИЛПроцентом)
	|		КОГДА ИсполнительныйЛист.СпособРасчетаИЛ = 2
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовРасчета.УдержанияОрганизаций.ИЛФиксированнойСуммой)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовРасчета.УдержанияОрганизаций.ИЛКоэффициентомПоМРП)
	|	КОНЕЦ КАК ВидРасчета,
	|	ИсполнительныйЛист.Ссылка КАК ДокументОснование,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Начать) КАК Действие,
	|	ИсполнительныйЛист.Размер,
	|	ИсполнительныйЛист.ДатаОкончания КАК ПериодЗавершения,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить) КАК ДействиеЗавершения,
	|	ИсполнительныйЛист.Организация КАК ОбособленноеПодразделение,
	|	ИсполнительныйЛист.Дата,
	|	ИсполнительныйЛист.СтруктурноеПодразделение,
	|	ИсполнительныйЛист.ВидРасчетаПочтовыйСбор
	|ПОМЕСТИТЬ ВТ_ДанныеДокумента
	|ИЗ
	|	Документ.ИсполнительныйЛист КАК ИсполнительныйЛист
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаПоПерсоналуОрганизаций КАК УчетнаяПолитикаПоПерсоналуОрганизаций
	|		ПО ИсполнительныйЛист.Организация = УчетнаяПолитикаПоПерсоналуОрганизаций.Организация
	|ГДЕ
	|	ИсполнительныйЛист.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеДокумента.Период,
	|	ВТ_ДанныеДокумента.Организация,
	|	ВТ_ДанныеДокумента.Физлицо,
	|	ВТ_ДанныеДокумента.ВидРасчета,
	|	ВТ_ДанныеДокумента.ДокументОснование,
	|	ВТ_ДанныеДокумента.Действие,
	|	ВТ_ДанныеДокумента.Размер,
	|	ВТ_ДанныеДокумента.ПериодЗавершения,
	|	ВТ_ДанныеДокумента.ДействиеЗавершения,
	|	ВТ_ДанныеДокумента.ОбособленноеПодразделение,
	|	ВТ_ДанныеДокумента.Дата,
	|	ВТ_ДанныеДокумента.СтруктурноеПодразделение
	|ИЗ
	|	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ДанныеДокумента.Период,
	|	ВТ_ДанныеДокумента.Организация,
	|	ВТ_ДанныеДокумента.Физлицо,
	|	ВТ_ДанныеДокумента.ВидРасчетаПочтовыйСбор,
	|	ВТ_ДанныеДокумента.ДокументОснование,
	|	ВТ_ДанныеДокумента.Действие,
	|	0,
	|	ВТ_ДанныеДокумента.ПериодЗавершения,
	|	ВТ_ДанныеДокумента.ДействиеЗавершения,
	|	ВТ_ДанныеДокумента.ОбособленноеПодразделение,
	|	ВТ_ДанныеДокумента.Дата,
	|	ВТ_ДанныеДокумента.СтруктурноеПодразделение
	|ИЗ
	|	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
	|ГДЕ
	|	ВТ_ДанныеДокумента.ВидРасчетаПочтовыйСбор <> ЗНАЧЕНИЕ(ПланВидовРасчета.УдержанияОрганизаций.ПустаяСсылка)";

	Возврат ТекстЗапроса;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Интерфейс для работы с подсистемой Печать.

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

#КонецЕсли
