
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Перем ЗначениеПараметраЗаголовок;
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("Заголовок", ЗначениеПараметраЗаголовок) Тогда
		Заголовок = ЗначениеПараметраЗаголовок;
	Иначе
		Заголовок = НСтр("ru='Записей (%КоличествоДокументов%)'");
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(СписокДокументов.КомпоновщикНастроек.Настройки.Отбор, 
														"Ссылка",
														Параметры.СписокДокументов.ВыгрузитьЗначения(),
														,
														,
														Истина);
	
	Заголовок = СтрЗаменить(Заголовок, "%КоличествоДокументов%", Параметры.СписокДокументов.ВыгрузитьЗначения().Количество());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СписокДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ПоказатьЗначение(Неопределено, Элементы.СписокДокументов.ТекущиеДанные.Значение);
	
КонецПроцедуры

#КонецОбласти
