
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр киб_ГрафикРаботыСотрудников
	Движения.киб_ГрафикРаботыСотрудников.Записывать = Истина;
	Для Каждого ТекСтрокаСотрудники Из Сотрудники Цикл
		Движение = Движения.киб_ГрафикРаботыСотрудников.Добавить();
		Движение.Период = ДатаИзменения;
		Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
		Движение.ГоловнаяОрганизация = Организация;
		Движение.ГрафикРаботы = ГрафикРаботы;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
