
Функция ИмяТаблицыКонтрагентов(Знач НаправленияСНТ) Экспорт
	
	Если НаправленияСНТ = Перечисления.НаправленияСНТ.Входящий Тогда
		Имя = "Поставщики";	
	ИначеЕсли НаправленияСНТ = Перечисления.НаправленияСНТ.Исходящий Тогда
		Имя = "Получатели";	
	Иначе
		ВызватьИсключение НСтр("ru = 'Параметр ""НаправленияСНТ"" имеет некорректное значение.'");
	КонецЕсли;
	
	Возврат Имя;
	
КонецФункции

Функция ИмяРеквизитаКонтрагента(Знач НаправленияСНТ) Экспорт
	
	Если НаправленияСНТ = Перечисления.НаправленияСНТ.Входящий Тогда
		Имя = "Поставщик";	
	ИначеЕсли НаправленияСНТ = Перечисления.НаправленияСНТ.Исходящий Тогда
		Имя = "Получатель";	
	Иначе
		ВызватьИсключение НСтр("ru = 'Параметр ""НаправленияСНТ"" имеет некорректное значение.'");
	КонецЕсли;
	
	Возврат Имя;
	
КонецФункции

Функция ИмяТаблицыСтруктурныхЕдиниц(Знач НаправленияСНТ) Экспорт  
	
	Если НаправленияСНТ = Перечисления.НаправленияСНТ.Входящий Тогда
		Имя = "Получатели";	
	ИначеЕсли НаправленияСНТ = Перечисления.НаправленияСНТ.Исходящий Тогда
		Имя = "Поставщики";	
	Иначе
		ВызватьИсключение НСтр("ru = 'Параметр ""НаправленияСНТ"" имеет некорректное значение.'");
	КонецЕсли;
	
	Возврат Имя;
	
КонецФункции

Функция ИмяРеквизитаСтруктурнойЕдиницы(Знач НаправленияСНТ) Экспорт
	
	Если НаправленияСНТ = Перечисления.НаправленияСНТ.Входящий Тогда
		Имя = "Получатель";	
	ИначеЕсли НаправленияСНТ = Перечисления.НаправленияСНТ.Исходящий Тогда
		Имя = "Поставщик";	
	Иначе
		ВызватьИсключение НСтр("ru = 'Параметр ""НаправленияСНТ"" имеет некорректное значение.'");
	КонецЕсли;
	
	Возврат Имя;
	
КонецФункции
