////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Отбор") Тогда
		
		Если Параметры.Отбор.Свойство("Организация") И ЗначениеЗаполнено(Параметры.Отбор.Организация) Тогда	 
						
			Если ТипЗнч(Параметры.Отбор.Организация) = Тип("СправочникСсылка.Организации") Тогда 
				
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
				Список,
				"ДоговорВзаиморасчетов.Организация",
				Параметры.Отбор.Организация,
				ВидСравненияКомпоновкиДанных.Равно,
				,
				Истина,
				РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
				
			ИначеЕсли ТипЗнч(Параметры.Отбор.Организация) =  Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда
				
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
				Список,
				"ДоговорВзаиморасчетов.Организация",
				Параметры.Отбор.Организация.Владелец,
				ВидСравненияКомпоновкиДанных.Равно,
				,
				Истина,
				РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры 



