
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Параметры.Свойство("СсылкаНаСотрудника",СсылкаНаСотрудника);
	Если Не ЗначениеЗаполнено(СсылкаНаСотрудника) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли; 
	СсылкаНаСотрудника = Параметры.СсылкаНаСотрудника;
	СформироватьКадровуюИсторию();

	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(МестоРаботы, "Сотрудник", СсылкаНаСотрудника);

КонецПроцедуры

&НаСервере
Процедура СформироватьКадровуюИсторию()
	
	КадроваяИстория.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РаботникиОрганизаций.Период КАК Период,
	|	РаботникиОрганизаций.Регистратор КАК Регистратор,
	|	РаботникиОрганизаций.НомерСтроки КАК НомерСтроки,
	|	РаботникиОрганизаций.Активность КАК Активность,
	|	РаботникиОрганизаций.Сотрудник КАК Сотрудник,
	|	РаботникиОрганизаций.Организация КАК Организация,
	|	РаботникиОрганизаций.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
	|	РаботникиОрганизаций.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|	РаботникиОрганизаций.Должность КАК Должность,
	|	РаботникиОрганизаций.ПричинаИзмененияСостояния КАК ПричинаИзмененияСостояния,
	|	РаботникиОрганизаций.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	РаботникиОрганизаций.СтруктурноеПодразделение КАК СтруктурноеПодразделение,
	|	РаботникиОрганизаций.ИсчислятьОППВ КАК ИсчислятьОППВ,
	|	РаботникиОрганизаций.СтатьяЗаконаОТрудеРК КАК СтатьяЗаконаОТрудеРК
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	|ГДЕ
	|	РаботникиОрганизаций.Сотрудник = &Сотрудник";
	
	Запрос.УстановитьПараметр("Сотрудник", СсылкаНаСотрудника);
	
	КадроваяИстория.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры
