
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КТ_РаботаСФормамиСервер.ЗаполнитьКоманднуюПанельБюджетирование(ЭтаФорма);
	
КонецПроцедуры


//Подключаемые команды
//////////////////////

&НаКлиенте
// Динамически подключаемый обработчик команды формы "КомандаОбработкаАтрибутаСобытияОбщая"
//
Процедура Подключаемый_КомандаОбработкаОтборПоВерсииБюджета(Команда)
	
	КТ_РаботаСФормамиКлиент.Подключаемый_КомандаОбработкаОтборПоВерсииБюджета(Элементы, Команда, ТаблицаСоответствияЭлементовУправленияСсылкам, Список);
	
КонецПроцедуры // Подключаемый_КомандаОбработкаОтборПоВерсииБюджета()

&НаКлиенте
// Динамически подключаемый обработчик команды формы "КомандаОбработкаАтрибутаСобытияОбщая"
//
Процедура Подключаемый_КомандаОбработкаПолноеКопированиеПоВерсииБюджета(Команда)
	
	КТ_РаботаСФормамиКлиент.Подключаемый_КомандаОбработкаПолноеКопированиеПоВерсииБюджета(Элементы, Команда, ТаблицаСоответствияЭлементовУправленияСсылкам, Список);
	
КонецПроцедуры // Подключаемый_КомандаОбработкаПолноеКопированиеПоВерсииБюджета()

&НаКлиенте
// Динамически подключаемый обработчик команды формы "КомандаОбработкаАтрибутаСобытияОбщая"
//
Процедура Подключаемый_КомандаОбработкаИзменитьДоступПоВерсииБюджета(Команда)
	
	КТ_РаботаСФормамиКлиент.Подключаемый_КомандаОбработкаИзменитьДоступПоВерсииБюджета(ЭтаФорма, Элементы, Команда, Список);
	
КонецПроцедуры // Подключаемый_КомандаОбработкаИзменитьДоступПоВерсииБюджета()
