
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьОтбор();
КонецПроцедуры

&НаСервере
Процедура УстановитьОтбор()
	СписокЗначенияСвойства.Отбор.Элементы.Очистить();
	ЭлементОтбора = СписокЗначенияСвойства.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Владелец");
	ЭлементОтбора.ПравоеЗначение = Объект.Ссылка;
	ЭлементОтбора.Использование = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	УстановитьОтбор();
КонецПроцедуры

&НаКлиенте
Процедура СписокЗначенияСвойстваПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если Объект.Ссылка.Пустая() Тогда
		Отказ = истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для продолжения необходимо записать элемент");
	КонецЕсли;
	
КонецПроцедуры
