
&НаКлиенте
Процедура ВыполнитьОбработку(Команда)
	
	ВыполнитьОбработкуНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьОбработкуНаСервере()
	
	ПараметрыОбработки = Новый Структура;
	ПараметрыОбработки.Вставить("ДатаНачала", ДатаНачала);
	ПараметрыОбработки.Вставить("ДатаКонца", ДатаКонца);
	
	ОбработкаОбменЭСФ = ЭСФСерверПовтИсп.ОбработкаОбменЭСФ();
	ОбработкаОбменЭСФ.ЗаполнитьПризнакУчетаНаВиртуальномСкладеЗаПериод(ПараметрыОбработки);
	
КонецПроцедуры	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДатаНачала = Параметры.ДатаНачала;
	
КонецПроцедуры
