
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ СПИСОК

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	СтрокаТЧ = Элемент.ТекущиеДанные;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
	    КодыСтрокДекларацииПоНалогуНаПрибыль.Отбор, 
	    "ВидДоходаРасхода", 
	    ?(СтрокаТЧ = Неопределено, ПредопределенноеЗначение("Справочник.Доходы.ПустаяСсылка"), СтрокаТЧ.Ссылка), 
	    ВидСравненияКомпоновкиДанных.Равно, 
	    "Вид дохода расхода", 
	    Истина ,
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный
	);

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ПоказыватьКодыСтрокДекларацииНУ(Команда)
	
	Если Элементы.КодыСтрокДекларацииПоНалогуНаПрибыль.Видимость = Ложь Тогда 
		
		Элементы.КодыСтрокДекларацииПоНалогуНаПрибыль.Видимость = Истина;
		
	Иначе 
		
		Элементы.КодыСтрокДекларацииПоНалогуНаПрибыль.Видимость = Ложь;
		
	КонецЕсли;	
	
КонецПроцедуры



