
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ФормаПодбор.Доступность = ПравоДоступа("Изменение", Метаданные.Справочники.ДокументыУдостоверяющиеЛичность);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подбор(Команда)
	
	ФормаПодбора = ПолучитьФорму("Справочник.ДокументыУдостоверяющиеЛичность.Форма.ФормаПодбораИзКлассификатора", , ЭтаФорма, Истина);
	
	ФормаПодбора.Открыть();

КонецПроцедуры

#КонецОбласти
