////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов	
	
	ОбщегоНазначенияБК.ФормаСпискаПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ СПИСОК

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	СтрокаТЧ = Элемент.ТекущиеДанные;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
	    КодыСтрокДекларацииПоНалогуНаПрибыль.Отбор, 
	    "ВидДоходаРасхода", 
	    ?(СтрокаТЧ = Неопределено, ПредопределенноеЗначение("Справочник.Доходы.ПустаяСсылка"), СтрокаТЧ.Ссылка), 
	    ВидСравненияКомпоновкиДанных.Равно, 
	    "Вид дохода расхода", 
	    Истина ,
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный
	);

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ПоказыватьКодыСтрокДекларацииНУ(Команда)
	
	Если Элементы.КодыСтрокДекларацииПоНалогуНаПрибыль.Видимость = Ложь Тогда 
		
		Элементы.КодыСтрокДекларацииПоНалогуНаПрибыль.Видимость = Истина;
		
	Иначе 
		
		Элементы.КодыСтрокДекларацииПоНалогуНаПрибыль.Видимость = Ложь;
		
	КонецЕсли;	
	
КонецПроцедуры

// СтандартныеПодсистемы.ГрупповоеИзменениеОбъектов
&НаКлиенте
Процедура ИзменитьВыделенные(Команда)
	
	ГрупповоеИзменениеОбъектовКлиент.ИзменитьВыделенные(Элементы.Список);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.ГрупповоеИзменениеОбъектов

