////////////////////////////////////////////////////////////////////////////////
// ОбщегоНазначенияБКСерверПовтИсп: 
//  
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Получает размер месячного расчетного показателя
//
// Параметры:
//	ДатаАктуальности - дата, на которую нужно получить МРП.
//
// Возвращаемое значение:
//	число, размер МРП на дату, или Неопределено, если МРП на дату не определен.
//
Функция МесячныйРасчетныйПоказатель(ДатаАктуальности) Экспорт
	
	Возврат РегистрыСведений.РегламентированныеРасчетныеПоказатели.ДанныеРазмераМесячногоРасчетногоПоказателя(ДатаАктуальности)["Размер"];
	
КонецФункции	

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ