////////////////////////////////////////////////////////////////////////////////
// ИнтеграцияПодсистемБКВызовСервера: вспомогательные процедуры и функции подсистем,
// 		интегрированных в конфигурацию
////////////////////////////////////////////////////////////////////////////////

#Область ДиректБанк

// Получает данные выписки банка в текстовом формате
Функция ПолучитьДанныеВыпискиБанкаТекстовыйФормат(Знач СообщениеОбмена) Экспорт
	
	Результат = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СообщениеОбмена, "Организация, НастройкаОбмена, ВидЭД");
	Результат.Вставить("СсылкаНаХранилище", Неопределено);
	Результат.Вставить("МассивСчетов", Неопределено);
	
	Если НЕ Результат.ВидЭД = Перечисления.ВидыЭДОбменСБанками.ВыпискаБанка Тогда
		Возврат Результат;
	КонецЕсли;
	
	ОбменСБанками.ПолучитьДанныеВыпискиБанкаТекстовыйФормат(СообщениеОбмена, Результат.СсылкаНаХранилище, Результат.МассивСчетов);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
