
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаСправочникВиртуальныеСкладыСменитьСтатус.Видимость = Ложь;
	//Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаСправочникВиртуальныеСкладыСменитьСтатус.Доступность = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Организация") Тогда
		ЭСФКлиентСерверПереопределяемый.УстановитьЭлементОтбора(
		Список.КомпоновщикНастроек.Настройки.Отбор,
		"Организация",
		Параметры.Организация, 
		ВидСравненияКомпоновкиДанных.Равно,
		,
		Истина,
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
	КонецЕсли;
	
	Если Параметры.Отбор.Количество() <> 0 Тогда
		Если Параметры.Отбор.Организация <> Неопределено Тогда
			
			Если Не ТипЗнч(Параметры.Отбор.Организация) = Тип("Массив") Тогда 
				ЗначениеОтбора 		= Параметры.Отбор.Организация;
				ВариантСравнения 	= ВидСравненияКомпоновкиДанных.Равно;
			Иначе 
				ЗначениеОтбора 		= Параметры.Отбор.Организация;
				ВариантСравнения	= ВидСравненияКомпоновкиДанных.ВСписке;
				
				ГруппировкаСписка = Список.КомпоновщикНастроек.Настройки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
				ДобавитьГруппировку(ГруппировкаСписка.ПоляГруппировки, "Организация");
				
			КонецЕсли;
			
			ЭСФКлиентСерверПереопределяемый.УстановитьЭлементОтбора(
			Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор,
			"Организация",
			ЗначениеОтбора, 
			ВариантСравнения,
			,
			Истина,
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ДобавитьГруппировку(СписокГруппировок, ИмяПоля, Использование = Истина, ТипГруппировки = Неопределено)
	
	Поле = Новый ПолеКомпоновкиДанных(ИмяПоля);
	НовыйЭлемент = СписокГруппировок.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
	НовыйЭлемент.Использование = Использование;
	НовыйЭлемент.Поле = Поле;
	НовыйЭлемент.ТипГруппировки = ?(ТипГруппировки = Неопределено, ТипГруппировкиКомпоновкиДанных.Элементы, ТипГруппировки);
	Возврат НовыйЭлемент;
	
КонецФункции


&НаКлиенте
Процедура ПолучитьВС(Команда)
	ОткрытьФорму("Обработка.ОбменЭСФ.Форма.СопоставлениеИдСкладов");
	Закрыть();
КонецПроцедуры

