
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ОК(Команда)
	
	Отказ = Ложь;
	Если Количество = 0 Тогда
		ОчиститьСообщения();
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не заполнено количество'"), , "Количество", , Отказ);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрЗакрытия = Новый Структура;
	ПараметрЗакрытия.Вставить("Номенклатура"    , Номенклатура);
	ПараметрЗакрытия.Вставить("Валюта"          , Валюта);
	ПараметрЗакрытия.Вставить("Цена"            , Цена);
	ПараметрЗакрытия.Вставить("Количество"      , Количество);
	ПараметрЗакрытия.Вставить("Спецификация"    , Спецификация);
	ПараметрЗакрытия.Вставить("ЕдиницаИзмерения", ЕдиницаИзмерения);
	
	Закрыть(ПараметрЗакрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть(Неопределено);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ШАПКИ

&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
	
	Сумма = Цена * Количество;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенаПриИзменении(Элемент)
	
	Сумма = Цена * Количество;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокСвойств = "Валюта, Цена, Количество, Номенклатура, ЕдиницаИзмерения, Спецификация";
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры, СписокСвойств);
	
	Сумма = Цена * Количество;
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)

	Элементы = Форма.Элементы;
	
	Если Не Форма.Параметры.ЕстьЦена Тогда
		Элементы.ГруппаЦена.Доступность  = Ложь;
		Элементы.ГруппаСумма.Доступность = Ложь;
		
		Форма.Заголовок = НСтр("ru = 'Ввод количества'");
	КонецЕсли;
	
	Если Не Форма.Параметры.ЕстьКоличество Тогда
		Элементы.ГруппаКоличество.Доступность = Ложь;
		
		Форма.Заголовок = НСтр("ru = 'Ввод цены'");
	КонецЕсли;
	
КонецПроцедуры

