
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьПараметрыСпискаДокументов();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыСпискаДокументов()
	
	СписокДокументов.Параметры.УстановитьЗначениеПараметра("УИНН", ТекущийУИНН);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		ТекущийУИНН = "";
	Иначе
		ТекущийУИНН = ТекущиеДанные.Ссылка;
	КонецЕсли;
	
	УстановитьПараметрыСпискаДокументов();
	
КонецПроцедуры
