#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ОбщегоНазначенияБК.ЭтоПростаяВерсияКонфигурации()Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Если НЕ Значение Тогда
		 ОбновитьНастройкиИспользованияСчетовУчета();
	КонецЕсли;

КонецПроцедуры

Процедура ОбновитьНастройкиИспользованияСчетовУчета()
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	НастройкиПользователей.Ссылка КАК Настройка
	               |ПОМЕСТИТЬ ВТ_Настройки
	               |ИЗ
	               |	ПланВидовХарактеристик.НастройкиПользователей КАК НастройкиПользователей
	               |ГДЕ
	               |	НастройкиПользователей.Идентификатор = ""ПоказыватьВДокументахСчетаУчета""
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	НастройкиПользователей.Пользователь КАК Пользователь,
	               |	НастройкиПользователей.Настройка КАК Настройка,
	               |	НастройкиПользователей.Значение КАК Значение
	               |ИЗ
	               |	РегистрСведений.НастройкиПользователей КАК НастройкиПользователей
	               |ГДЕ
	               |	НастройкиПользователей.Настройка В
	               |			(ВЫБРАТЬ
	               |				ВТ_Настройки.Настройка
	               |			ИЗ
	               |				ВТ_Настройки КАК ВТ_Настройки)";
	Выборка =  Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НаборНастроек = РегистрыСведений.НастройкиПользователей.СоздатьМенеджерЗаписи();
		НаборНастроек.Пользователь = Выборка.Пользователь;
		НаборНастроек.Настройка = Выборка.Настройка;
		НаборНастроек.Прочитать();
		НаборНастроек.Значение = ЛОЖЬ;
		НаборНастроек.Записать(Истина);
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли
