
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВстроеннаяСправка = Документы.ВводНачальныхОстатков.ПолучитьТекстВстроеннойСправкиНастройкаРежима();

	ОтражатьВБУ    = Параметры.ОтражатьВБУ;
	ОтражатьВНУ    = Параметры.ОтражатьВНУ;
	
	ОтражатьПоСпециальнымРегистрам = Параметры.ОтражатьПоСпециальнымРегистрам;
	РазделУчета    = Параметры.РазделУчета;
	
	Если Не РазделУчета = Перечисления.РазделыУчетаДляВводаОстатков.Запасы Тогда
		Элементы.ГруппаВводаОстатковПоСпециальнымРегистрам.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ <ИМЯ ТАБЛИЦЫ ФОРМЫ>

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура КомандаОК(Команда)
	
	Если НЕ ОтражатьВБУ и НЕ ОтражатьВНУ И НЕ Элементы.ГруппаВводаОстатковПоСпециальнымРегистрам.Видимость Тогда
		Если НЕ РазделУчета = ПредопределенноеЗначение("Перечисление.РазделыУчетаДляВводаОстатков.Запасы") Тогда
			ТекстСообщения = НСтр("ru ='У документа должен быть включен хотя бы один из режимов проведения: ""Ввод остатков по бухгалтерскому учету"" и (или) ""Ввод остатков по налоговому учету"".'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,,Истина);
			Возврат;
		ИначеЕсли НЕ ОтражатьПоСпециальнымРегистрам Тогда
			ТекстСообщения = НСтр("ru ='У документа должен быть включен хотя бы один из режимов проведения: ""Ввод остатков по бухгалтерскому учету"" и (или) ""Ввод остатков по налоговому учету"" и (или) ""Ввод остатков по специальным регистрам"".'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,,Истина);
			Возврат;
		КонецЕсли;
	
	КонецЕсли;

	ПараметрЗакрытия = Новый Структура;
	ПараметрЗакрытия.Вставить("ОтражатьВБухгалтерскомУчете", ОтражатьВБУ);
	ПараметрЗакрытия.Вставить("УчитыватьКПН", ОтражатьВНУ);
	ПараметрЗакрытия.Вставить("ОтражатьПоСпециальнымРегистрам", ОтражатьПоСпециальнымРегистрам);
	
	Закрыть(ПараметрЗакрытия);

КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
