////////////////////////////////////////////////////////////////////////////////
// Форма для выполнения методов declineInvoiceById, revokeInvoiceById, unrevokeInvoiceById и т.д.
//
// Параметры формы:
//  См. ЭСФКлиентСервер.ПустыеПараметрыФормыИзменениеСтатусовЭСФ().
//
// Возвращаемое значение формы:
//  Нет.
//
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Действие = Параметры.Действие;
	
	Если ВозможноВыполнитьДействие() Тогда
		
		СтруктурнаяЕдиница = Параметры.МассивЭД[0].Организация;//ЭСФСервер.СтруктурнаяЕдиницаЭСФ(Параметры.МассивЭД[0]); КС момент с структурной единицей
		УстановитьПараметрыВыбораЭДВС();
		ЗаполнитьСписокЭДВС();
		
	Иначе
		
		Отказ = Истина;
		
	КонецЕсли;
	
	УстановитьЗаголовокФормы();
	УстановитьЗаголовокКнопкиВыполнитьДействие();	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Контейнер = ВСКлиентСервер.КонтейнерМетодов();	
	Контейнер.ПриОткрытииФормы(ЭтаФорма, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Для Каждого СтрокаСписокЭД Из СписокЭД Цикл
		
		Если ПустаяСтрока(СтрокаСписокЭД.Идентификатор) Тогда
			
			ИндексСтроки = СписокЭД.Индекс(СтрокаСписокЭД);
			НомерСтроки = ИндексСтроки + 1;
			
			Сообщение = Новый СообщениеПользователю;
			
			Сообщение.Текст = ЭСФКлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(НСтр("ru = 'В строке %1 не заполнено поле ""Идентификатор"".'"),Формат(НомерСтроки, "ЧГ=")); 
			
			Сообщение.Поле = "СписокЭСФ[%ИндексСтроки%].Идентификатор";
			Сообщение.Поле = СтрЗаменить(Сообщение.Поле, "%ИндексСтроки%", Формат(ИндексСтроки, "ЧГ="));
			
			Сообщение.Сообщить();
			
			Отказ = Истина;	
			
		Иначе
			
			ТекстСообщения = "";
			
			Если НЕ ЭСФКлиентСервер.ИдентификаторКорректен(СтрокаСписокЭД.Идентификатор, ТекстСообщения) Тогда 
				
				ИндексСтроки = СписокЭД.Индекс(СтрокаСписокЭД);
				НомерСтроки = ИндексСтроки + 1;
				
				Сообщение = Новый СообщениеПользователю;
				
				Сообщение.Текст = ЭСФКлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(НСтр("ru = 'В строке %1 поле ""Идентификатор"" заполнено некорректно. Причина: %2'"),Формат(НомерСтроки, "ЧГ="),ТекстСообщения); 
				
				Сообщение.Поле = "СписокЭСФ[%ИндексСтроки%].Идентификатор";
				Сообщение.Поле = СтрЗаменить(Сообщение.Поле, "%ИндексСтроки%", Формат(ИндексСтроки, "ЧГ="));
				
				Сообщение.Сообщить();
				
				Отказ = Истина;	
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = ВСКлиентСервер.ИмяСобытияЗаписьЭДВС()
		И НЕ Параметр = Неопределено 
		И Источник = ЭтаФорма Тогда
		
		КоллекцияРезультатовИзмененияСтатусов = ПолучитьИзВременногоХранилища(Параметр.АдресХранилища);
		
		Если НЕ Тип("Соответствие") = ТипЗнч(КоллекцияРезультатовИзмененияСтатусов) Тогда
			Возврат
		КонецЕсли;

		// Обработать результаты действия.
	    ОбработатьРезультатыИзмененияСтатусовЭДВСНаСервере(КоллекцияРезультатовИзмененияСтатусов);
		
		// Обновить открытые формы.
		МассивЭД = Новый Массив;
		Для Каждого СтрокаТаблицы Из СписокЭД Цикл
			Если ЗначениеЗаполнено(СтрокаТаблицы.ЭДВС) Тогда
				МассивЭД.Добавить(СтрокаТаблицы.ЭДВС);
			КонецЕсли;
		КонецЦикла; 
		
		// Показать результат отзыва.		
		Если ВсеСтатусыУспешноИзменены() Тогда
			
			ЗакрытьПослеОповещения = Новый ОписаниеОповещения("ЗакрытьФормуПослеОповещения", ЭтаФорма);
			ПоказатьПредупреждение(ЗакрытьПослеОповещения, НСтр("ru = 'Действие выполнено успешно.'"));
			
		Иначе
			
			ПоказатьПредупреждение(, НСтр("ru = 'Не удалось выполнить действие для всех документов ВС.'"));
			
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "ВС_ПроверятьОповещенияФоновогоЗадания"
		И ЭтаФорма.КлючУникальности = Источник Тогда
		
		ВСКлиентПереопределяемый.ОбработкаОповещенияВС_ПроверятьОповещенияФоновогоЗадания(ЭтаФорма, Параметр);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФормуПослеОповещения(Результат) Экспорт

	Закрыть();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ

&НаКлиенте
Процедура СписокЭДЭДВСПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СписокЭД.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		Если ЗначениеЗаполнено(ТекущиеДанные.ЭДВС) Тогда 
			ДанныеЭДВС = ДанныеЭДВС(ТекущиеДанные.ЭДВС);
			ТекущиеДанные.Идентификатор = ДанныеЭДВС.Идентификатор;
			ТекущиеДанные.Статус = ДанныеЭДВС.Статус;
			ТекущиеДанные.ТипФормы = ДанныеЭДВС.ТипФормы;
		КонецЕсли;
		
		ТекущиеДанные.ОшибкаПредставление = "";
		ТекущиеДанные.ОшибкаРасшифровка = "";
		ТекущиеДанные.ОшибкаЕсть = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЭДИдентификаторПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СписокЭД.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		Если НЕ ЗначениеЗаполнено(ТекущиеДанные.ЭДВС) Тогда 
			ТекущиеДанные.Статус = Неопределено;
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЭДПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Копирование Тогда 
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЭДВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	ТекущиеДанные = Элементы.СписокЭД.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		Если ТекущиеДанные.ОшибкаЕсть Тогда
			
			Если Поле.Имя = "СписокЭДОшибкаПредставление" Тогда
				СтандартнаяОбработка = Ложь;
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = ТекущиеДанные.ОшибкаРасшифровка;
				Сообщение.Поле = "СписокЭД[" + Формат(СписокЭД.Индекс(ТекущиеДанные), "ЧН=0; ЧГ=") + "].ОшибкаПредставление";
				Сообщение.Сообщить();
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ИзменитьСтатусЭДВС(Команда)
	
	Контейнер = ЭСФКлиентСервер.КонтейнерМетодов();
	
	Если НЕ Контейнер.КриптопровайдерПодключается() Тогда
		Возврат;
	КонецЕсли;	
	
	// Проверить заполнение.
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат
	КонецЕсли;
	
	КоллекцияСгруппированныхЭД = Новый Соответствие;
	КоллекцияСгруппированныхЭД.Вставить(СтруктурнаяЕдиница, );
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("КоллекцияСгруппированныхЭД", КоллекцияСгруппированныхЭД);
	
	ИзменитьСтатусЭДЗавершение = Новый ОписаниеОповещения("ИзменитьСтатусЭДЗавершение", ЭтаФорма, ДополнительныеПараметры);
	
	ЭСФКлиент.ОпределитьНеобходимостьВводаДанныхИСЭСФ(КоллекцияСгруппированныхЭД, ИзменитьСтатусЭДЗавершение, ПредопределенноеЗначение("Перечисление.МодулиЭСФ.ВС"));
	
КонецПроцедуры
	
&НаКлиенте
Процедура ИзменитьСтатусЭДЗавершение(ДанныеПрофилейИСЭСФ, ДополнительныеПараметры) Экспорт
	
	Если ДанныеПрофилейИСЭСФ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// форма изменения статуса работает только с одной структурной единицей
	ДанныеКлючаЭЦП = ДанныеПрофилейИСЭСФ.Получить(СтруктурнаяЕдиница);
	ДанныеПрофиляИСЭСФ = ЭСФВызовСервера.ДанныеПрофиляИСЭСФ(ДанныеКлючаЭЦП.ПрофильИСЭСФ);
	ДанныеПрофиляИСЭСФ.ТекущийПарольАутентификации = ДанныеКлючаЭЦП.ПарольИСЭСФ;
	
	Если НЕ ОткрытьСессиюСПодписьюДляПрофилей(ДанныеПрофилейИСЭСФ) Тогда
		Возврат;
	КонецЕсли;
		
	// Сформировать коллекцию для выполнения действия.
	КоллецияДляИзмененияСтатусов = Новый Соответствие;
	Для Каждого СтрокаТаблицы Из СписокЭД Цикл
		КоллецияДляИзмененияСтатусов.Вставить(СтрокаТаблицы.Идентификатор, Причина);
	КонецЦикла;
	
	// Выполнить действие.
	КоллекцияРезультатовИзмененияСтатусов = ВСКлиент.ИзменитьСтатусыЭДВС(Действие, КоллецияДляИзмененияСтатусов, ДанныеПрофиляИСЭСФ, ДанныеКлючаЭЦП, УникальныйИдентификатор, Параметры.ЗапускатьФоновоеЗадание);		
	
	Если КоллекцияРезультатовИзмененияСтатусов <> Неопределено Тогда
		
		Если Параметры.ЗапускатьФоновоеЗадание Тогда
			
			Если ТипЗнч(КоллекцияРезультатовИзмененияСтатусов) = Тип("Структура") Тогда
				КоллекцияРезультатовИзмененияСтатусов.Вставить("ТекстСообщения", НСтр("ru = 'Отмена документов в ИС ВС'"));
			КонецЕсли;
			
			ЭСФКлиент.ОповеститьФормы("ВС_ПроверятьОповещенияФоновогоЗадания", КоллекцияРезультатовИзмененияСтатусов, КлючУникальности);
			
		Иначе
			
			// Обработать результаты действия.
			ОбработатьРезультатыИзмененияСтатусовЭДВСНаСервере(КоллекцияРезультатовИзмененияСтатусов);
			
			АдресХранилища = ПоместитьВоВременноеХранилище(КоллекцияРезультатовИзмененияСтатусов);
			ЭСФКлиент.ОповеститьФормы(ВСКлиентСервер.ИмяСобытияЗаписьЭДВС(), Новый Структура("АдресХранилища", АдресХранилища), ЭтаФорма);
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбработатьРезультатыИзмененияСтатусовЭДВСНаСервере(Знач КоллекцияРезультатовИзмененияСтатусов)
	
	ОбработкаОбменЭСФ = ЭСФСерверПовтИсп.ОбработкаОбменЭСФ();	
	ОбработкаОбменЭСФ.ОбработатьРезультатыИзмененияСтатусовЭДВС(КоллекцияРезультатовИзмененияСтатусов, ЭтаФорма);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// Проверка возможности выполнения действия

&НаСервере
Функция ВозможноВыполнитьДействие()
	
	Возможно = Истина;
	
	РезультатЗапроса = ДанныеДляПроверкиВозможностиВыполненияДействия();
	
	// Проверить количество ЭСФ.
	Если РезультатЗапроса.Пустой() Тогда
		
		Возможно = Ложь;
		ЭСФКлиентСервер.СообщитьПользователю(НСтр("ru = 'Невозможно выполнить действие, так как не указаны документы ВС, для которых необходимо выполнить действие.'"));
		
	КонецЕсли;
	
	// Проверить, что во всех ЭСФ указана одинаковая организация и подразделение организации. 
	Если Возможно Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		
		// Проверить, что во всех ЭСФ указана одинаковая организация.
		Выборка.Сбросить();
		Выборка.Следующий();
		ПерваяОрганизация = Выборка.Организация;
		Пока Выборка.Следующий() Цикл
			Если Выборка.Организация <> ПерваяОрганизация Тогда
				ОтзывВозможен = Ложь;
				ЭСФКлиентСервер.СообщитьПользователю(НСтр("ru = 'Все электронные документы виртуального склада должны принадлежать одной организации.'"));
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		// Проверить, что во всех ЭСФ указано одинаковое подразделение организации.
		//Если ЭСФКлиентСерверПереопределяемый.ИспользуютсяСтруктурныеПодразделения() Тогда
		//	Выборка.Сбросить();
		//	Выборка.Следующий();
		//	ПервоеПодразделение = Выборка.СтруктурноеПодразделение;
		//	Пока Выборка.Следующий() Цикл
		//		Если Выборка.СтруктурноеПодразделение <> ПервоеПодразделение Тогда
		//			ОтзывВозможен = Ложь;
		//			ЭСФКлиентСервер.СообщитьПользователю(НСтр("ru = 'Все электронные счета-фактуры должны принадлежать одному структурному подразделению.'"));
		//			Прервать;
		//		КонецЕсли;
		//	КонецЦикла;
		//КонецЕсли;
		
	КонецЕсли;
	
	// Проверить, чтобы у всех ЭСФ было одинаковое направление, в зависимости от действия.
	//ТребуемоеНаправление = НаправлениеДляДействия(Действие);
	//Если НЕ ВсеЭСФИмеютНаправление(ТребуемоеНаправление, РезультатЗапроса, Истина) Тогда
	//	Возможно = Ложь;
	//КонецЕсли;
	
	//Если Возможно Тогда
	//	
	//	// 1. Для отклонения отозванных используется метод unrevokeInvoiceById.
	//	// 2. Для отклонения дополнительных и исправленных используется метод declineInvoiceById.
	//	// Все отклоняемые ЭСФ должны быть первого или второго типа.
	//	Если Действие = ЭСФКлиентСервер.ДействиеОтклонение() Тогда
	//		
	//		Выборка = РезультатЗапроса.Выбрать();
	//		
	//		Пока Выборка.Следующий() Цикл
	//			
	//			Если Выборка.Вид <> Перечисления.ВидыЭСФ.Дополнительный
	//				И Выборка.Вид <> Перечисления.ВидыЭСФ.Исправленный
	//				И Выборка.Статус <> Перечисления.СтатусыЭСФ.Отозванный Тогда
	//				
	//				Возможно = Ложь;
	//				
	//				ТекстСообщения = НСтр("ru = 'Невозможно выполнить действие, так как ""[ЭСФ]"" не является дополнительным, исправленным или отозванным.'");		
	//				ТекстСообщения = СтрЗаменить(ТекстСообщения, "[ЭСФ]", Выборка.ЭСФ);
	//				ЭСФКлиентСервер.СообщитьПользователю(ТекстСообщения);
	//				
	//			КонецЕсли;	
	//			
	//		КонецЦикла;
	//		
	//	КонецЕсли;
	//	
	//КонецЕсли;
		
	Возврат Возможно;
	
КонецФункции

&НаСервере
Функция НаправлениеДляДействия(Знач Действие)
	
	Направление = Неопределено;
	
	Если Действие = ЭСФКлиентСервер.ДействиеОтзыв() Тогда
		
		Направление = Перечисления.НаправленияЭСФ.Исходящий;
		
	ИначеЕсли Действие = ЭСФКлиентСервер.ДействиеОтклонение() Тогда
		
		Направление = Перечисления.НаправленияЭСФ.Входящий;
		
	Иначе
		
		ВызватьИсключение НСтр("ru = 'Внутренняя ошибка. Необработанное действие.'");
		
	КонецЕсли;
	
	Возврат Направление;
	
КонецФункции

&НаСервере
Функция ВсеЭСФИмеютНаправление(Знач Направление, Знач РезультатЗапроса, Знач ПоказыватьСообщения)
	
	ВсеЭСФИмеютНаправление = Истина;
	
	Выборка = РезультатЗапроса.Выбрать();		
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Направление <> Направление Тогда
			
			ВсеЭСФИмеютНаправление = Ложь;
			
			Если ПоказыватьСообщения Тогда 
				ТекстСообщения = ЭСФКлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(НСтр("ru = 'Невозможно выполнить действие для документа ""%1"", так как он %2.'"),
				Выборка.ЭСФ, НРег(Направление));
				ЭСФКлиентСервер.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;	
	
	Возврат ВсеЭСФИмеютНаправление;
	
КонецФункции

&НаСервере
Функция ДанныеДляПроверкиВозможностиВыполненияДействия()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЭлектронныйДокументВС.Ссылка,
	|	ЭлектронныйДокументВС.Организация,
	|	ЭлектронныйДокументВС.Статус



	|ИЗ
	|	Документ.ЭлектронныйДокументВС КАК ЭлектронныйДокументВС
	|ГДЕ
	|	ЭлектронныйДокументВС.Ссылка В(&МассивЭД)";
	
	Запрос.УстановитьПараметр("МассивЭД", Параметры.МассивЭД);
	
	//Если НЕ ЭСФКлиентСерверПереопределяемый.ИспользуютсяСтруктурныеПодразделения() Тогда
	//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЭСФ.СтруктурноеПодразделение,", "");
	//КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();

	Возврат РезультатЗапроса;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Прочие служебные процедуры и функции

&НаКлиенте
Функция ВсеСтатусыУспешноИзменены()
	
	Успешно = Истина;
	
	Для Каждого СтрокаСписокЭД Из СписокЭД Цикл
		Если СтрокаСписокЭД.ОшибкаЕсть Тогда
			Успешно = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Успешно;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСписокЭДВС()	
	
	СписокЭД.Очистить();
	
	Если Действие = ВСКлиентСервер.ДействиеОтмена() Тогда
		
		ЗаполнитьСписокЭДВС_Отмена();
	
	//ИначеЕсли Действие = ЭСФКлиентСервер.ДействиеОтзыв() Тогда
	//	
	//	ЗаполнитьСписокЭСФ_Отзыв();

		
	Иначе
		
		ВызватьИсключение НСтр("ru = 'Внутренняя ошибка. Необработанное действие.'");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокЭСФ_Отзыв()
	
	Запрос = Новый Запрос;	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЭСФ.Ссылка КАК ЭСФ,
	|	0 КАК Порядок
	|ПОМЕСТИТЬ ОтзываемыеИДополнительныеЭСФ
	|ИЗ
	|	Документ.ЭСФ КАК ЭСФ
	|ГДЕ
	|	ЭСФ.Ссылка В(&МассивОтзываемыхЭСФ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЭСФ.Ссылка,
	|	1
	|ИЗ
	|	Документ.ЭСФ КАК ЭСФ
	|ГДЕ
	|	ЭСФ.СвязанныйЭСФ В(&МассивОтзываемыхЭСФ)
	|	И ЭСФ.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыЭСФ.Дополнительный)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОтзываемыеИДополнительныеЭСФ.ЭСФ,
	|	МИНИМУМ(ОтзываемыеИДополнительныеЭСФ.Порядок) КАК Порядок
	|ПОМЕСТИТЬ СгруппированныеЭСФ
	|ИЗ
	|	ОтзываемыеИДополнительныеЭСФ КАК ОтзываемыеИДополнительныеЭСФ
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтзываемыеИДополнительныеЭСФ.ЭСФ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СгруппированныеЭСФ.ЭСФ КАК ЭСФ,
	|	СгруппированныеЭСФ.ЭСФ.Идентификатор КАК Идентификатор,
	|	СгруппированныеЭСФ.ЭСФ.Статус КАК Статус,
	|	СгруппированныеЭСФ.ЭСФ.Вид КАК Вид
	|ИЗ
	|	СгруппированныеЭСФ КАК СгруппированныеЭСФ
	|
	|УПОРЯДОЧИТЬ ПО
	|	СгруппированныеЭСФ.Порядок";
	
	Запрос.УстановитьПараметр("МассивОтзываемыхЭСФ", Параметры.МассивЭД);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтрокаСписокЭСФ = СписокЭД.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаСписокЭСФ, Выборка);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокЭДВС_Отмена()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЭлектронныйДокументВС.Ссылка КАК ЭДВС,
	|	ЭлектронныйДокументВС.Идентификатор,
	|	ЭлектронныйДокументВС.Статус,
	|	ЭлектронныйДокументВС.ТипФормы
	|ИЗ
	|	Документ.ЭлектронныйДокументВС КАК ЭлектронныйДокументВС
	|ГДЕ
	|	ЭлектронныйДокументВС.Ссылка В(&МассивЭД)";
	
	Запрос.УстановитьПараметр("МассивЭД", Параметры.МассивЭД);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтрокаСписокЭД = СписокЭД.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаСписокЭД, Выборка);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыВыбораЭДВС()
	
	Массив = Новый Массив;
	
	//ПараметрВыбора = Новый ПараметрВыбора("Отбор.Направление", НаправлениеДляДействия(Действие)); 
	//Массив.Добавить(ПараметрВыбора);
	
	ПараметрВыбора = Новый ПараметрВыбора("Отбор.Организация", Параметры.МассивЭД[0].Организация); 
	Массив.Добавить(ПараметрВыбора);	
	
	//Если ЭСФКлиентСерверПереопределяемый.ИспользуютсяСтруктурныеПодразделения() Тогда
	//	ПараметрВыбора = Новый ПараметрВыбора("Отбор.СтруктурноеПодразделение", Параметры.МассивЭД[0].СтруктурноеПодразделение); 
	//	Массив.Добавить(ПараметрВыбора);		
	//КонецЕсли;
	
	Элементы.СписокЭДЭДВС.ПараметрыВыбора = Новый ФиксированныйМассив(Массив);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДанныеЭДВС(ЭДВС)
	
	Данные = Новый Структура;
	Данные.Вставить("Идентификатор", "");
	Данные.Вставить("Статус", Перечисления.СтатусыЭСФ.ПустаяСсылка());
	Данные.Вставить("ТипФормы", Перечисления.ТипыФормВС.ПустаяСсылка());
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЭлектронныйДокументВС.ТипФормы,
	|	ЭлектронныйДокументВС.Статус,
	|	ЭлектронныйДокументВС.Идентификатор
	|ИЗ
	|	Документ.ЭлектронныйДокументВС КАК ЭлектронныйДокументВС
	|ГДЕ
	|	ЭлектронныйДокументВС.Ссылка = &ЭДВС";	
	
	Запрос.УстановитьПараметр("ЭДВС", ЭДВС);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Данные.Идентификатор = Выборка.Идентификатор;
		Данные.Статус = Выборка.Статус;
		Данные.ТипФормы = Выборка.ТипФормы;
	КонецЕсли;
	
	Возврат Данные;
	
КонецФункции

&НаСервере
Процедура УстановитьЗаголовокФормы()
	
	
	Если Действие = ВСКлиентСервер.ДействиеОтмена() Тогда
		ЭтаФорма.Заголовок = НСтр("ru = 'Отмена документов ВС'");

	Иначе
		
		ВызватьИсключение НСтр("ru = 'Внутренняя ошибка. Необработанное действие.'");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокКнопкиВыполнитьДействие()
	
	
	Если Действие = ВСКлиентСервер.ДействиеОтмена() Тогда
		
		Элементы.ФормаВыполнитьДействие.Заголовок = НСтр("ru = 'Отменить документы ВС'");

	Иначе
		
		ВызватьИсключение НСтр("ru = 'Внутренняя ошибка. Необработанное действие.'");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ОтклонитьИсправленныеИлиДополнительныеИлиОтозванныеЭСФ(ДанныеПрофиляИСЭСФ, ДанныеКлючаЭЦП)
	
	/////////////////////////////////////////////////////////////////////////////
	// Выполнить отклонение отозванных ЭСФ.
	
	// Сформировать коллекцию для отклонения отозванных.
	КоллецияДляИзмененияСтатусов = Новый Соответствие;
	Для Каждого СтрокаТаблицы Из СписокЭД Цикл
		Если СтрокаТаблицы.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭСФ.Отозванный") Тогда
			КоллецияДляИзмененияСтатусов.Вставить(СтрокаТаблицы.Идентификатор, Причина);
		КонецЕсли;
	КонецЦикла;
	
	// Выполнить отклонение отозванных.
	Если КоллецияДляИзмененияСтатусов.Количество() <> 0 Тогда
		
		КоллекцияРезультатовОтклоненияОтозванных = ЭСФКлиент.ИзменитьСтатусыЭСФ(
			ЭСФКлиентСервер.ДействиеОтклонениеОтзыва(),
			КоллецияДляИзмененияСтатусов,
			ДанныеПрофиляИСЭСФ,
			ДанныеКлючаЭЦП,
			УникальныйИдентификатор,
			// всегда равено Ложь, тк действие требует выполнения нескольких запросов
			Ложь);
			
	Иначе
		
		КоллекцияРезультатовОтклоненияОтозванных = Новый Соответствие;
		
	КонецЕсли;
	
	
	
	/////////////////////////////////////////////////////////////////////////////
	// Выполнить отклонение исправленных или дополнительных ЭСФ.
	
	// Сформировать коллекцию для отклонения дополнительных и исправленных.
	КоллецияДляИзмененияСтатусов = Новый Соответствие;
	Для Каждого СтрокаТаблицы Из СписокЭД Цикл
		Если СтрокаТаблицы.Статус <> ПредопределенноеЗначение("Перечисление.СтатусыЭСФ.Отозванный") Тогда
			// В данной проверке не проверяется "Дополнительный" или "Исправленный",
			// чтобы во второй запрос попали все ЭСФ, которые не являются отозванными.
			КоллецияДляИзмененияСтатусов.Вставить(СтрокаТаблицы.Идентификатор, Причина);
		КонецЕсли;
	КонецЦикла;
	
	// Выполнить отклонение дополнительных и исправленных.
	Если КоллецияДляИзмененияСтатусов.Количество() <> 0 Тогда
		
		КоллекцияРезультатовОтклоненияДополнительныхИлиИсправленных = ЭСФКлиент.ИзменитьСтатусыЭСФ(
			ЭСФКлиентСервер.ДействиеОтклонениеДополнительногоИлиИсправленного(), 
			КоллецияДляИзмененияСтатусов, 
			ДанныеПрофиляИСЭСФ, 
			ДанныеКлючаЭЦП,
			УникальныйИдентификатор,
			// всегда равено Ложь, тк действие требует выполнения нескольких запросов
			Ложь);
			
	Иначе
		
		КоллекцияРезультатовОтклоненияДополнительныхИлиИсправленных = Новый Соответствие;
		
	КонецЕсли;
	
	
	
	/////////////////////////////////////////////////////////////////////////////
	// Объединить результаты выполнения двух отклонений.
	
	КоллекцияРезультатовИзмененияСтатусов = Новый Соответствие;
	
	Для Каждого ЭлементКоллекции Из КоллекцияРезультатовОтклоненияОтозванных Цикл
		КоллекцияРезультатовИзмененияСтатусов.Вставить(ЭлементКоллекции.Ключ, ЭлементКоллекции.Значение);
	КонецЦикла;
	
	Для Каждого ЭлементКоллекции Из КоллекцияРезультатовОтклоненияДополнительныхИлиИсправленных Цикл
		КоллекцияРезультатовИзмененияСтатусов.Вставить(ЭлементКоллекции.Ключ, ЭлементКоллекции.Значение);
	КонецЦикла;
	
	
	
	/////////////////////////////////////////////////////////////////////////////
	// Возврат результата.
	
	Возврат КоллекцияРезультатовИзмененияСтатусов;
	
КонецФункции

&НаКлиенте
// Открывает сессии с подписью для переданных данных с профилей ИСЭСФ.
//
// Параметры:
//  ДанныеПрофилейИСЭСФ - Массив или Соответствие, или Ссылка  на справочник ПрофилиИСЭСФ,
//   по которым(му) происходит открытие сессий.
//  ПараметрыОткрытияСессии - Структура - параметры для открытия сессии с подписью,
//   функция для получения параметров - ЭСФКлиентСервер.ПолучитьПараметрыОткрытияСессииСПодписьюПоУмолчанию().
//
// Возвращаемое значение:
//  <Булево> - Результат работы функции.
//
Функция ОткрытьСессиюСПодписьюДляПрофилей(ДанныеПрофилейИСЭСФ, ПараметрыОткрытияСессии = Неопределено) Экспорт
	
	Контейнер = ВСКлиентСервер.КонтейнерМетодов();
	
	Возврат Контейнер.ОткрытьСессиюСПодписьюДляПрофилей(ДанныеПрофилейИСЭСФ,ПараметрыОткрытияСессии);
	
КонецФункции
