
#Область ПрограммныйИнтерфейс

// Определяет объекты конфигурации, в модулях менеджеров которых размещена процедура ДобавитьКомандыПечати,
// формирующая список команд печати, предоставляемых этим объектом.
// Синтаксис процедуры ДобавитьКомандыПечати см. в документации к подсистеме.
//
// Параметры:
//  СписокОбъектов - Массив - менеджеры объектов с процедурой ДобавитьКомандыПечати.
//
Процедура ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов) Экспорт
	
	Для Каждого Документ Из Метаданные.Документы Цикл
		Если Найти(Документ.Имя,"си_")=0 Тогда
			Продолжить;
		КонецЕсли;
		КоллекцияКП = УправлениеПечатью.СоздатьКоллекциюКомандПечати();
		Попытка
			Документы[Документ.Имя].ДобавитьКомандыПечати(КоллекцияКП);
			Если  КоллекцияКП.Количество()>0 Тогда
				СписокОбъектов.Добавить(Документы[Документ.Имя]);
			КонецЕсли;
		Исключение
			
		КонецПопытки;
		
	КонецЦикла;
КонецПроцедуры

#КонецОбласти 