
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Процедура обеспечивает открытие справочника
// с предустановленным родителем
//
// Параметры:
// ЭлементРодитель - СправочникСсылка.ДвижениеДенежныхСредств 
//					элемент по которому отфильтровываются элементы	
&НаКлиенте
Процедура УстановитьРодителя(ЭлементРодитель) Экспорт
	
	Элементы.Список.ТекущийРодитель = ЭлементРодитель;		
	Элементы.Список.ВосстанавливатьТекущуюСтроку = Ложь;
	
КонецПроцедуры	
