///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ

//бит_Tsyganov Процедура - обработчик события "ПередЗаписью" объекта справочника 
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		//В случае выполнения обмена данными не производить проверку
		Возврат;
	КонецЕсли; 	
	
	// Выполним синхронизацию пометки на удаление объекта и дополнительных файлов.
	//бит_ХранениеДополнительнойИнформации.СинхронизацияПометкиНаУдалениеУДополнительныхФайлов(ЭтотОбъект);
	
	Если Не ЭтоНовый() И Не ПометкаУдаления=Ссылка.ПометкаУдаления Тогда
		//В случае установки или снятия пометки удаления не производить проверку
		Возврат;
	КонецЕсли;	
	
	//Выполним проверку заполненности обязательных реквизитов для элемента справочника
	Если Не ЭтоГруппа Тогда
		
		// Укажем, что надо проверить:
		СтруктураРеквизитов = Новый Структура("ВидЦФО");
		
		// Теперь вызовем общую процедуру проверки.
		//ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураРеквизитов, Отказ, "Проверка заполнения обязательных реквизитов элемента справочника ""ЦФО"".");
		ОбщегоНазначенияБК.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураРеквизитов, Отказ, "Проверка заполнения обязательных реквизитов элемента справочника ""ЦФО"".");
	
	КонецЕсли;
	
КонецПроцедуры
