
#Область СлужебныйПрограммныйИнтерфейс

#Область ТекущиеДелаЭДО

// Открыть обращение в службу технической поддержки.
Процедура ОткрытьОбращениеВСлужбуТехническойПоддержки() Экспорт
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.СообщенияВСлужбуТехническойПоддержки") Тогда
		МодульСообщенияВСлужбуТехническойПоддержкиКлиентСервер =
			ОбщегоНазначенияКлиент.ОбщийМодуль("СообщенияВСлужбуТехническойПоддержкиКлиентСервер");
	
		ДанныеСообщения = МодульСообщенияВСлужбуТехническойПоддержкиКлиентСервер.ДанныеСообщения();
		ДанныеСообщения.Получатель                    = "edo";
		ДанныеСообщения.Тема                          = НСтр("ru = 'Текущие дела ЭДО'");
		ДанныеСообщения.Сообщение                     = НСтр("ru = '<Заполните текст обращения>'");
		ДанныеСообщения.ИспользоватьСтандартныйШаблон = Истина;
		МодульСообщенияВСлужбуТехническойПоддержкиКлиент = 
			ОбщегоНазначенияКлиент.ОбщийМодуль("СообщенияВСлужбуТехническойПоддержкиКлиент");
	
		МодульСообщенияВСлужбуТехническойПоддержкиКлиент.ОтправитьСообщение(
			ДанныеСообщения, ,
			Неопределено,
			Новый ОписаниеОповещения("ПриЗавершенииОтправкиСообщенияВТехПоддержку", ЭтотОбъект));
	Иначе
		ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку("https://its.1c.ru/sd/form/edo");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПросмотрЭлектронногоДокумента

#Область ОбработкаСобытийВыполненияДействийПоЭДО

// При завершении отправки сообщения в тех поддержку.
// 
// Параметры:
// Результат - Структура - результат отправки сообщения:
//                            *КодОшибки - Строка - идентификатор ошибки при отправки:
//                                                   <Пустая строка> отправка - выполнена успешно;
//                                                   "НеверныйФорматЗапроса" - переданы некорректные параметры
//                                                     сообщения сообщения в техническую поддержку;
//                                                   ПревышенМаксимальныйРазмер - превышен максимальный
//                                                     размер вложения;
//                                                   НеизвестнаяОшибка - при отправке сообщения возникли ошибки;
//                            *СообщениеОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке
//                                                 для пользователя;
// ДополнительныеПараметры - Неопределено
//
Процедура ПриЗавершенииОтправкиСообщенияВТехПоддержку(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат.КодОшибки) Тогда
		ПоказатьПредупреждение(, Результат.СообщениеОбОшибке);
	КонецЕсли;
	
КонецПроцедуры
 
#КонецОбласти 

#КонецОбласти

#КонецОбласти
