
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Источник = ПараметрыВыполненияКоманды.Источник;
	
	//Запишем изменения в форме
	Если ТипЗнч(Источник) = Тип("ФормаКлиентскогоПриложения") Тогда
		Источник.Записать();
	КонецЕсли;
	
	ИнтеграцияИСМПТКВызовСервера.СоздатьУведомленияОРасхождении(ПараметрКоманды);
	
	ИмяСобытия = РаботаСДокументамиИСМПТККлиент.ОпределитьИмяСобытияПоТипуДокумента(ОбщегоНазначенияИСМПТКВызовСервера.ИмяДокументаУведомлениеОРасхожденияхИСЦЭДМ());
	ИнтеграцияИСМПТККлиент.ОповеститьФормы(ИмяСобытия, ПараметрКоманды);
	
КонецПроцедуры
