#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура ЗаполнитьТабличнуюЧастьОС(Объект, ПоддержкаРаботыСоСтруктурнымиПодразделениями, РежимЗаполнения) Экспорт 
	
	Если РежимЗаполнения = "ПоОстаткам" Тогда 
		СписокОС = Неопределено;
	ИначеЕсли РежимЗаполнения = "ПоДаннымУчета" Тогда 
		СписокОС = Объект.ОС.Выгрузить(,"ОсновноеСредство");
	КонецЕсли;
	
	Запрос = Новый Запрос();
	
	Запрос.УстановитьПараметр("ДатаОстатков",  Новый Граница(Объект.Дата, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация",   Объект.Организация);
	Запрос.УстановитьПараметр("Подразделение", Объект.ПодразделениеОрганизации);
	Запрос.УстановитьПараметр("МОЛ", 		   Объект.МОЛОрганизации);
	Запрос.УстановитьПараметр("СубконтоОС",    ПланыВидовХарактеристик.ВидыСубконтоТиповые.ОсновныеСредства);
	Запрос.УстановитьПараметр("СписокОС",      СписокОС);
	Запрос.УстановитьПараметр("Состояние",     Перечисления.ВидыСостоянийОС.СнятоСУчета);
	
	Если ПоддержкаРаботыСоСтруктурнымиПодразделениями Тогда
		Запрос.УстановитьПараметр("СтруктурноеПодразделение", Объект.СтруктурноеПодразделение);				
		УсловиеСтруктурноеПодразделение = ?(ПоддержкаРаботыСоСтруктурнымиПодразделениями, " И СтруктурноеПодразделение = &СтруктурноеПодразделение "," ");
	Иначе
		УсловиеСтруктурноеПодразделение = "";
	КонецЕсли;
	
	УсловиеОС       	  = ?(ЗначениеЗаполнено(СписокОС), "И ОсновноеСредство В(&СписокОС)", "");
	УсловиеСубконто 	  = ?(ЗначениеЗаполнено(СписокОС), "И Субконто1 В(&СписокОС)", "");
	УсловиеПодразделение  = ?(ЗначениеЗаполнено(Объект.ПодразделениеОрганизации), "МестонахождениеОСБухгалтерскийУчет.Местонахождение = &Подразделение ", "");
	УсловиеМОЛ      	  = ?(ЗначениеЗаполнено(Объект.МОЛОрганизации), "МестонахождениеОСБухгалтерскийУчет.МОЛ = &МОЛ ", "");
	
	Если ЗначениеЗаполнено(УсловиеПодразделение) И  ЗначениеЗаполнено(УсловиеМОЛ) Тогда
		УсловиеМОЛ = " И " + УсловиеМОЛ;		
	КонецЕсли;                          
	
	Если ЗначениеЗаполнено (УсловиеПодразделение) ИЛИ ЗначениеЗаполнено(УсловиеМОЛ) ТОгда
		УсловиеПодразделение = " И " + УсловиеПодразделение;
	КонецЕсли;

	Запрос.Текст = "ВЫБРАТЬ
	               |	МестонахождениеОСБухгалтерскийУчет.ОсновноеСредство КАК ОсновноеСредство,
	               |	МестонахождениеОСБухгалтерскийУчет.Местонахождение КАК Местонахождение,
	               |	МестонахождениеОСБухгалтерскийУчет.МОЛ КАК МОЛ
	               |ПОМЕСТИТЬ ВТ_Подразделение
	               |ИЗ
	               |	РегистрСведений.МестонахождениеОСБухгалтерскийУчет.СрезПоследних(&ДатаОстатков, Организация = &Организация " + УсловиеОС + ") КАК МестонахождениеОСБухгалтерскийУчет
				   |	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияОСОрганизаций.СрезПоследних(
				   |	&ДатаОстатков,
				   |	Организация = &Организация) КАК СостоянияОСОрганизацийСрезПоследних
                   |	ПО МестонахождениеОСБухгалтерскийУчет.ОсновноеСредство = СостоянияОСОрганизацийСрезПоследних.ОсновноеСредство
				   |	И МестонахождениеОСБухгалтерскийУчет.Организация = СостоянияОСОрганизацийСрезПоследних.Организация
                   |	ГДЕ
				   |	СостоянияОСОрганизацийСрезПоследних.Состояние <> &Состояние
				   |	" + УсловиеПодразделение + УсловиеМОЛ + "
				   |	" + ?(ПоддержкаРаботыСоСтруктурнымиПодразделениями, " И МестонахождениеОСБухгалтерскийУчет.СтруктурноеПодразделение  = &СтруктурноеПодразделение", "") + "
				   |	" + ?(ПоддержкаРаботыСоСтруктурнымиПодразделениями, " И СостоянияОСОрганизацийСрезПоследних.СтруктурноеПодразделение = &СтруктурноеПодразделение", "") + "
				   |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ОсновноеСредство
	               |;
	               |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
				   |	СчетаБухгалтерскогоУчетаОССрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
				   |	СчетаБухгалтерскогоУчетаОССрезПоследних.СчетУчетаБУ
				   |ПОМЕСТИТЬ ВТ_Счета
				   |ИЗ
				   |	РегистрСведений.СчетаУчетаОС.СрезПоследних(
				   |			&ДатаОстатков,
				   |			Организация = &Организация
				   |				И ОсновноеСредство В
				   |					(ВЫБРАТЬ
				   |						ВТ_Подразделение.ОсновноеСредство
				   |					ИЗ
				   |						ВТ_Подразделение КАК ВТ_Подразделение)" + УсловиеСтруктурноеПодразделение + УсловиеОС + ") КАК СчетаБухгалтерскогоУчетаОССрезПоследних
				   |
				   |ОБЪЕДИНИТЬ ВСЕ
				   |
				   |ВЫБРАТЬ
				   |	СчетаБухгалтерскогоУчетаОССрезПоследних.ОсновноеСредство,
				   |	СчетаБухгалтерскогоУчетаОССрезПоследних.СчетНачисленияАмортизацииБУ
				   |ИЗ
				   |	РегистрСведений.СчетаУчетаОС.СрезПоследних(
				   |			&ДатаОстатков,
				   |			Организация = &Организация
				   |				И ОсновноеСредство В
				   |					(ВЫБРАТЬ
				   |						ВТ_Подразделение.ОсновноеСредство
				   |					ИЗ
				   |						ВТ_Подразделение КАК ВТ_Подразделение) " + УсловиеСтруктурноеПодразделение + УсловиеОС + ") КАК СчетаБухгалтерскогоУчетаОССрезПоследних
				   |
				   |ИНДЕКСИРОВАТЬ ПО
				   |	ОсновноеСредство
				   |;
                   |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВТ_Счета.ОсновноеСредство КАК ОсновноеСредство,
	               |	ЕСТЬNULL(ТиповойОстатки_ВосстановительнаяСтоимость.СуммаОстаток, 0) КАК ВосстановительнаяСтоимость
	               |ИЗ
	               |	ВТ_Счета КАК ВТ_Счета
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Типовой.Остатки(
	               |				&ДатаОстатков,
	               |				Счет В
	               |					(ВЫБРАТЬ
	               |						ВТ_Счета.СчетУчетаБУ
	               |					ИЗ
	               |						ВТ_Счета КАК ВТ_Счета),
	               |				&СубконтоОС,
	               |				Организация = &Организация " + УсловиеСтруктурноеПодразделение + УсловиеСубконто + ") КАК ТиповойОстатки_ВосстановительнаяСтоимость
	               |		ПО ВТ_Счета.ОсновноеСредство = ТиповойОстатки_ВосстановительнаяСтоимость.Субконто1";
	
	Результат = Запрос.Выполнить().Выгрузить();

	Если РежимЗаполнения = "ПоОстаткам" Тогда 
		Для Каждого СтрокаОС Из Результат Цикл
			
			НоваяСтрока = Объект.ОС.Добавить();
			
			НоваяСтрока.ОсновноеСредство       = СтрокаОС.ОсновноеСредство;
			НоваяСтрока.СтоимостьПоДаннымУчета = СтрокаОС.ВосстановительнаяСтоимость;
			НоваяСтрока.НаличиеПоДаннымУчета   = Истина;
			НоваяСтрока.НедостачаСумма         = СтрокаОС.ВосстановительнаяСтоимость;
			НоваяСтрока.НедостачаКоличество    = 1;
			
		КонецЦикла;
	ИначеЕсли РежимЗаполнения = "ПоДаннымУчета" Тогда 
		
		Для Каждого СтрокаОС Из Объект.ОС Цикл
			
			ОстатокОС = Результат.Найти(СтрокаОС.ОсновноеСредство, "ОсновноеСредство");
			
			Если НЕ (ОстатокОС = Неопределено) Тогда
				
				СтрокаОС.СтоимостьПоДаннымУчета = ОстатокОС.ВосстановительнаяСтоимость;
				СтрокаОС.НаличиеПоДаннымУчета   = Истина;
				
			Иначе
				
				СтрокаОС.СтоимостьПоДаннымУчета = 0;
				СтрокаОС.НаличиеПоДаннымУчета   = Ложь;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;

	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Интерфейс для работы с подсистемой Печать.

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Инв-8 (Инвентаризационная опись)
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПечатьИНВ8";
	КомандаПечати.Представление = НСтр("ru = 'Инв-8 (Инвентаризационная опись)'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.ПроверкаПроведенияПередПечатью = НЕ ПользователиБКВызовСервераПовтИсп.РазрешитьПечатьНепроведенныхДокументов();
	КомандаПечати.Порядок = 50;
	
	////////////////////////////////START Кибернетика//////////////////////////////////////// 
	// Автор: Пономарев Д.А.
	// Дата: 02.12.2024
	//
	// Описание: Инв-8.2 (Инвентаризационная опись)
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Идентификатор = "ПечатьИНВ8_2";
		КомандаПечати.Представление = НСтр("ru = 'Инв-8.2 (Инвентаризационная опись 2)'");
		КомандаПечати.Обработчик    = "УправлениеПечатьюБККлиент.ВыполнитьКомандуПечати";
		КомандаПечати.ПроверкаПроведенияПередПечатью = НЕ ПользователиБКВызовСервераПовтИсп.РазрешитьПечатьНепроведенныхДокументов();
		КомандаПечати.Порядок = 52;
    ////////////////////////////////FINISH Кибернетика///////////////////////////////////////
	
	// Инв-16 (сличительная ведомость)
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПечатьИНВ16";
	КомандаПечати.Представление = НСтр("ru = 'Инв-16 (сличительная ведомость)'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.ПроверкаПроведенияПередПечатью = НЕ ПользователиБКВызовСервераПовтИсп.РазрешитьПечатьНепроведенныхДокументов();
	КомандаПечати.Порядок = 51; 
	
	// Инв-16.2 (сличительная ведомость)
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПечатьИНВ16_2";
	КомандаПечати.Представление = НСтр("ru = 'Инв-16.2 (сличительная ведомость 2)'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.ПроверкаПроведенияПередПечатью = НЕ ПользователиБКВызовСервераПовтИсп.РазрешитьПечатьНепроведенныхДокументов();
	КомандаПечати.Порядок = 52;

	
	// Комплект документов
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПечатьИНВ8,ПечатьИНВ16";
	КомандаПечати.Представление = НСтр("ru = 'Комплект документов'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = НЕ ПользователиБКВызовСервераПовтИсп.РазрешитьПечатьНепроведенныхДокументов();
	КомандаПечати.ФиксированныйКомплект = Истина;
	КомандаПечати.ПереопределитьПользовательскиеНастройкиКоличества = Истина;
	КомандаПечати.Порядок = 73;
	
	// Комплект документов (на принтер)
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПечатьИНВ8,ПечатьИНВ16";
	КомандаПечати.Представление = НСтр("ru = 'Комплект документов (на принтер)'");
	КомандаПечати.Картинка = БиблиотекаКартинок.ПечатьСразу;
	КомандаПечати.ПроверкаПроведенияПередПечатью = НЕ ПользователиБКВызовСервераПовтИсп.РазрешитьПечатьНепроведенныхДокументов();
	КомандаПечати.ФиксированныйКомплект = Истина;
	КомандаПечати.ПереопределитьПользовательскиеНастройкиКоличества = Истина;
	КомандаПечати.СразуНаПринтер = Истина;
	КомандаПечати.Порядок = 74;
	
	// Настраиваемый комплект документов
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПечатьИНВ8,ПечатьИНВ16";
	КомандаПечати.Представление = НСтр("ru = 'Настраиваемый комплект документов'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = НЕ ПользователиБКВызовСервераПовтИсп.РазрешитьПечатьНепроведенныхДокументов();
	КомандаПечати.ЗаголовокФормы = НСтр("ru = 'Настраиваемый комплект'");
	КомандаПечати.ДополнитьКомплектВнешнимиПечатнымиФормами = Истина;
	КомандаПечати.Порядок = 75;
	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	// Инв-8 (Инвентаризационная опись)
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПечатьИНВ8") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ПечатьИНВ8",
			НСтр("ru = 'Инв-8 (Инвентаризационная опись)'"),
			ПечатьИНВ8(МассивОбъектов, ОбъектыПечати),
			,
			"Документ.ИнвентаризацияОС.ПФ_MXL_ИНВ8");
	КонецЕсли;
	
	////////////////////////////////START Кибернетика//////////////////////////////////////// 
	// Автор: Пономарев Д.А.
	// Дата: 02.12.2024
	//
	// Описание: Инв-8.2 (Инвентаризационная опись)
		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПечатьИНВ8_2") Тогда
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
				КоллекцияПечатныхФорм,
				"ПечатьИНВ8_2",
				НСтр("ru = 'Инв-8.2 (Инвентаризационная опись 2)'"),
				ПечатьИНВ8_2(МассивОбъектов, ОбъектыПечати),
				,
				"Документ.ИнвентаризацияОС.ПФ_MXL_ИНВ8_2");
		КонецЕсли;
	////////////////////////////////FINISH Кибернетика///////////////////////////////////////
	
	// Инв-16 (сличительная ведомость)
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПечатьИНВ16") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ПечатьИНВ16",
			НСтр("ru = 'Инв-16 (сличительная ведомость)'"),
			ПечатьИНВ16(МассивОбъектов, ОбъектыПечати),
			,
			"Документ.ИнвентаризацияОС.ПФ_MXL_ИНВ16");
	КонецЕсли;
	
	//++Кубасов Евгений
	// Инв-16 (сличительная ведомость)
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПечатьИНВ16_2") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ПечатьИНВ16_2",
			НСтр("ru = 'Инв-16.2 (сличительная ведомость 2)'"),
			ПечатьИНВ16_2(МассивОбъектов, ОбъектыПечати),
			,
			"Документ.ИнвентаризацияОС.ПФ_MXL_ИНВ16_2");
	КонецЕсли;
    //--Кубасов Евгений
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Подготовка табличных печатных документов.

Функция ПечатьИНВ8(МассивОбъектов, ОбъектыПечати) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
		
	// Создаем колонки Таблицы итогов
	ТаблицаИтогов = Новый ТаблицаЗначений();
	ТаблицаИтогов.Колонки.Добавить("ПорядковыйНомерИтогов");
	ТаблицаИтогов.Колонки.Добавить("ИтогНаличиеФактическое");
	ТаблицаИтогов.Колонки.Добавить("ИтогСтоимостьФактическая");
	ТаблицаИтогов.Колонки.Добавить("ИтогНаличиеПоДаннымУчета");
	ТаблицаИтогов.Колонки.Добавить("ИтогСтоимостьПоДаннымУчета"); 
	
	КодЯзыка = Метаданные.Языки.Русский.КодЯзыка;
	
	// Варианты заголовков разделов с подписями печатной формы	
	ЗаголовокРазделаКомиссии = Новый Структура();
	ЗаголовокРазделаКомиссии.Вставить("МОЛ",                  НСтр("ru = 'Лицо(а), ответственное(ые) за сохранность основных средств:'", КодЯзыка));
	ЗаголовокРазделаКомиссии.Вставить("ПредседательКомиссии", НСтр("ru = 'Председатель комиссии'", КодЯзыка));
	ЗаголовокРазделаКомиссии.Вставить("ЧленыКомиссии",        НСтр("ru = 'Члены комиссии'", КодЯзыка));
	ЗаголовокРазделаКомиссии.Вставить("Проверяющий",          НСтр("ru = 'Указанные в настоящей описи данные и расчеты проверил'", КодЯзыка));
	
	// запрос для реквизитов шапки 
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИнвентаризацияОС.Дата КАК Дата,
	|	ИнвентаризацияОС.Номер КАК Номер,
	|	ИнвентаризацияОС.Организация КАК Организация,
	|	ИнвентаризацияОС.СтруктурноеПодразделение,
	|	ИнвентаризацияОС.ПодразделениеОрганизации.Представление КАК ПодразделениеПредставление,
	|	ИнвентаризацияОС.ДатаНачалаИнвентаризации КАК ДатаНачалаИнвентаризации,
	|	ИнвентаризацияОС.ДатаОкончанияИнвентаризации КАК ДатаОкончанияИнвентаризации,
	|	ИнвентаризацияОС.ДокументОснованиеВид КАК ДокументОснованиеВид,
	|	ИнвентаризацияОС.ДокументОснованиеДата КАК ДокументОснованиеДата,
	|	ИнвентаризацияОС.ДокументОснованиеНомер КАК ДокументОснованиеНомер,
	|	ИнвентаризацияОС.ИнвентаризационнаяКомиссия.(
	|		ФизЛицо КАК ФизЛицо,
	|		Председатель КАК Председатель
	|	) КАК ИнвентаризационнаяКомиссия,
	|	ИнвентаризацияОС.Ссылка
	|ИЗ
	|	Документ.ИнвентаризацияОС КАК ИнвентаризацияОС
	|ГДЕ
	|	ИнвентаризацияОС.Ссылка В(&Ссылка)
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	ШапкаДокумента = Запрос.Выполнить().Выбрать();
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИнвентаризацияОСОС.НомерСтроки КАК НомерСтроки,
	|	ИнвентаризацияОСОС.ОсновноеСредство КАК ОсновноеСредство,
	|	ВЫРАЗИТЬ(ИнвентаризацияОСОС.ОсновноеСредство.НаименованиеПолное КАК СТРОКА(1000)) КАК ОсновноеСредствоНаименованиеПолное,
	|	ИнвентаризацияОСОС.ОсновноеСредство.ДатаВыпуска КАК ДатаВыпуска,
	|	ПОДСТРОКА(ИнвентаризацияОСОС.ОсновноеСредство.ЗаводскойНомер, 1, 250) КАК ЗаводскойНомер,
	|	ПОДСТРОКА(ИнвентаризацияОСОС.ОсновноеСредство.НомерПаспорта, 1, 250) КАК НомерПаспорта,
	|	ИнвентаризацияОСОС.СтоимостьПоДаннымУчета КАК СтоимостьПоДаннымУчета,
	|	ИнвентаризацияОСОС.СтоимостьФактическая КАК СтоимостьФактическая,
	|	ВЫБОР
	|		КОГДА ИнвентаризацияОСОС.НаличиеПоДаннымУчета = ИСТИНА
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НаличиеПоДаннымУчета,
	|	ВЫБОР
	|		КОГДА ИнвентаризацияОСОС.НаличиеФактическое = ИСТИНА
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НаличиеФактическое,
	|	ИнвентаризацияОСОС.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ИнвентаризацияОС.ОС КАК ИнвентаризацияОСОС
	|ГДЕ
	|	ИнвентаризацияОСОС.Ссылка В (&Ссылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|ИТОГИ ПО
	|	Ссылка
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	ВыборкаСтрок = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);

	ТабДокумент = Новый ТабличныйДокумент;
	
	// Загрузим настройки пользователя
	ТабДокумент.КлючПараметровПечати = "ИнвентаризацияОС_ИНВ8";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ИнвентаризацияОС.ПФ_MXL_ИНВ8"); 
	
	Макет.КодЯзыка =  КодЯзыка;
	
	// Зададим параметры макета по умолчанию
	ТабДокумент.ПолеСверху              = 10;
	ТабДокумент.ПолеСлева               = 0;
	ТабДокумент.ПолеСнизу               = 0;
	ТабДокумент.ПолеСправа              = 0;
	ТабДокумент.РазмерКолонтитулаСверху = 10;
	ТабДокумент.ОриентацияСтраницы      = ОриентацияСтраницы.Ландшафт;
	
	Пока ШапкаДокумента.Следующий() Цикл
		
		// Получаем области макета для вывода в табличный документ
		Шапка            = Макет.ПолучитьОбласть("Шапка");
		ПодписьМОЛ       = Макет.ПолучитьОбласть("ПодписьМОЛ");
		Приказ           = Макет.ПолучитьОбласть("Приказ");
		ЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
		ИтогиПоСтранице  = Макет.ПолучитьОбласть("ИтогиПоСтранице");
		Итоги   		 = Макет.ПолучитьОбласть("Итоги");
		Комиссия         = Макет.ПолучитьОбласть("Комиссия");	
		Подвал           = Макет.ПолучитьОбласть("Подвал");
		ОборотнаяСторона = Макет.ПолучитьОбласть("ОборотнаяСторона");
		
		ТаблицаИтогов.Очистить();
		
		ТаблицаИнвентаризационнаяКомиссия = ШапкаДокумента.ИнвентаризационнаяКомиссия.Выгрузить();
	
		Если ТабДокумент.ВысотаТаблицы > 0 Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;

		ВыборкаСтрок.Сбросить();
		
		Если ВыборкаСтрок.НайтиСледующий(ШапкаДокумента.Ссылка) Тогда
			ВыборкаСтрокОС = ВыборкаСтрок.Выбрать();
		Иначе
			ТекстСообщения = НСтр(
				"ru = 'Невозможно сформировать печатную форму ""Инв-8"" документа ""%1"",
				|так как табличная часть ""ОС"" в данном документе является пустой.'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ШапкаДокумента.Ссылка);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ШапкаДокумента.Ссылка);
			Продолжить;
		КонецЕсли;

		СтруктурнаяЕдиницаОрганизация = ОбщегоНазначенияБК.ПолучитьСтруктурнуюЕдиницу(ШапкаДокумента.Организация, ШапкаДокумента.СтруктурноеПодразделение);
		СведенияОбОрганизации 		  = ОбщегоНазначенияБКВызовСервера.СведенияОЮрФизЛице(СтруктурнаяЕдиницаОрганизация, ШапкаДокумента.Дата);

		//////////////////////////////////////////////////////////////////////
		// 1-я страница формы
		
		// Выведем шапку документа
		Шапка.Параметры.Заполнить(ШапкаДокумента);
		Шапка.Параметры.ПредставлениеОрганизации = ОбщегоНазначенияБКВызовСервера.ОписаниеОрганизации(СведенияОбОрганизации, "ПолноеНаименование,");
		Шапка.Параметры.ОрганизацияРНН_БИН       = ОбщегоНазначенияБКВызовСервера.ОписаниеОрганизации(СведенияОбОрганизации, "БИН_ИИН,", Ложь, ШапкаДокумента.Дата, "ru");
		Шапка.Параметры.Подразделение     		 = ШапкаДокумента.ПодразделениеПредставление;
		
		Шапка.Параметры.НомерДок = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(ШапкаДокумента.Номер, ШапкаДокумента.Ссылка);
		Шапка.Параметры.ДатаДок  = Формат(ШапкаДокумента.Дата, "Л=" + КодЯзыка + "; ДФ=dd.MM.yyyy") ;
		
		ТабДокумент.Вывести(Шапка);    
		
		НомерСтраницы   = 1;    
		
		ОбластьМакетаНомерСтроки = Макет.ПолучитьОбласть("НомерСтраницы");

		СписокОСДокумента = Новый ТаблицаЗначений;         	
		СписокОСДокумента.Колонки.Добавить("ОсновноеСредство",,"ОсновноеСредство");
		СписокОСДокумента.Колонки.Добавить("НаличиеФактическое",,"НаличиеФактическое");
		СписокОСДокумента.Колонки.Добавить("СтоимостьФактическая",,"СтоимостьФактическая");
		
		Если НЕ ВыборкаСтрокОС = Неопределено Тогда
			
			Пока ВыборкаСтрокОС.Следующий() Цикл
				
				Стр = СписокОСДокумента.Добавить();
				Стр.ОсновноеСредство 	 = ВыборкаСтрокОС.ОсновноеСредство;
				Стр.НаличиеФактическое   = ВыборкаСтрокОС.НаличиеФактическое;
				Стр.СтоимостьФактическая = ВыборкаСтрокОС.СтоимостьФактическая;
				
			КонецЦикла;
			
		КонецЕсли;
		
		ВыборкаСтрокОС.Сбросить();
		
		Если ВыборкаСтрокОС.Количество()<>0 Тогда 
			СписокОС = СписокОСДокумента.ВыгрузитьКолонку("ОсновноеСредство");
			
			Запрос = Новый Запрос();
			Запрос.УстановитьПараметр("ОсновноеСредство", СписокОС);
			Запрос.УстановитьПараметр("Организация",      ШапкаДокумента.Организация);
			Запрос.УстановитьПараметр("Дата",             ШапкаДокумента.Дата);
			
			Запрос.Текст =
			"ВЫБРАТЬ  РАЗЛИЧНЫЕ
			|	МестонахождениеОСБухгалтерскийУчетСрезПоследних.МОЛ КАК МОЛ
			|ИЗ
			|	РегистрСведений.МестонахождениеОСБухгалтерскийУчет.СрезПоследних(&Дата, Организация = &Организация И ОсновноеСредство В (&ОсновноеСредство)) КАК МестонахождениеОСБухгалтерскийУчетСрезПоследних";
			
			Результат = Запрос.Выполнить().Выгрузить();
			СписокМОЛ = Результат.ВыгрузитьКолонку("МОЛ");
						
			// Выведем подписи МОЛов
			ВыводитьПодпись = Истина;
			ДанныеМОЛ = ПроцедурыУправленияПерсоналомВызовСервера.ДанныеФизЛиц(ШапкаДокумента.Организация, СписокМОЛ, ШапкаДокумента.Дата);
			Для Каждого СтрокаМОЛ Из ДанныеМОЛ Цикл
								
				ПодписьМОЛ.Параметры.МОЛ = ?(ВыводитьПодпись, НСтр("ru = 'Материально-ответственное(ые) лицо(а):'", КодЯзыка), "");
				
				ВыводитьПодпись = Ложь;
							
				ПодписьМОЛ.Параметры.Должность          = СтрокаМОЛ.Должность;
				ПодписьМОЛ.Параметры.РасшифровкаПодписи = СтрокаМОЛ.Представление;
				
				ТабДокумент.Вывести(ПодписьМОЛ);
				
			КонецЦикла;
			
			// Затем выведем пустые места для подписей (чтобы в итоге получилось не менее 3-х подписей)
			Если ДанныеМОЛ.Количество() < 3 Тогда
				
				Для Итератор = (ДанныеМОЛ.Количество() + 1) По 3 Цикл
					ПодписьМОЛ.Параметры.МОЛ			    = ?(ВыводитьПодпись, НСтр("ru = 'Материально-ответственное(ые) лицо(а):'", КодЯзыка), "");
					ПодписьМОЛ.Параметры.Должность          = "";
					ПодписьМОЛ.Параметры.РасшифровкаПодписи = "";
					ТабДокумент.Вывести(ПодписьМОЛ);
				КонецЦикла;
			
			КонецЕсли;
			
			// выведем  данные приказа об инвентаризации
			Приказ.Параметры.Заполнить(ШапкаДокумента);
			Приказ.Параметры.ДокументОснованиеДата       = Формат(ШапкаДокумента.ДокументОснованиеДата		, СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1 года'", КодЯзыка), Формат(ШапкаДокумента.ДокументОснованиеДата, "Л=" + КодЯзыка + "; ДФ=дд ММММ гггг")));
			Приказ.Параметры.ДатаНачалаИнвентаризации    = Формат(ШапкаДокумента.ДатаНачалаИнвентаризации	, СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1 года'", КодЯзыка), Формат(ШапкаДокумента.ДокументОснованиеДата, "Л=" + КодЯзыка + "; ДФ=дд ММММ гггг")));
			Приказ.Параметры.ДатаОкончанияИнвентаризации = Формат(ШапкаДокумента.ДатаОкончанияИнвентаризации, СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1 года'", КодЯзыка), Формат(ШапкаДокумента.ДокументОснованиеДата, "Л=" + КодЯзыка + "; ДФ=дд ММММ гггг")));
			Приказ.Параметры.ДатаДок					 = Формат(ШапкаДокумента.Дата						, СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1 года'", КодЯзыка), Формат(ШапкаДокумента.ДокументОснованиеДата, "Л=" + КодЯзыка + "; ДФ=дд ММММ гггг")));
			
			БалансовыеСчета = "";
			
			ТаблицаСчетаУчета = УправлениеВнеоборотнымиАктивамиСервер.ПолучитьСчетаУчетаСпискаОС(ШапкаДокумента.Организация, СписокОС, ШапкаДокумента.Дата);
			
			Для Каждого СтрокаСчет Из ТаблицаСчетаУчета Цикл
				Если БалансовыеСчета = "" Тогда
					БалансовыеСчета = "" + СтрокаСчет.Значение.СчетУчетаБУ;
				Иначе
					Если Найти(БалансовыеСчета, СтрокаСчет.Значение.СчетУчетаБУ) = 0 Тогда 
						БалансовыеСчета = "" + БалансовыеСчета + ", " + СтрокаСчет.Значение.СчетУчетаБУ;
					КонецЕсли;
				КонецЕсли;	
			КонецЦикла;
			Приказ.Параметры.БалансовыеСчета = ?(ЗначениеЗаполнено(БалансовыеСчета), БалансовыеСчета, "_______________");
			
			ТабДокумент.Вывести(Приказ);
			
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			ОборотнаяСторона.Параметры.НомерСтраницы = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Страница %1'", КодЯзыка), НомерСтраницы);
			ТабДокумент.Вывести(ОборотнаяСторона);
						
			// Выведем заголовок таблицы	
			Валюта = ОбщегоНазначенияБКВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета();
			
			ЗаголовокТаблицы.Параметры.Валюта = Валюта;
					
			Если НЕ ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабДокумент, ЗаголовокТаблицы) Тогда
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;	
			
			ТабДокумент.Вывести(ЗаголовокТаблицы);	
			
			ПорядковыйНомерИтогов = 1; // счетчик количества итоговых строк в таблице
			
			НаличиеФактическоеПоСтранице     = 0;
			СтоимостьФактическаяПоСтранице   = 0;
			НаличиеПоДаннымУчетаПоСтранице   = 0;
			СтоимостьПоДаннымУчетаПоСтранице = 0;    
			
			НаличиеФактическоеПоТаблице     = 0;
			СтоимостьФактическаяПоТаблице   = 0;
			НаличиеПоДаннымУчетаПоТаблице   = 0;
			СтоимостьПоДаннымУчетаПоТаблице = 0;
			
			// Выведем строки таблицы
			Пока ВыборкаСтрокОС.Следующий() Цикл
			
				СтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");
				
				// Присвоим имена с номерами строк областям таблицы.
				// Номера потребуются для включения/отключения видимости значений в ячейках.
				СтрокаТаблицы.Области.НаличиеФактическое.Имя     = "НаличиеФактическое" + ВыборкаСтрокОС.НомерСтроки;
				СтрокаТаблицы.Области.СтоимостьФактическая.Имя   = "СтоимостьФактическая" + ВыборкаСтрокОС.НомерСтроки;
				СтрокаТаблицы.Области.НаличиеПоДаннымУчета.Имя   = "НаличиеПоДаннымУчета" + ВыборкаСтрокОС.НомерСтроки;
				СтрокаТаблицы.Области.СтоимостьПоДаннымУчета.Имя = "СтоимостьПоДаннымУчета" + ВыборкаСтрокОС.НомерСтроки;
				
				СтрокаСПодвалом = Новый Массив;
				СтрокаСПодвалом.Добавить(СтрокаТаблицы);
				СтрокаСПодвалом.Добавить(ИтогиПоСтранице);
				
				Если НЕ ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабДокумент, СтрокаСПодвалом) Тогда
					
					ИтогиПоСтранице = Макет.ПолучитьОбласть("ИтогиПоСтранице");
					
					// Присвоим имена с порядковыми номерами итогов областям таблицы.
					// Номера потребуются для включения/отключения видимости значений в ячейках.
					ИтогиПоСтранице.Области.ИтогНаличиеФактическое.Имя     = "ИтогНаличиеФактическое" + ПорядковыйНомерИтогов;
					ИтогиПоСтранице.Области.ИтогСтоимостьФактическая.Имя   = "ИтогСтоимостьФактическая" + ПорядковыйНомерИтогов;
					ИтогиПоСтранице.Области.ИтогНаличиеПоДаннымУчета.Имя   = "ИтогНаличиеПоДаннымУчета" + ПорядковыйНомерИтогов;
					ИтогиПоСтранице.Области.ИтогСтоимостьПоДаннымУчета.Имя = "ИтогСтоимостьПоДаннымУчета" + ПорядковыйНомерИтогов;
					
					// Выведем заголовок итогов по странице
					ИтогиПоСтранице.Параметры.ИтогСтоимостьФактическая   = СтоимостьФактическаяПоСтранице;
					ИтогиПоСтранице.Параметры.ИтогНаличиеФактическое     = НаличиеФактическоеПоСтранице;
					ИтогиПоСтранице.Параметры.ИтогСтоимостьПоДаннымУчета = СтоимостьПоДаннымУчетаПоСтранице;
					ИтогиПоСтранице.Параметры.ИтогНаличиеПоДаннымУчета   = НаличиеПоДаннымУчетаПоСтранице; 
					
					//ТабДокумент.Вывести(ИтогиПоСтранице); 
					
					НаличиеФактическоеПоТаблице 	= НаличиеФактическоеПоТаблице + НаличиеФактическоеПоСтранице; 
					СтоимостьФактическаяПоТаблице 	= СтоимостьФактическаяПоТаблице + СтоимостьФактическаяПоСтранице;
					НаличиеПоДаннымУчетаПоТаблице 	= НаличиеПоДаннымУчетаПоТаблице + НаличиеПоДаннымУчетаПоСтранице;
					СтоимостьПоДаннымУчетаПоТаблице = СтоимостьПоДаннымУчетаПоТаблице + СтоимостьПоДаннымУчетаПоСтранице;
					
					// Добавим значения итогов по странице в таблицу итогов.
					// Они потребуются при включении видимости значений ячеек.
					НоваяСтрока = ТаблицаИтогов.Добавить();
					НоваяСтрока.ПорядковыйНомерИтогов      = ПорядковыйНомерИтогов;
					НоваяСтрока.ИтогНаличиеФактическое     = НаличиеФактическоеПоСтранице;
					НоваяСтрока.ИтогСтоимостьФактическая   = СтоимостьФактическаяПоСтранице;
					НоваяСтрока.ИтогНаличиеПоДаннымУчета   = НаличиеПоДаннымУчетаПоСтранице;
					НоваяСтрока.ИтогСтоимостьПоДаннымУчета = СтоимостьПоДаннымУчетаПоСтранице;
					
					ПорядковыйНомерИтогов = ПорядковыйНомерИтогов + 1;   
					
					НомерСтраницы = НомерСтраницы + 1;
					
					// Выведем разрыв страницы
					ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц(); 
					
					ОбластьМакетаНомерСтроки.Параметры.НомерСтраницы = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Оборотная сторона формы Инв-8
					|Страница %1'", КодЯзыка), НомерСтраницы);
					ТабДокумент.Вывести(ОбластьМакетаНомерСтроки);

					// Выведем заголовок таблицы	
					ТабДокумент.Вывести(ЗаголовокТаблицы);
					
					НаличиеФактическоеПоСтранице     = 0;
					СтоимостьФактическаяПоСтранице   = 0;
					НаличиеПоДаннымУчетаПоСтранице   = 0;
					СтоимостьПоДаннымУчетаПоСтранице = 0;
					
				КонецЕсли;
				
				НаличиеФактическое   = 0;
				НаличиеПоДаннымУчета = 0;
				БалансовыйСчет       = ТаблицаСчетаУчета.Получить(ВыборкаСтрокОС.ОсновноеСредство);
				
				СтрокаТаблицы.Параметры.НомерСтроки 					   = ВыборкаСтрокОС.НомерСтроки;
				СтрокаТаблицы.Параметры.ОсновноеСредствоНаименованиеПолное = ВыборкаСтрокОС.ОсновноеСредство.НаименованиеПолное;
				СтрокаТаблицы.Параметры.ГодВыпуска						   = ВыборкаСтрокОС.ОсновноеСредство.ДатаВыпуска;
				СтрокаТаблицы.Параметры.ЗаводскойНомер					   = СокрЛП(ВыборкаСтрокОС.ЗаводскойНомер);
				СтрокаТаблицы.Параметры.НомерПаспорта					   = ВыборкаСтрокОС.ОсновноеСредство.НомерПаспорта;
				СтрокаТаблицы.Параметры.БалансовыйСчет 					   = ?(БалансовыйСчет <> Неопределено, БалансовыйСчет.СчетУчетаБУ, "");
				
				ДокументПринятияКУчетуБУ = Неопределено;
				ДатаПриобретения 		 = '00010101';
				
				УправлениеВнеоборотнымиАктивамиСервер.ПолучитьДокументБухСостоянияОС(ВыборкаСтрокОС.ОсновноеСредство, ШапкаДокумента.Организация, Перечисления.ВидыСостоянийОС.Поступило, ШапкаДокумента.Дата, ДокументПринятияКУчетуБУ,  ДатаПриобретения);
				
				Если НЕ ЗначениеЗаполнено(ДатаПриобретения) Тогда
					УправлениеВнеоборотнымиАктивамиСервер.ПолучитьДокументБухСостоянияОС(ВыборкаСтрокОС.ОсновноеСредство, ШапкаДокумента.Организация, Перечисления.ВидыСостоянийОС.ПринятоКУчету, ШапкаДокумента.Дата, ДокументПринятияКУчетуБУ,  ДатаПриобретения);	
				КонецЕсли;	
				
				СтрокаТаблицы.Параметры.ДатаПриобретения = ДатаПриобретения;
				
				СтрокаТаблицы.Параметры.ИнвентарныйНомер = УправлениеВнеоборотнымиАктивамиСервер.СведенияОбИнвентарномНомереОСЗ(ВыборкаСтрокОС.ОсновноеСредство, ШапкаДокумента.Организация, ШапкаДокумента.Дата).ИнвентарныйНомер;
				
				Если ВыборкаСтрокОС.НаличиеФактическое  Тогда
					НаличиеФактическое=1;
				КонецЕсли;
				
				СтрокаТаблицы.Параметры.НаличиеФактическое	 = НаличиеФактическое;
				СтрокаТаблицы.Параметры.СтоимостьФактическая = ВыборкаСтрокОС.СтоимостьФактическая;
				
				Если ВыборкаСтрокОС.НаличиеПоДаннымУчета  Тогда
					НаличиеПоДаннымУчета=1;
				КонецЕсли;
				СтрокаТаблицы.Параметры.НаличиеПоДаннымУчета   = НаличиеПоДаннымУчета;
				СтрокаТаблицы.Параметры.СтоимостьПоДаннымУчета = ВыборкаСтрокОС.СтоимостьПоДаннымУчета;
				
				
				ТабДокумент.Вывести(СтрокаТаблицы);
				
				НаличиеФактическоеПоСтранице     = НаличиеФактическоеПоСтранице   + НаличиеФактическое;
				СтоимостьФактическаяПоСтранице   = СтоимостьФактическаяПоСтранице + ВыборкаСтрокОС.СтоимостьФактическая;
				НаличиеПоДаннымУчетаПоСтранице   = НаличиеПоДаннымУчетаПоСтранице + НаличиеПоДаннымУчета;
				СтоимостьПоДаннымУчетаПоСтранице = СтоимостьПоДаннымУчетаПоСтранице + ВыборкаСтрокОС.СтоимостьПоДаннымУчета;   
				
			КонецЦикла;	
			
			НаличиеФактическоеПоТаблице 	= НаличиеФактическоеПоТаблице + НаличиеФактическоеПоСтранице; 
			СтоимостьФактическаяПоТаблице 	= СтоимостьФактическаяПоТаблице + СтоимостьФактическаяПоСтранице;
			НаличиеПоДаннымУчетаПоТаблице 	= НаличиеПоДаннымУчетаПоТаблице + НаличиеПоДаннымУчетаПоСтранице;
            СтоимостьПоДаннымУчетаПоТаблице = СтоимостьПоДаннымУчетаПоТаблице + СтоимостьПоДаннымУчетаПоСтранице;			
			
			ИтогиПоСтранице = Макет.ПолучитьОбласть("ИтогиПоСтранице");    
			
			ИтогиПоТаблице = Макет.ПолучитьОбласть("ИтогиПоТаблице");
			
			// Присвоим имена с порядковыми номерами итогов областям таблицы.
			// Номера потребуются для включения/отключения видимости значений в ячейках.
			ИтогиПоСтранице.Области.ИтогНаличиеФактическое.Имя     = "ИтогНаличиеФактическое" + ПорядковыйНомерИтогов;
			ИтогиПоСтранице.Области.ИтогСтоимостьФактическая.Имя   = "ИтогСтоимостьФактическая" + ПорядковыйНомерИтогов;
			ИтогиПоСтранице.Области.ИтогНаличиеПоДаннымУчета.Имя   = "ИтогНаличиеПоДаннымУчета" + ПорядковыйНомерИтогов;
			ИтогиПоСтранице.Области.ИтогСтоимостьПоДаннымУчета.Имя = "ИтогСтоимостьПоДаннымУчета" + ПорядковыйНомерИтогов;
			
			// Выведем заголовок итогов по странице
			ИтогиПоСтранице.Параметры.ИтогСтоимостьФактическая   = СтоимостьФактическаяПоСтранице;
			ИтогиПоСтранице.Параметры.ИтогНаличиеФактическое     = НаличиеФактическоеПоСтранице;
			ИтогиПоСтранице.Параметры.ИтогСтоимостьПоДаннымУчета = СтоимостьПоДаннымУчетаПоСтранице;
			ИтогиПоСтранице.Параметры.ИтогНаличиеПоДаннымУчета   = НаличиеПоДаннымУчетаПоСтранице;
			
			//ТабДокумент.Вывести(ИтогиПоСтранице);
			
			// Выведем заголовок итогов по таблице
			ИтогиПоТаблице.Параметры.ИтогВсегоСтоимостьФактическая   = СтоимостьФактическаяПоТаблице;
			ИтогиПоТаблице.Параметры.ИтогВсегоНаличиеФактическое     = НаличиеФактическоеПоТаблице;
			ИтогиПоТаблице.Параметры.ИтогВсегоСтоимостьПоДаннымУчета = СтоимостьПоДаннымУчетаПоТаблице;
			ИтогиПоТаблице.Параметры.ИтогВсегоНаличиеПоДаннымУчета   = НаличиеПоДаннымУчетаПоТаблице;
			
			ТабДокумент.Вывести(ИтогиПоТаблице);
			
			// Добавим значения итогов по странице в таблицу итогов.
			// Они потребуются при включении видимости значений ячеек.
			НоваяСтрока = ТаблицаИтогов.Добавить();
			НоваяСтрока.ПорядковыйНомерИтогов      = ПорядковыйНомерИтогов;
			НоваяСтрока.ИтогНаличиеФактическое     = НаличиеФактическоеПоСтранице;
			НоваяСтрока.ИтогСтоимостьФактическая   = СтоимостьФактическаяПоСтранице;
			НоваяСтрока.ИтогНаличиеПоДаннымУчета   = НаличиеПоДаннымУчетаПоСтранице;
			НоваяСтрока.ИтогСтоимостьПоДаннымУчета = СтоимостьПоДаннымУчетаПоСтранице;
			
			ПорядковыйНомерИтогов = ПорядковыйНомерИтогов + 1;
			
			Итоги = Макет.ПолучитьОбласть("Итоги");	
						
			// Присвоим имена с порядковыми номерами итогов областям таблицы.
			// Номера потребуются для включения/отключения видимости значений в ячейках.
			
			// Выведем итоговые строки
			Итоги.Параметры.КоличествоПорядковыхНомеровПрописью = ЧислоПрописью(ВыборкаСтрокОС.Количество(),"L=ru", ",,,м,,,,,0");
			Итоги.Параметры.КоличествоФактическоеПрописью       = ЧислоПрописью(СписокОСДокумента.Итог("НаличиеФактическое"),"L=ru",",,,м,,,,,0");
			
			Итоги.Параметры.СтоимостьФактическаяПрописью        = ОбщегоНазначенияБКВызовСервера.СформироватьСуммуПрописью(СписокОСДокумента.Итог("СтоимостьФактическая"), ОбщегоНазначенияБКВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета());
			Итоги.Параметры.Валюта = Валюта;
			
			Если НЕ ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабДокумент, Итоги) Тогда
				// Выведем разрыв страницы
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			ТабДокумент.Вывести(Итоги);

			// Выведем подпись председателя инвентаризационной комиссии
			ПредседательКомиссии = ТаблицаИнвентаризационнаяКомиссия.Найти(Истина, "Председатель");
			
			Если НЕ (ПредседательКомиссии = Неопределено) Тогда
				
				ДанныеПредседателя = ПроцедурыУправленияПерсоналомВызовСервера.ДанныеФизЛица(ШапкаДокумента.Организация, ПредседательКомиссии.ФизЛицо, ШапкаДокумента.Дата);
					
				Комиссия.Параметры.ЗаголовокРазделаКомиссии = ЗаголовокРазделаКомиссии.ПредседательКомиссии;
				Комиссия.Параметры.Должность                = ДанныеПредседателя.Должность;
				Комиссия.Параметры.РасшифровкаПодписи       = ДанныеПредседателя.Представление;
				
			Иначе
				
				Комиссия.Параметры.ЗаголовокРазделаКомиссии = ЗаголовокРазделаКомиссии.ПредседательКомиссии;
				Комиссия.Параметры.Должность                = "";
				Комиссия.Параметры.РасшифровкаПодписи       = "";
				
			КонецЕсли;
							
			ТабДокумент.Вывести(Комиссия);
			
			// Выведем подписи членов комиссии
			ВыводитьЗаголовок = Истина;
			
			// Сформируем список членов комиссии
			СписокЧленовКомиссии = Новый Массив();
			
			Для Каждого Строка Из ТаблицаИнвентаризационнаяКомиссия Цикл
				Если НЕ Строка.Председатель Тогда
					СписокЧленовКомиссии.Добавить(Строка.ФизЛицо);
				КонецЕсли;
			КонецЦикла;
			
			ДанныеЧленовКомиссии = ПроцедурыУправленияПерсоналомВызовСервера.ДанныеФизЛиц(ШапкаДокумента.Организация, СписокЧленовКомиссии, ШапкаДокумента.Дата);
			
			// Сначала выведем членов комиссии из выборки
			Для Каждого ЧленКомиссии Из ДанныеЧленовКомиссии Цикл
				
				Если НЕ ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабДокумент, Комиссия) Тогда
					
					// Выведем разрыв страницы
					ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
					ВыводитьЗаголовок = Истина; // на новой странице выведем заголовок набора подписей
				
				КонецЕсли;
				
				Комиссия.Параметры.ЗаголовокРазделаКомиссии = ?(ВыводитьЗаголовок, 
				                                               ЗаголовокРазделаКомиссии.ЧленыКомиссии,
															   "");
				Комиссия.Параметры.Должность          = ЧленКомиссии.Должность;
				Комиссия.Параметры.РасшифровкаПодписи = ЧленКомиссии.Представление;
				
				ТабДокумент.Вывести(Комиссия);
				
				ВыводитьЗаголовок = Ложь; // в следующей итерации вывод заголовка не нужен
				
			КонецЦикла;
			
			// Затем выведем пустые места для подписей (чтобы в итоге получилось не менее 3-х
			Если ДанныеЧленовКомиссии.Количество() < 3 Тогда
				
				Если НЕ ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабДокумент, Комиссия) Тогда
					
					// Выведем разрыв страницы
					ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
					ВыводитьЗаголовок = Истина; // на новой странице выведем заголовок набора подписей
				
				КонецЕсли;
				
				Для Итератор = (ДанныеЧленовКомиссии.Количество() + 1) По 3 Цикл
					
					Комиссия.Параметры.ЗаголовокРазделаКомиссии = ?(ВыводитьЗаголовок, 
					                                               ЗаголовокРазделаКомиссии.ЧленыКомиссии,
																   "");
					Комиссия.Параметры.Должность          = "";
					Комиссия.Параметры.РасшифровкаПодписи = "";
					
					ТабДокумент.Вывести(Комиссия);
					
					ВыводитьЗаголовок = Ложь; // в следующей итерации вывод заголовка не нужен
					
				КонецЦикла;
			
			КонецЕсли;
			
			ТабДокумент.Вывести(Подвал);
			
		КонецЕсли;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, ШапкаДокумента.Ссылка);
	
	КонецЦикла;
	
	Возврат ТабДокумент;

КонецФункции // ПечатьИНВ8()
////////////////////////////////FINISH Кибернетика///////////////////////////////////////

Функция ПечатьИНВ16(МассивОбъектов, ОбъектыПечати) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИнвентаризацияОС.Дата КАК Дата,
	|	ИнвентаризацияОС.Номер КАК Номер,
	|	ИнвентаризацияОС.Организация КАК Организация,
	|	ИнвентаризацияОС.СтруктурноеПодразделение,
	|	ИнвентаризацияОС.ПодразделениеОрганизации.Представление КАК ПодразделениеПредставление,
	|	ИнвентаризацияОС.ПодразделениеОрганизации.Код КАК ПодразделениеКод,
	|	ИнвентаризацияОС.ДатаНачалаИнвентаризации КАК ДатаНачалаИнвентаризации,
	|	ИнвентаризацияОС.ДатаОкончанияИнвентаризации КАК ДатаОкончанияИнвентаризации,
	|	ИнвентаризацияОС.ДокументОснованиеВид КАК ДокументОснованиеВид,
	|	ИнвентаризацияОС.ДокументОснованиеДата КАК ДокументОснованиеДата,
	|	ИнвентаризацияОС.ДокументОснованиеНомер КАК ДокументОснованиеНомер,
	|	ИнвентаризацияОС.Ссылка
	|ИЗ
	|	Документ.ИнвентаризацияОС КАК ИнвентаризацияОС
	|ГДЕ
	|	ИнвентаризацияОС.Ссылка В(&Ссылка)
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	ШапкаДокумента = Запрос.Выполнить().Выбрать();
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИнвентаризацияОСОС.НомерСтроки КАК НомерСтроки,
	|	ИнвентаризацияОСОС.ОсновноеСредство КАК ОсновноеСредство,
	|	ВЫРАЗИТЬ(ИнвентаризацияОСОС.ОсновноеСредство.НаименованиеПолное КАК СТРОКА(1000)) КАК ОсновноеСредствоНаименованиеПолное,
	|	ИнвентаризацияОСОС.ОсновноеСредство.ДатаВыпуска КАК ДатаВыпуска,
	|	ВЫРАЗИТЬ(ИнвентаризацияОСОС.ОсновноеСредство.ЗаводскойНомер КАК СТРОКА(1000)) КАК ЗаводскойНомер,
	|	ВЫРАЗИТЬ(ИнвентаризацияОСОС.ОсновноеСредство.НомерПаспорта КАК СТРОКА(1000)) КАК НомерПаспорта,
	|	ИнвентаризацияОСОС.СтоимостьПоДаннымУчета КАК СтоимостьПоДаннымУчета,
	|	ИнвентаризацияОСОС.СтоимостьФактическая КАК СтоимостьФактическая,
	|	ВЫБОР
	|		КОГДА ИнвентаризацияОСОС.НаличиеПоДаннымУчета = ИСТИНА
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НаличиеПоДаннымУчета,
	|	ВЫБОР
	|		КОГДА ИнвентаризацияОСОС.НаличиеФактическое = ИСТИНА
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НаличиеФактическое,
	|	ИнвентаризацияОСОС.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ИнвентаризацияОС.ОС КАК ИнвентаризацияОСОС
	|ГДЕ
	|	ИнвентаризацияОСОС.Ссылка В(&Ссылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|ИТОГИ ПО
	|	Ссылка
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	ВыборкаСтрок = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ИнвентаризацияОС.ПФ_MXL_ИНВ16");
	
	КодЯзыка = Метаданные.Языки.Русский.КодЯзыка;
	Макет.КодЯзыка =  КодЯзыка;
	
	ТабДокумент = Новый ТабличныйДокумент;
	
	// Загрузим настройки пользователя
	ТабДокумент.КлючПараметровПечати = "ИнвентаризацияОС_ИНВ16";
	
	// Зададим параметры макета по умолчанию
	ТабДокумент.ПолеСверху              = 10;
	ТабДокумент.ПолеСлева               = 0;
	ТабДокумент.ПолеСнизу               = 0;
	ТабДокумент.ПолеСправа              = 0;
	ТабДокумент.РазмерКолонтитулаСверху = 10;
	ТабДокумент.ОриентацияСтраницы      = ОриентацияСтраницы.Ландшафт;
	 		
	Пока ШапкаДокумента.Следующий() Цикл

		// Получаем области макета для вывода в табличный документ
		Шапка                     = Макет.ПолучитьОбласть("Шапка");
		СекцияМОЛ                 = Макет.ПолучитьОбласть("СекцияМОЛ");
		СтрокаНадТаблицей         = Макет.ПолучитьОбласть("СтрокаНадТаблицей");
		ЗаголовокТаблицы          = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
		СтрокаТаблицы             = Макет.ПолучитьОбласть("СтрокаТаблицы");
		ПодвалТаблицы             = Макет.ПолучитьОбласть("ПодвалТаблицы"); 
		ПодвалТаблицыИтог         = Макет.ПолучитьОбласть("ПодвалТаблицыИтог");
		ПодписьГлавногоБухгалтера = Макет.ПолучитьОбласть("ПодписьГлавногоБухгалтера");
		ШапкаПодписейМОЛ          = Макет.ПолучитьОбласть("ШапкаПодписейМОЛ");
		Подпись                   = Макет.ПолучитьОбласть("ПодписьМОЛ");
		
		Если ТабДокумент.ВысотаТаблицы > 0 Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;

		ВыборкаСтрок.Сбросить();
		
		Если ВыборкаСтрок.НайтиСледующий(ШапкаДокумента.Ссылка) Тогда
			ВыборкаСтрокОС = ВыборкаСтрок.Выбрать();
		Иначе
			ТекстСообщения = НСтр(
				"ru = 'Невозможно сформировать печатную форму ""Инв-16"" документа ""%1"",
				|так как табличная часть ""ОС"" в данном документе является пустой.'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ШапкаДокумента.Ссылка);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ШапкаДокумента.Ссылка);
			Продолжить;			
		КонецЕсли;

		СтруктурнаяЕдиницаОрганизация = ОбщегоНазначенияБК.ПолучитьСтруктурнуюЕдиницу(ШапкаДокумента.Организация, ШапкаДокумента.СтруктурноеПодразделение);

		// Выведем шапку документа
		СведенияОбОрганизации = ОбщегоНазначенияБКВызовСервера.СведенияОЮрФизЛице(СтруктурнаяЕдиницаОрганизация, ШапкаДокумента.Дата);
		
		Шапка.Параметры.Заполнить(ШапкаДокумента);
		Шапка.Параметры.ПредставлениеОрганизации = ОбщегоНазначенияБКВызовСервера.ОписаниеОрганизации(СведенияОбОрганизации, "ПолноеНаименование,");
		Шапка.Параметры.ОрганизацияРНН_БИН       = ОбщегоНазначенияБКВызовСервера.ОписаниеОрганизации(СведенияОбОрганизации, "БИН_ИИН,", Ложь, ШапкаДокумента.Дата, "ru");
		Шапка.Параметры.ДокументОснованиеДата    = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1 года'", КодЯзыка), Формат(ШапкаДокумента.ДокументОснованиеДата, "Л=" + КодЯзыка + "; ДФ=dd MMMM yyyy")); 
		
		
		Шапка.Параметры.НомерДок = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(ШапкаДокумента.Номер, ШапкаДокумента.Ссылка);
		Шапка.Параметры.ДатаДок  = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1 года'", КодЯзыка), Формат(ШапкаДокумента.Дата, "Л=" + КодЯзыка + "; ДФ=dd.MM.yyyy"));
		
		ТабДокумент.Вывести(Шапка);                                                                                  
		
		НомерСтраницы   = 1;    
		
		ОбластьМакетаНомерСтроки = Макет.ПолучитьОбласть("НомерСтраницы");

	 	СписокОСДокумента = Новый ТаблицаЗначений;         	
		СписокОСДокумента.Колонки.Добавить("ОсновноеСредство",,"ОсновноеСредство");
		СписокОСДокумента.Колонки.Добавить("НаличиеФактическое",,"НаличиеФактическое");
		СписокОСДокумента.Колонки.Добавить("СтоимостьФактическая",,"СтоимостьФактическая");
		
		Если НЕ ВыборкаСтрокОС = Неопределено Тогда
			
			Пока ВыборкаСтрокОС.Следующий() Цикл
				
				Стр = СписокОСДокумента.Добавить();
				Стр.ОсновноеСредство 	 = ВыборкаСтрокОС.ОсновноеСредство;
				Стр.НаличиеФактическое   = ВыборкаСтрокОС.НаличиеФактическое;
				Стр.СтоимостьФактическая = ВыборкаСтрокОС.СтоимостьФактическая;
				
			КонецЦикла;
			
		КонецЕсли;
		
		ВыборкаСтрокОС.Сбросить();
		
		Если ВыборкаСтрокОС.Количество()<>0 Тогда 
			
			// Получим список МОЛ на основании списка ОС
			СписокОС = СписокОСДокумента.ВыгрузитьКолонку("ОсновноеСредство");
			
			Запрос = Новый Запрос();
			Запрос.УстановитьПараметр("ОсновноеСредство", СписокОС);
			Запрос.УстановитьПараметр("Организация",      ШапкаДокумента.Организация);
			Запрос.УстановитьПараметр("Дата",             ШапкаДокумента.Дата);
			
			Запрос.Текст =
			"ВЫБРАТЬ   РАЗЛИЧНЫЕ
			|	МестонахождениеОСБухгалтерскийУчетСрезПоследних.МОЛ КАК МОЛ
			|ИЗ
			|	РегистрСведений.МестонахождениеОСБухгалтерскийУчет.СрезПоследних(&Дата, Организация = &Организация И ОсновноеСредство В (&ОсновноеСредство)) КАК МестонахождениеОСБухгалтерскийУчетСрезПоследних";
			
			Результат = Запрос.Выполнить().Выгрузить();
			СписокМОЛ = Результат.ВыгрузитьКолонку("МОЛ");
			
			// Выведем подписи МОЛов
			ДанныеМОЛ 			 = ПроцедурыУправленияПерсоналомВызовСервера.ДанныеФизЛиц(ШапкаДокумента.Организация, СписокМОЛ, ШапкаДокумента.Дата);
			ВыводитьЗаголовокМОЛ = Истина;
			
			// Сначала выведем МОЛов из выборки
			Для Каждого СтрокаМОЛ Из ДанныеМОЛ Цикл
				
				Если НЕ ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабДокумент, СекцияМОЛ) Тогда
					// Выведем разрыв страницы
					ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				КонецЕсли;
				
				СекцияМОЛ.Параметры.Должность 		   = СтрокаМОЛ.Должность;
				СекцияМОЛ.Параметры.РасшифровкаПодписи = СтрокаМОЛ.Представление;
				
				//СекцияМОЛ.Параметры.ЗаголовокМОЛ = ?(ВыводитьЗаголовокМОЛ, НСтр("ru = 'находящихся на ответственном хранении'"), "" );
				ВыводитьЗаголовокМОЛ = Ложь;
				
				ТабДокумент.Вывести(СекцияМОЛ);
				
			КонецЦикла;
			
			// Проверим, помещаются ли строка над таблицей, заголовок и первая строка.
			ШапкаТаблицы = Новый Массив;
			ШапкаТаблицы.Добавить(СтрокаНадТаблицей);
			ШапкаТаблицы.Добавить(ЗаголовокТаблицы);
			ШапкаТаблицы.Добавить(СтрокаТаблицы);
			
			Если НЕ ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабДокумент, ШапкаТаблицы) Тогда
				// Выведем разрыв страницы
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			СтрокаНадТаблицей.Параметры.НомерСтраницы = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Оборотная сторона формы Инв-16
			|Страница %1'", КодЯзыка), НомерСтраницы);
			
			СтрокаНадТаблицей.Параметры.ДатаНачалаИнвентаризации    = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1 года'", КодЯзыка), Формат(ШапкаДокумента.ДатаНачалаИнвентаризации   , "Л=" + КодЯзыка + "; ДФ=dd MMMM yyyy"));
			СтрокаНадТаблицей.Параметры.ДатаОкончанияИнвентаризации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1 года'", КодЯзыка), Формат(ШапкаДокумента.ДатаОкончанияИнвентаризации, "Л=" + КодЯзыка + "; ДФ=dd MMMM yyyy"));
			
			// Выведем строку над таблицей
			ТабДокумент.Вывести(СтрокаНадТаблицей);
			
			// Выведем заголовок таблицы
			ЗаголовокТаблицы.Параметры.Валюта = ОбщегоНазначенияБКВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета();
			ТабДокумент.Вывести(ЗаголовокТаблицы);
			
			// Создадим переменные для накопления итогов по каждой странице
			ИтогИзлишекКоличество   = 0;
			ИтогИзлишекСтоимость    = 0;
			ИтогНедостачаКоличество = 0;
			ИтогНедостачаСтоимость  = 0;   
			
			ИтогИзлишекКоличествоПоТаблице   = 0;
			ИтогИзлишекСтоимостьПоТаблице    = 0;
			ИтогНедостачаКоличествоПоТаблице = 0;
			ИтогНедостачаСтоимостьПоТаблице  = 0;	
					
			// Выведем строки таблицы
			Пока ВыборкаСтрокОС.Следующий() Цикл
				
				СтрокаСПодвалом = Новый Массив;
				СтрокаСПодвалом.Добавить(СтрокаТаблицы);
				СтрокаСПодвалом.Добавить(ПодвалТаблицы);
				Если (ВыборкаСтрокОС.НомерСтроки = ВыборкаСтрокОС.Количество()) Тогда // если последняя строка, должна
					СтрокаСПодвалом.Добавить(ПодписьГлавногоБухгалтера);             // помещаться и подпись гл.бухгалтера
				КонецЕсли;
				
				Если НЕ ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабДокумент, СтрокаСПодвалом) Тогда
					
					// Выведем подвал таблицы
					ПодвалТаблицы.Параметры.ИтогИзлишекКоличество   = ИтогИзлишекКоличество;
					ПодвалТаблицы.Параметры.ИтогИзлишекСтоимость    = ИтогИзлишекСтоимость;
					ПодвалТаблицы.Параметры.ИтогНедостачаКоличество = ИтогНедостачаКоличество;
					ПодвалТаблицы.Параметры.ИтогНедостачаСтоимость  = ИтогНедостачаСтоимость;
					
					//ТабДокумент.Вывести(ПодвалТаблицы); 
					
					ИтогИзлишекКоличествоПоТаблице 	 = ИтогИзлишекКоличествоПоТаблице + ИтогИзлишекКоличество; 
					ИтогИзлишекСтоимостьПоТаблице 	 = ИтогИзлишекСтоимостьПоТаблице + ИтогИзлишекСтоимость;
					ИтогНедостачаКоличествоПоТаблице = ИтогНедостачаКоличествоПоТаблице + ИтогНедостачаКоличество;
					ИтогНедостачаСтоимостьПоТаблице  = ИтогНедостачаСтоимостьПоТаблице + ИтогНедостачаСтоимость;
					
					// Обнулим переменные для накопления итогов по каждой странице
					ИтогИзлишекКоличество   = 0;
					ИтогИзлишекСтоимость    = 0;
					ИтогНедостачаКоличество = 0;
					ИтогНедостачаСтоимость  = 0;    
					
					НомерСтраницы = НомерСтраницы + 1;
					
					// Выведем разрыв страницы
					ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц(); 
					
					ОбластьМакетаНомерСтроки.Параметры.НомерСтраницы = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Оборотная сторона формы Инв-16
					|Страница %1'", КодЯзыка), НомерСтраницы);
					ТабДокумент.Вывести(ОбластьМакетаНомерСтроки);
					
					// Выведем заголовок таблицы	
					ТабДокумент.Вывести(ЗаголовокТаблицы);
					
				КонецЕсли;
				
				РазницаПоНаличию   = ВыборкаСтрокОС.НаличиеФактическое - ВыборкаСтрокОС.НаличиеПоДаннымУчета;
				РазницаПоСтоимости = ВыборкаСтрокОС.СтоимостьФактическая - ВыборкаСтрокОС.СтоимостьПоДаннымУчета;
			
				Если (РазницаПоНаличию = 0) И (РазницаПоСтоимости = 0) Тогда
					Продолжить;	
				КонецЕсли;	
				
				СтрокаТаблицы.Параметры.Заполнить(ВыборкаСтрокОС);
				СтрокаТаблицы.Параметры.ИнвентарныйНомер = УправлениеВнеоборотнымиАктивамиСервер.СведенияОбИнвентарномНомереОСЗ(ВыборкаСтрокОС.ОсновноеСредство, ШапкаДокумента.Организация, ШапкаДокумента.Дата).ИнвентарныйНомер;
				СтрокаТаблицы.Параметры.ГодВыпуска		 = ВыборкаСтрокОС.ОсновноеСредство.ДатаВыпуска;
				
				ДокументПринятияКУчетуБУ = Неопределено;
				ДатаПриобретения 		 = '00010101';
				
				УправлениеВнеоборотнымиАктивамиСервер.ПолучитьДокументБухСостоянияОС(ВыборкаСтрокОС.ОсновноеСредство, ШапкаДокумента.Организация, Перечисления.ВидыСостоянийОС.Поступило, ШапкаДокумента.Дата, ДокументПринятияКУчетуБУ,  ДатаПриобретения);
				
				Если НЕ ЗначениеЗаполнено(ДатаПриобретения) Тогда
					УправлениеВнеоборотнымиАктивамиСервер.ПолучитьДокументБухСостоянияОС(ВыборкаСтрокОС.ОсновноеСредство, ШапкаДокумента.Организация, Перечисления.ВидыСостоянийОС.ПринятоКУчету, ШапкаДокумента.Дата, ДокументПринятияКУчетуБУ,  ДатаПриобретения);	
				КонецЕсли;	
				
				СтрокаТаблицы.Параметры.ДатаПриобретения = ДатаПриобретения;
				
				ИзлишекКоличество   = ?(РазницаПоНаличию > 0,   РазницаПоНаличию, 0);
				ИзлишекСтоимость    = ?(РазницаПоСтоимости > 0, РазницаПоСтоимости, 0);
				НедостачаКоличество = ?(РазницаПоНаличию < 0,  -РазницаПоНаличию, 0);
				НедостачаСтоимость  = ?(РазницаПоСтоимости < 0,-РазницаПоСтоимости, 0);
				
				ИтогИзлишекКоличество   = ИтогИзлишекКоличество + ИзлишекКоличество;
				ИтогИзлишекСтоимость    = ИтогИзлишекСтоимость  + ИзлишекСтоимость;
				ИтогНедостачаКоличество = ИтогНедостачаКоличество + НедостачаКоличество;
				ИтогНедостачаСтоимость  = ИтогНедостачаСтоимость  + НедостачаСтоимость;
				
				СтрокаТаблицы.Параметры.ИзлишекКоличество   = ИзлишекКоличество;
				СтрокаТаблицы.Параметры.ИзлишекСтоимость    = ИзлишекСтоимость;
				СтрокаТаблицы.Параметры.НедостачаКоличество = НедостачаКоличество;
				СтрокаТаблицы.Параметры.НедостачаСтоимость  = НедостачаСтоимость;
				
				ТабДокумент.Вывести(СтрокаТаблицы);
				
			КонецЦикла; 
			
			ИтогИзлишекКоличествоПоТаблице 	 = ИтогИзлишекКоличествоПоТаблице   + ИтогИзлишекКоличество; 
			ИтогИзлишекСтоимостьПоТаблице 	 = ИтогИзлишекСтоимостьПоТаблице    + ИтогИзлишекСтоимость;
			ИтогНедостачаКоличествоПоТаблице = ИтогНедостачаКоличествоПоТаблице + ИтогНедостачаКоличество;
			ИтогНедостачаСтоимостьПоТаблице  = ИтогНедостачаСтоимостьПоТаблице  + ИтогНедостачаСтоимость;	
			
			// Выведем подвал таблицы
			ПодвалТаблицы.Параметры.ИтогИзлишекКоличество   = ИтогИзлишекКоличество;
			ПодвалТаблицы.Параметры.ИтогИзлишекСтоимость    = ИтогИзлишекСтоимость;
			ПодвалТаблицы.Параметры.ИтогНедостачаКоличество = ИтогНедостачаКоличество;
			ПодвалТаблицы.Параметры.ИтогНедостачаСтоимость  = ИтогНедостачаСтоимость; 
			
			ПодвалТаблицыИтог.Параметры.ИтогВсегоИзлишекКоличество   = ИтогИзлишекКоличествоПоТаблице;
			ПодвалТаблицыИтог.Параметры.ИтогВсегоИзлишекСтоимость    = ИтогИзлишекСтоимостьПоТаблице;
			ПодвалТаблицыИтог.Параметры.ИтогВсегоНедостачаКоличество = ИтогНедостачаКоличествоПоТаблице;
			ПодвалТаблицыИтог.Параметры.ИтогВсегоНедостачаСтоимость  = ИтогНедостачаСтоимостьПоТаблице;
			
			//ТабДокумент.Вывести(ПодвалТаблицы);  		
			ТабДокумент.Вывести(ПодвалТаблицыИтог);
			
			// Выведем подпись бухгалтера
			Руководители = ОбщегоНазначенияБКВызовСервера.ОтветственныеЛицаОрганизаций(СтруктурнаяЕдиницаОрганизация, ШапкаДокумента.Дата);
			
			ПодписьГлавногоБухгалтера.Параметры.РасшифровкаПодписи = Руководители.ГлавныйБухгалтер;
			
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
			ТабДокумент.Вывести(ПодписьГлавногоБухгалтера);
			
			// Проверим, помещаются ли шапка подписей и одна подпись
			Подписи = Новый Массив;
			Подписи.Добавить(ШапкаПодписейМОЛ);
			Подписи.Добавить(Подпись);
						
			Если НЕ ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабДокумент, Подписи) Тогда
					
				// Выведем разрыв страницы
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
			КонецЕсли;
			
			// Выведем шапку подписей МОЛ
			ТабДокумент.Вывести(ШапкаПодписейМОЛ);
			
			// Выведем подписи МОЛов
			ЗаголовокРазделаПодписей = НСтр("ru = 'Материально-ответственное(-ые) лицо(-а)'", КодЯзыка);
			ВыводитьЗаголовок = Истина;
			
			// Сначала выведем МОЛов из выборки
			Для Каждого СтрокаМОЛ Из ДанныеМОЛ Цикл
				
				Если НЕ ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабДокумент, Подпись) Тогда
					
					// Выведем разрыв страницы
					ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
					ВыводитьЗаголовок = Истина; // на новой странице выведем заголовок набора подписей
				
				КонецЕсли;
				
				Подпись.Параметры.ЗаголовокРазделаПодписей = ?(ВыводитьЗаголовок, 
				                                               ЗаголовокРазделаПодписей,
															   "");
				Подпись.Параметры.Должность                = СтрокаМОЛ.Должность;
				Подпись.Параметры.РасшифровкаПодписи       = СтрокаМОЛ.Представление;
				
				ТабДокумент.Вывести(Подпись);
				
				ВыводитьЗаголовок = Ложь; // в следующей итерации вывод заголовка не нужен
				
			КонецЦикла;
			
			// Затем выведем пустые места для подписей (чтобы в итоге получилось не менее 2-х
			Если ДанныеМОЛ.Количество() < 2 Тогда
				
				Если НЕ ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабДокумент, Подпись) Тогда
					
					// Выведем разрыв страницы
					ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
					ВыводитьЗаголовок = Истина; // на новой странице выведем заголовок набора подписей
				
				КонецЕсли;
				
				Для Итератор = (ДанныеМОЛ.Количество() + 1) По 2 Цикл
					
					Подпись.Параметры.ЗаголовокРазделаПодписей = ?(ВыводитьЗаголовок, 
					                                               ЗаголовокРазделаПодписей,
																   "");
					Подпись.Параметры.Должность                = "";
					Подпись.Параметры.РасшифровкаПодписи       = "";
					
					ТабДокумент.Вывести(Подпись);
					
					ВыводитьЗаголовок = Ложь; // в следующей итерации вывод заголовка не нужен
					
				КонецЦикла;
			
			КонецЕсли;
			
		КонецЕсли;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, ШапкаДокумента.Ссылка);
	
	КонецЦикла;
	   	
	Возврат ТабДокумент;
	
КонецФункции // ПечатьИНВ16()

////////////////////////////////START Кибернетика//////////////////////////////////////// 
// Автор: Пономарев Д.А.
// Дата: 02.12.2024
//
// Описание: Инв-8.2 (Инвентаризационная опись)
Функция ПечатьИНВ8_2(МассивОбъектов, ОбъектыПечати) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
		
	// Создаем колонки Таблицы итогов
	ТаблицаИтогов = Новый ТаблицаЗначений();
	ТаблицаИтогов.Колонки.Добавить("ПорядковыйНомерИтогов");
	ТаблицаИтогов.Колонки.Добавить("ИтогНаличиеФактическое");
	ТаблицаИтогов.Колонки.Добавить("ИтогСтоимостьФактическая");
	ТаблицаИтогов.Колонки.Добавить("ИтогНаличиеПоДаннымУчета");
	ТаблицаИтогов.Колонки.Добавить("ИтогСтоимостьПоДаннымУчета");
	
	// Варианты заголовков разделов с подписями печатной формы	
	ЗаголовокРазделаКомиссии = Новый Структура();
	ЗаголовокРазделаКомиссии.Вставить("МОЛ",                  НСтр("ru = 'Лицо(а), ответственное(ые) за сохранность основных средств:'"));
	ЗаголовокРазделаКомиссии.Вставить("ПредседательКомиссии", НСтр("ru = 'Председатель комиссии'"));
	ЗаголовокРазделаКомиссии.Вставить("ЧленыКомиссии",        НСтр("ru = 'Члены комиссии'"));
	ЗаголовокРазделаКомиссии.Вставить("Проверяющий",          НСтр("ru = 'Указанные в настоящей описи данные и расчеты проверил'"));
	
	// запрос для реквизитов шапки 
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИнвентаризацияОС.Дата КАК Дата,
	|	ИнвентаризацияОС.Номер КАК Номер,
	|	ИнвентаризацияОС.Организация КАК Организация,
	|	ИнвентаризацияОС.СтруктурноеПодразделение,
	|	ИнвентаризацияОС.ПодразделениеОрганизации.Представление КАК ПодразделениеПредставление,
	|	ИнвентаризацияОС.ДатаНачалаИнвентаризации КАК ДатаНачалаИнвентаризации,
	|	ИнвентаризацияОС.ДатаОкончанияИнвентаризации КАК ДатаОкончанияИнвентаризации,
	|	ИнвентаризацияОС.ДокументОснованиеВид КАК ДокументОснованиеВид,
	|	ИнвентаризацияОС.ДокументОснованиеДата КАК ДокументОснованиеДата,
	|	ИнвентаризацияОС.ДокументОснованиеНомер КАК ДокументОснованиеНомер,
	|	ИнвентаризацияОС.ИнвентаризационнаяКомиссия.(
	|		ФизЛицо КАК ФизЛицо,
	|		Председатель КАК Председатель
	|	) КАК ИнвентаризационнаяКомиссия,
	|	ИнвентаризацияОС.Ссылка
	|ИЗ
	|	Документ.ИнвентаризацияОС КАК ИнвентаризацияОС
	|ГДЕ
	|	ИнвентаризацияОС.Ссылка В(&Ссылка)
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	ШапкаДокумента = Запрос.Выполнить().Выбрать();
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИнвентаризацияОСОС.НомерСтроки КАК НомерСтроки,
	|	ИнвентаризацияОСОС.ОсновноеСредство КАК ОсновноеСредство,
	|	ВЫРАЗИТЬ(ИнвентаризацияОСОС.ОсновноеСредство.НаименованиеПолное КАК СТРОКА(1000)) КАК ОсновноеСредствоНаименованиеПолное,
	|	ИнвентаризацияОСОС.ОсновноеСредство.ДатаВыпуска КАК ДатаВыпуска,
	|	ПОДСТРОКА(ИнвентаризацияОСОС.ОсновноеСредство.ЗаводскойНомер, 1, 250) КАК ЗаводскойНомер,
	|	ПОДСТРОКА(ИнвентаризацияОСОС.ОсновноеСредство.НомерПаспорта, 1, 250) КАК НомерПаспорта,
	|	ИнвентаризацияОСОС.СтоимостьПоДаннымУчета КАК СтоимостьПоДаннымУчета,
	|	ИнвентаризацияОСОС.СтоимостьФактическая КАК СтоимостьФактическая,
	|	ВЫБОР
	|		КОГДА ИнвентаризацияОСОС.НаличиеПоДаннымУчета = ИСТИНА
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НаличиеПоДаннымУчета,
	|	ВЫБОР
	|		КОГДА ИнвентаризацияОСОС.НаличиеФактическое = ИСТИНА
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НаличиеФактическое,
	|	ИнвентаризацияОСОС.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ИнвентаризацияОС.ОС КАК ИнвентаризацияОСОС
	|ГДЕ
	|	ИнвентаризацияОСОС.Ссылка В (&Ссылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|ИТОГИ ПО
	|	Ссылка
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	ВыборкаСтрок = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);

	ТабДокумент = Новый ТабличныйДокумент;
	
	// Загрузим настройки пользователя
	ТабДокумент.КлючПараметровПечати = "ИнвентаризацияОС_ИНВ8";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ИнвентаризацияОС.ПФ_MXL_ИНВ8_2");
	
	// Зададим параметры макета по умолчанию
	ТабДокумент.ПолеСверху              = 10;
	ТабДокумент.ПолеСлева               = 20;
	ТабДокумент.ПолеСнизу               = 0;
	ТабДокумент.ПолеСправа              = 0;
	ТабДокумент.РазмерКолонтитулаСверху = 10;
	ТабДокумент.ОриентацияСтраницы      = ОриентацияСтраницы.Ландшафт;
	
	Пока ШапкаДокумента.Следующий() Цикл
		
		// Получаем области макета для вывода в табличный документ
		Шапка            = Макет.ПолучитьОбласть("Шапка");
		ПодписьМОЛ       = Макет.ПолучитьОбласть("ПодписьМОЛ"); 
		ПодписьМОЛ2      = Макет.ПолучитьОбласть("ПодписьМОЛ2");
		Приказ           = Макет.ПолучитьОбласть("Приказ");
		ЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
		ИтогиПоСтранице  = Макет.ПолучитьОбласть("ИтогиПоСтранице");
		Итоги   		 = Макет.ПолучитьОбласть("Итоги");
		Комиссия         = Макет.ПолучитьОбласть("Комиссия");
		ИНВОпись         = Макет.ПолучитьОбласть("ИНВОпись");
		Подвал           = Макет.ПолучитьОбласть("Подвал");
		ОборотнаяСторона = Макет.ПолучитьОбласть("ОборотнаяСторона");
		
		ТаблицаИтогов.Очистить();
		
		ТаблицаИнвентаризационнаяКомиссия = ШапкаДокумента.ИнвентаризационнаяКомиссия.Выгрузить();
	
		Если ТабДокумент.ВысотаТаблицы > 0 Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;

		ВыборкаСтрок.Сбросить();
		
		Если ВыборкаСтрок.НайтиСледующий(ШапкаДокумента.Ссылка) Тогда
			ВыборкаСтрокОС = ВыборкаСтрок.Выбрать();
		Иначе
			ТекстСообщения = НСтр(
				"ru = 'Невозможно сформировать печатную форму ""Инв-8"" документа ""%1"",
				|так как табличная часть ""ОС"" в данном документе является пустой.'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ШапкаДокумента.Ссылка);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ШапкаДокумента.Ссылка);
			Продолжить;
		КонецЕсли;

		СтруктурнаяЕдиницаОрганизация = ОбщегоНазначенияБК.ПолучитьСтруктурнуюЕдиницу(ШапкаДокумента.Организация, ШапкаДокумента.СтруктурноеПодразделение);
		СведенияОбОрганизации 		  = ОбщегоНазначенияБКВызовСервера.СведенияОЮрФизЛице(СтруктурнаяЕдиницаОрганизация, ШапкаДокумента.Дата);

		//////////////////////////////////////////////////////////////////////
		// 1-я страница формы
		
		// Выведем шапку документа
		Шапка.Параметры.Заполнить(ШапкаДокумента);
		Шапка.Параметры.ПредставлениеОрганизации = ОбщегоНазначенияБКВызовСервера.ОписаниеОрганизации(СведенияОбОрганизации, "ПолноеНаименование,");
		Шапка.Параметры.ОрганизацияРНН_БИН       = ОбщегоНазначенияБКВызовСервера.ОписаниеОрганизации(СведенияОбОрганизации, "БИН_ИИН,", Ложь, ШапкаДокумента.Дата, "ru");
		Шапка.Параметры.Подразделение     		 = ШапкаДокумента.ПодразделениеПредставление;
		
		Шапка.Параметры.НомерДок = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(ШапкаДокумента.Номер, ШапкаДокумента.Ссылка);
		Шапка.Параметры.ДатаДок  = Формат(ШапкаДокумента.Дата, "ДФ=dd.MM.yyyy") ;
		
		ТабДокумент.Вывести(Шапка);    
		
		НомерСтраницы   = 1;    
		
		ОбластьМакетаНомерСтроки = Макет.ПолучитьОбласть("НомерСтраницы");

		СписокОСДокумента = Новый ТаблицаЗначений;         	
		СписокОСДокумента.Колонки.Добавить("ОсновноеСредство",,"ОсновноеСредство");
		СписокОСДокумента.Колонки.Добавить("НаличиеФактическое",,"НаличиеФактическое");
		СписокОСДокумента.Колонки.Добавить("СтоимостьФактическая",,"СтоимостьФактическая");
		
		Если НЕ ВыборкаСтрокОС = Неопределено Тогда
			
			Пока ВыборкаСтрокОС.Следующий() Цикл
				
				Стр = СписокОСДокумента.Добавить();
				Стр.ОсновноеСредство 	 = ВыборкаСтрокОС.ОсновноеСредство;
				Стр.НаличиеФактическое   = ВыборкаСтрокОС.НаличиеФактическое;
				Стр.СтоимостьФактическая = ВыборкаСтрокОС.СтоимостьФактическая;
				
			КонецЦикла;
			
		КонецЕсли;
		
		ВыборкаСтрокОС.Сбросить();
		
		Если ВыборкаСтрокОС.Количество()<>0 Тогда 
			СписокОС = СписокОСДокумента.ВыгрузитьКолонку("ОсновноеСредство");
			
			Запрос = Новый Запрос();
			Запрос.УстановитьПараметр("ОсновноеСредство", СписокОС);
			Запрос.УстановитьПараметр("Организация",      ШапкаДокумента.Организация);
			Запрос.УстановитьПараметр("Дата",             ШапкаДокумента.Дата);
			
			Запрос.Текст =
			"ВЫБРАТЬ  РАЗЛИЧНЫЕ
			|	МестонахождениеОСБухгалтерскийУчетСрезПоследних.МОЛ КАК МОЛ
			|ИЗ
			|	РегистрСведений.МестонахождениеОСБухгалтерскийУчет.СрезПоследних(&Дата, Организация = &Организация И ОсновноеСредство В (&ОсновноеСредство)) КАК МестонахождениеОСБухгалтерскийУчетСрезПоследних";
			
			Результат = Запрос.Выполнить().Выгрузить();
			СписокМОЛ = Результат.ВыгрузитьКолонку("МОЛ");
						
			// Выведем подписи МОЛов
			ВыводитьПодпись = Истина;
			ДанныеМОЛ = ПроцедурыУправленияПерсоналомВызовСервера.ДанныеФизЛиц(ШапкаДокумента.Организация, СписокМОЛ, ШапкаДокумента.Дата);
			Для Каждого СтрокаМОЛ Из ДанныеМОЛ Цикл
								
				ПодписьМОЛ.Параметры.МОЛ = ?(ВыводитьПодпись, НСтр("ru = 'Материально-ответственное(ые) лицо(а):'"), "");
				
				ВыводитьПодпись = Ложь;
							
				ПодписьМОЛ.Параметры.Должность          = СтрокаМОЛ.Должность;
				ПодписьМОЛ.Параметры.РасшифровкаПодписи = СтрокаМОЛ.Представление;
				
				ТабДокумент.Вывести(ПодписьМОЛ);
				
			КонецЦикла;
			
			//----------------------------------------------------------------------// 
	
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	ИнвентаризацияОССолидарныеМол.ФизЛицо КАК ФизЛицо,
				|	РаботникиОрганизацийСрезПоследних.Должность.Представление КАК Должность,
				|	ИнвентаризацияОССолидарныеМол.Ссылка.СолидарноеМолДата КАК СолидарноеМолДата
				|ИЗ
				|	Документ.ИнвентаризацияОС.СолидарныеМол КАК ИнвентаризацияОССолидарныеМол
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаДокумента, ) КАК РаботникиОрганизацийСрезПоследних
				|		ПО ИнвентаризацияОССолидарныеМол.ФизЛицо.Наименование = РаботникиОрганизацийСрезПоследних.Сотрудник.Наименование
				|ГДЕ
				|	ИнвентаризацияОССолидарныеМол.Ссылка = &Ссылка";
			
			Запрос.УстановитьПараметр("ДатаДокумента",  МассивОбъектов[0].Дата);
			Запрос.УстановитьПараметр("Ссылка", 		МассивОбъектов[0]);
	
			РезультатЗапроса = Запрос.Выполнить();
			
			Если НЕ РезультатЗапроса.Пустой() Тогда
				// Выведем подписи МОЛСол 
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				ВыборкаДетальныеЗаписи.Следующий(); 
									
					ПодписьМОЛ2.Параметры.МОЛ = ?(ВыводитьПодпись, НСтр("ru = 'Материально-ответственное(ые) лицо(а):'"), "");
					
					ПодписьМОЛ2.Параметры.СолДолжность          = ВыборкаДетальныеЗаписи.Должность;
					ПодписьМОЛ2.Параметры.СолРасшифровкаПодписи = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Строка(ВыборкаДетальныеЗаписи.ФизЛицо));
					Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.СолидарноеМолДата) Тогда
						ПодписьМОЛ2.Параметры.СодидарноеМолДата     = Формат(ВыборкаДетальныеЗаписи.СолидарноеМолДата, "ДФ=dd.MM.yyyy");  
					КонецЕсли;
					ТабДокумент.Вывести(ПодписьМОЛ2);
					
			КонецЕсли;
            //----------------------------------------------------------------------------//
						
			// выведем  данные приказа об инвентаризации
			Приказ.Параметры.Заполнить(ШапкаДокумента);
			Приказ.Параметры.ДокументОснованиеДата       = Формат(ШапкаДокумента.ДокументОснованиеДата		, "ДФ=""дд ММММ гггг 'года.'""");
			Приказ.Параметры.ДатаНачалаИнвентаризации    = Формат(ШапкаДокумента.ДатаНачалаИнвентаризации	, "ДФ=""дд ММММ гггг 'года.'""");
			Приказ.Параметры.ДатаОкончанияИнвентаризации = Формат(ШапкаДокумента.ДатаОкончанияИнвентаризации, "ДФ=""дд ММММ гггг 'года.'""");
			Приказ.Параметры.ДатаДок					 = Формат(ШапкаДокумента.Дата						, "ДФ=""дд ММММ гггг 'года.'""");
			
			БалансовыеСчета = "";
			
			ТаблицаСчетаУчета = УправлениеВнеоборотнымиАктивамиСервер.ПолучитьСчетаУчетаСпискаОС(ШапкаДокумента.Организация, СписокОС, ШапкаДокумента.Дата);
			
			Для Каждого СтрокаСчет Из ТаблицаСчетаУчета Цикл
				Если БалансовыеСчета = "" Тогда
					БалансовыеСчета = "" + СтрокаСчет.Значение.СчетУчетаБУ;
				Иначе
					Если Найти(БалансовыеСчета, СтрокаСчет.Значение.СчетУчетаБУ) = 0 Тогда 
						БалансовыеСчета = "" + БалансовыеСчета + ", " + СтрокаСчет.Значение.СчетУчетаБУ;
					КонецЕсли;
				КонецЕсли;	
			КонецЦикла;
			Приказ.Параметры.БалансовыеСчета = ?(ЗначениеЗаполнено(БалансовыеСчета), БалансовыеСчета, "_______________");
			
			ТабДокумент.Вывести(Приказ);
			
			//ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			ОборотнаяСторона.Параметры.НомерСтраницы = "Страница " + НомерСтраницы;
			ТабДокумент.Вывести(ОборотнаяСторона);
						
			// Выведем заголовок таблицы	
			Валюта = ОбщегоНазначенияБКВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета();
			
			ЗаголовокТаблицы.Параметры.Валюта = Валюта;
					
			Если НЕ ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабДокумент, ЗаголовокТаблицы) Тогда
			//	ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;	
			
			ТабДокумент.Вывести(ЗаголовокТаблицы);	
			
			ПорядковыйНомерИтогов = 1; // счетчик количества итоговых строк в таблице
			
			НаличиеФактическоеПоСтранице     = 0;
			СтоимостьФактическаяПоСтранице   = 0;
			НаличиеПоДаннымУчетаПоСтранице   = 0;
			СтоимостьПоДаннымУчетаПоСтранице = 0;    
			
			НаличиеФактическоеПоТаблице     = 0;
			СтоимостьФактическаяПоТаблице   = 0;
			НаличиеПоДаннымУчетаПоТаблице   = 0;
			СтоимостьПоДаннымУчетаПоТаблице = 0;
			
			// Выведем строки таблицы
			Пока ВыборкаСтрокОС.Следующий() Цикл
			
				СтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");
				
				// Присвоим имена с номерами строк областям таблицы.
				// Номера потребуются для включения/отключения видимости значений в ячейках.
				СтрокаТаблицы.Области.НаличиеФактическое.Имя     = "НаличиеФактическое" + ВыборкаСтрокОС.НомерСтроки;
				СтрокаТаблицы.Области.СтоимостьФактическая.Имя   = "СтоимостьФактическая" + ВыборкаСтрокОС.НомерСтроки;
				СтрокаТаблицы.Области.НаличиеПоДаннымУчета.Имя   = "НаличиеПоДаннымУчета" + ВыборкаСтрокОС.НомерСтроки;
				СтрокаТаблицы.Области.СтоимостьПоДаннымУчета.Имя = "СтоимостьПоДаннымУчета" + ВыборкаСтрокОС.НомерСтроки;
				
				СтрокаСПодвалом = Новый Массив;
				СтрокаСПодвалом.Добавить(СтрокаТаблицы);
				СтрокаСПодвалом.Добавить(ИтогиПоСтранице);
				
				Если НЕ ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабДокумент, СтрокаСПодвалом) Тогда
					
					ИтогиПоСтранице = Макет.ПолучитьОбласть("ИтогиПоСтранице");
					
					// Присвоим имена с порядковыми номерами итогов областям таблицы.
					// Номера потребуются для включения/отключения видимости значений в ячейках.
					ИтогиПоСтранице.Области.ИтогНаличиеФактическое.Имя     = "ИтогНаличиеФактическое" + ПорядковыйНомерИтогов;
					ИтогиПоСтранице.Области.ИтогСтоимостьФактическая.Имя   = "ИтогСтоимостьФактическая" + ПорядковыйНомерИтогов;
					ИтогиПоСтранице.Области.ИтогНаличиеПоДаннымУчета.Имя   = "ИтогНаличиеПоДаннымУчета" + ПорядковыйНомерИтогов;
					ИтогиПоСтранице.Области.ИтогСтоимостьПоДаннымУчета.Имя = "ИтогСтоимостьПоДаннымУчета" + ПорядковыйНомерИтогов;
					
					// Выведем заголовок итогов по странице
					ИтогиПоСтранице.Параметры.ИтогСтоимостьФактическая   = СтоимостьФактическаяПоСтранице;
					ИтогиПоСтранице.Параметры.ИтогНаличиеФактическое     = НаличиеФактическоеПоСтранице;
					ИтогиПоСтранице.Параметры.ИтогСтоимостьПоДаннымУчета = СтоимостьПоДаннымУчетаПоСтранице;
					ИтогиПоСтранице.Параметры.ИтогНаличиеПоДаннымУчета   = НаличиеПоДаннымУчетаПоСтранице; 
					
					//ТабДокумент.Вывести(ИтогиПоСтранице); 
					
					НаличиеФактическоеПоТаблице 	= НаличиеФактическоеПоТаблице + НаличиеФактическоеПоСтранице; 
					СтоимостьФактическаяПоТаблице 	= СтоимостьФактическаяПоТаблице + СтоимостьФактическаяПоСтранице;
					НаличиеПоДаннымУчетаПоТаблице 	= НаличиеПоДаннымУчетаПоТаблице + НаличиеПоДаннымУчетаПоСтранице;
					СтоимостьПоДаннымУчетаПоТаблице = СтоимостьПоДаннымУчетаПоТаблице + СтоимостьПоДаннымУчетаПоСтранице;
					
					// Добавим значения итогов по странице в таблицу итогов.
					// Они потребуются при включении видимости значений ячеек.
					НоваяСтрока = ТаблицаИтогов.Добавить();
					НоваяСтрока.ПорядковыйНомерИтогов      = ПорядковыйНомерИтогов;
					НоваяСтрока.ИтогНаличиеФактическое     = НаличиеФактическоеПоСтранице;
					НоваяСтрока.ИтогСтоимостьФактическая   = СтоимостьФактическаяПоСтранице;
					НоваяСтрока.ИтогНаличиеПоДаннымУчета   = НаличиеПоДаннымУчетаПоСтранице;
					НоваяСтрока.ИтогСтоимостьПоДаннымУчета = СтоимостьПоДаннымУчетаПоСтранице;
					
					ПорядковыйНомерИтогов = ПорядковыйНомерИтогов + 1;   
					
					НомерСтраницы = НомерСтраницы + 1;
					
					// Выведем разрыв страницы
					ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц(); 
					
					
					//тест
					ОбластьМакетаНомерСтроки.Параметры.НомерСтраницы =  "Оборотная сторона формы Инв-8" + Символы.ПС + "Страница " + НомерСтраницы;
					ТабДокумент.Вывести(ОбластьМакетаНомерСтроки);

					// Выведем заголовок таблицы	
					ТабДокумент.Вывести(ЗаголовокТаблицы);
					
					НаличиеФактическоеПоСтранице     = 0;
					СтоимостьФактическаяПоСтранице   = 0;
					НаличиеПоДаннымУчетаПоСтранице   = 0;
					СтоимостьПоДаннымУчетаПоСтранице = 0;
					
				КонецЕсли;
				
				НаличиеФактическое   = 0;
				НаличиеПоДаннымУчета = 0;
				БалансовыйСчет       = ТаблицаСчетаУчета.Получить(ВыборкаСтрокОС.ОсновноеСредство);
				
				СтрокаТаблицы.Параметры.НомерСтроки 					   = ВыборкаСтрокОС.НомерСтроки;
				СтрокаТаблицы.Параметры.ОсновноеСредствоНаименованиеПолное = ВыборкаСтрокОС.ОсновноеСредство.НаименованиеПолное;
				СтрокаТаблицы.Параметры.ГодВыпуска						   = ВыборкаСтрокОС.ОсновноеСредство.ДатаВыпуска;
				СтрокаТаблицы.Параметры.ЗаводскойНомер					   = СокрЛП(ВыборкаСтрокОС.ЗаводскойНомер);
				СтрокаТаблицы.Параметры.НомерПаспорта					   = ВыборкаСтрокОС.ОсновноеСредство.НомерПаспорта;
				СтрокаТаблицы.Параметры.БалансовыйСчет 					   = ?(БалансовыйСчет <> Неопределено, БалансовыйСчет.СчетУчетаБУ, "");
				
				ДокументПринятияКУчетуБУ = Неопределено;
				ДатаПриобретения 		 = '00010101';
				
				УправлениеВнеоборотнымиАктивамиСервер.ПолучитьДокументБухСостоянияОС(ВыборкаСтрокОС.ОсновноеСредство, ШапкаДокумента.Организация, Перечисления.ВидыСостоянийОС.Поступило, ШапкаДокумента.Дата, ДокументПринятияКУчетуБУ,  ДатаПриобретения);
				
				Если НЕ ЗначениеЗаполнено(ДатаПриобретения) Тогда
					УправлениеВнеоборотнымиАктивамиСервер.ПолучитьДокументБухСостоянияОС(ВыборкаСтрокОС.ОсновноеСредство, ШапкаДокумента.Организация, Перечисления.ВидыСостоянийОС.ПринятоКУчету, ШапкаДокумента.Дата, ДокументПринятияКУчетуБУ,  ДатаПриобретения);	
				КонецЕсли;	
				
				СтрокаТаблицы.Параметры.ДатаПриобретения = ДатаПриобретения;
				
				СтрокаТаблицы.Параметры.ИнвентарныйНомер = УправлениеВнеоборотнымиАктивамиСервер.СведенияОбИнвентарномНомереОСЗ(ВыборкаСтрокОС.ОсновноеСредство, ШапкаДокумента.Организация, ШапкаДокумента.Дата).ИнвентарныйНомер;
				
				Если ВыборкаСтрокОС.НаличиеФактическое  Тогда
					НаличиеФактическое=1;
				КонецЕсли;
				
				СтрокаТаблицы.Параметры.НаличиеФактическое	 = НаличиеФактическое;
				СтрокаТаблицы.Параметры.СтоимостьФактическая = ВыборкаСтрокОС.СтоимостьФактическая;
				
				Если ВыборкаСтрокОС.НаличиеПоДаннымУчета  Тогда
					НаличиеПоДаннымУчета=1;
				КонецЕсли;
				СтрокаТаблицы.Параметры.НаличиеПоДаннымУчета   = НаличиеПоДаннымУчета;
				СтрокаТаблицы.Параметры.СтоимостьПоДаннымУчета = ВыборкаСтрокОС.СтоимостьПоДаннымУчета;
				
				
				ТабДокумент.Вывести(СтрокаТаблицы);
				
				НаличиеФактическоеПоСтранице     = НаличиеФактическоеПоСтранице   + НаличиеФактическое;
				СтоимостьФактическаяПоСтранице   = СтоимостьФактическаяПоСтранице + ВыборкаСтрокОС.СтоимостьФактическая;
				НаличиеПоДаннымУчетаПоСтранице   = НаличиеПоДаннымУчетаПоСтранице + НаличиеПоДаннымУчета;
				СтоимостьПоДаннымУчетаПоСтранице = СтоимостьПоДаннымУчетаПоСтранице + ВыборкаСтрокОС.СтоимостьПоДаннымУчета;   
				
			КонецЦикла;	
			
			НаличиеФактическоеПоТаблице 	= НаличиеФактическоеПоТаблице + НаличиеФактическоеПоСтранице; 
			СтоимостьФактическаяПоТаблице 	= СтоимостьФактическаяПоТаблице + СтоимостьФактическаяПоСтранице;
			НаличиеПоДаннымУчетаПоТаблице 	= НаличиеПоДаннымУчетаПоТаблице + НаличиеПоДаннымУчетаПоСтранице;
            СтоимостьПоДаннымУчетаПоТаблице = СтоимостьПоДаннымУчетаПоТаблице + СтоимостьПоДаннымУчетаПоСтранице;			
			
			ИтогиПоСтранице = Макет.ПолучитьОбласть("ИтогиПоСтранице");    
			
			ИтогиПоТаблице = Макет.ПолучитьОбласть("ИтогиПоТаблице");
			
			// Присвоим имена с порядковыми номерами итогов областям таблицы.
			// Номера потребуются для включения/отключения видимости значений в ячейках.
			ИтогиПоСтранице.Области.ИтогНаличиеФактическое.Имя     = "ИтогНаличиеФактическое" + ПорядковыйНомерИтогов;
			ИтогиПоСтранице.Области.ИтогСтоимостьФактическая.Имя   = "ИтогСтоимостьФактическая" + ПорядковыйНомерИтогов;
			ИтогиПоСтранице.Области.ИтогНаличиеПоДаннымУчета.Имя   = "ИтогНаличиеПоДаннымУчета" + ПорядковыйНомерИтогов;
			ИтогиПоСтранице.Области.ИтогСтоимостьПоДаннымУчета.Имя = "ИтогСтоимостьПоДаннымУчета" + ПорядковыйНомерИтогов;
			
			// Выведем заголовок итогов по странице
			ИтогиПоСтранице.Параметры.ИтогСтоимостьФактическая   = СтоимостьФактическаяПоСтранице;
			ИтогиПоСтранице.Параметры.ИтогНаличиеФактическое     = НаличиеФактическоеПоСтранице;
			ИтогиПоСтранице.Параметры.ИтогСтоимостьПоДаннымУчета = СтоимостьПоДаннымУчетаПоСтранице;
			ИтогиПоСтранице.Параметры.ИтогНаличиеПоДаннымУчета   = НаличиеПоДаннымУчетаПоСтранице;
			
			//ТабДокумент.Вывести(ИтогиПоСтранице);
			
			// Выведем заголовок итогов по таблице
			ИтогиПоТаблице.Параметры.ИтогВсегоСтоимостьФактическая   = СтоимостьФактическаяПоТаблице;
			ИтогиПоТаблице.Параметры.ИтогВсегоНаличиеФактическое     = НаличиеФактическоеПоТаблице;
			ИтогиПоТаблице.Параметры.ИтогВсегоСтоимостьПоДаннымУчета = СтоимостьПоДаннымУчетаПоТаблице;
			ИтогиПоТаблице.Параметры.ИтогВсегоНаличиеПоДаннымУчета   = НаличиеПоДаннымУчетаПоТаблице;
			
			ТабДокумент.Вывести(ИтогиПоТаблице);
			
			// Добавим значения итогов по странице в таблицу итогов.
			// Они потребуются при включении видимости значений ячеек.
			НоваяСтрока = ТаблицаИтогов.Добавить();
			НоваяСтрока.ПорядковыйНомерИтогов      = ПорядковыйНомерИтогов;
			НоваяСтрока.ИтогНаличиеФактическое     = НаличиеФактическоеПоСтранице;
			НоваяСтрока.ИтогСтоимостьФактическая   = СтоимостьФактическаяПоСтранице;
			НоваяСтрока.ИтогНаличиеПоДаннымУчета   = НаличиеПоДаннымУчетаПоСтранице;
			НоваяСтрока.ИтогСтоимостьПоДаннымУчета = СтоимостьПоДаннымУчетаПоСтранице;
			
			ПорядковыйНомерИтогов = ПорядковыйНомерИтогов + 1;
			
			Итоги = Макет.ПолучитьОбласть("Итоги");	
						
			// Присвоим имена с порядковыми номерами итогов областям таблицы.
			// Номера потребуются для включения/отключения видимости значений в ячейках.
			
			// Выведем итоговые строки
			Итоги.Параметры.КоличествоПорядковыхНомеровПрописью = ЧислоПрописью(ВыборкаСтрокОС.Количество(),, ",,,м,,,,,0");
			Итоги.Параметры.КоличествоФактическоеПрописью       = ЧислоПрописью(СписокОСДокумента.Итог("НаличиеФактическое"),,",,,м,,,,,0");
			
			Итоги.Параметры.СтоимостьФактическаяПрописью        = ОбщегоНазначенияБКВызовСервера.СформироватьСуммуПрописью(СписокОСДокумента.Итог("СтоимостьФактическая"), ОбщегоНазначенияБКВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета());
			Итоги.Параметры.Валюта = Валюта;
			
			Если НЕ ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабДокумент, Итоги) Тогда
				// Выведем разрыв страницы
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			ТабДокумент.Вывести(Итоги);

			// Выведем подпись председателя инвентаризационной комиссии
			ПредседательКомиссии = ТаблицаИнвентаризационнаяКомиссия.Найти(Истина, "Председатель");
			
			Если НЕ (ПредседательКомиссии = Неопределено) Тогда
				
				ДанныеПредседателя = ПроцедурыУправленияПерсоналомВызовСервера.ДанныеФизЛица(ШапкаДокумента.Организация, ПредседательКомиссии.ФизЛицо, ШапкаДокумента.Дата);
					
				Комиссия.Параметры.ЗаголовокРазделаКомиссии = ЗаголовокРазделаКомиссии.ПредседательКомиссии;
				Комиссия.Параметры.Должность                = ДанныеПредседателя.Должность;
				Комиссия.Параметры.РасшифровкаПодписи       = ДанныеПредседателя.Представление;
				
			Иначе
				
				Комиссия.Параметры.ЗаголовокРазделаКомиссии = ЗаголовокРазделаКомиссии.ПредседательКомиссии;
				Комиссия.Параметры.Должность                = "";
				Комиссия.Параметры.РасшифровкаПодписи       = "";
				
			КонецЕсли;
							
			ТабДокумент.Вывести(Комиссия);
			
			// Выведем подписи членов комиссии
			ВыводитьЗаголовок = Истина;
			
			// Сформируем список членов комиссии
			СписокЧленовКомиссии = Новый Массив();
			
			Для Каждого Строка Из ТаблицаИнвентаризационнаяКомиссия Цикл
				Если НЕ Строка.Председатель Тогда
					СписокЧленовКомиссии.Добавить(Строка.ФизЛицо);
				КонецЕсли;
			КонецЦикла;
			
			ДанныеЧленовКомиссии = ПроцедурыУправленияПерсоналомВызовСервера.ДанныеФизЛиц(ШапкаДокумента.Организация, СписокЧленовКомиссии, ШапкаДокумента.Дата);
			
			// Сначала выведем членов комиссии из выборки
			Для Каждого ЧленКомиссии Из ДанныеЧленовКомиссии Цикл
				
				Если НЕ ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабДокумент, Комиссия) Тогда
					
					// Выведем разрыв страницы
					ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
					ВыводитьЗаголовок = Истина; // на новой странице выведем заголовок набора подписей
				
				КонецЕсли;
				
				Комиссия.Параметры.ЗаголовокРазделаКомиссии = ?(ВыводитьЗаголовок, 
				                                               ЗаголовокРазделаКомиссии.ЧленыКомиссии,
															   "");
				Комиссия.Параметры.Должность          = ЧленКомиссии.Должность;
				Комиссия.Параметры.РасшифровкаПодписи = ЧленКомиссии.Представление;
				
				ТабДокумент.Вывести(Комиссия);
				
				ВыводитьЗаголовок = Ложь; // в следующей итерации вывод заголовка не нужен
				
			КонецЦикла;
			
			// Затем выведем пустые места для подписей (чтобы в итоге получилось не менее 3-х
			Если ДанныеЧленовКомиссии.Количество() < 3 Тогда
				
				Если НЕ ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабДокумент, Комиссия) Тогда
					
					// Выведем разрыв страницы
					ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
					ВыводитьЗаголовок = Истина; // на новой странице выведем заголовок набора подписей
				
				КонецЕсли;
				
				Для Итератор = (ДанныеЧленовКомиссии.Количество() + 1) По 3 Цикл
					
					Комиссия.Параметры.ЗаголовокРазделаКомиссии = ?(ВыводитьЗаголовок, 
					                                               ЗаголовокРазделаКомиссии.ЧленыКомиссии,
																   "");
					Комиссия.Параметры.Должность          = "";
					Комиссия.Параметры.РасшифровкаПодписи = "";
					
					ТабДокумент.Вывести(Комиссия);
					
					ВыводитьЗаголовок = Ложь; // в следующей итерации вывод заголовка не нужен
					
				КонецЦикла;
			
			КонецЕсли;
			
	
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ ПЕРВЫЕ 1
				|	ИнвентаризацияОССолидарныеМол.Ссылка.МОЛОрганизации.Представление КАК Мол,
				|	ИнвентаризацияОССолидарныеМол.ФизЛицо.Представление КАК СолМол,
				|	РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.Представление КАК ГлавБух,
				|	РаботникиОрганизацийСрезПоследних.Должность.Представление КАК Должность,
				|	ИнвентаризацияОССолидарныеМол.Ссылка.ДатаОкончанияИнвентаризации КАК ДатаОкончанияИнвентаризации
				|ИЗ
				|	Документ.ИнвентаризацияОС.СолидарныеМол КАК ИнвентаризацияОССолидарныеМол
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаДокумента, Должность.Наименование = ""Главный бухгалтер"") КАК РаботникиОрганизацийСрезПоследних
				|		ПО (ИСТИНА)
				|ГДЕ
				|	ИнвентаризацияОССолидарныеМол.Ссылка = &Ссылка";
			
			Запрос.УстановитьПараметр("ДатаДокумента",  МассивОбъектов[0].Дата);
			Запрос.УстановитьПараметр("Ссылка", 		МассивОбъектов[0]);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Подвал.Параметры.ПодписьМол = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Строка(ВыборкаДетальныеЗаписи.Мол));
				Подвал.Параметры.ПодписьСолМол = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Строка(ВыборкаДетальныеЗаписи.СолМол)); 
				Подвал.Параметры.ГлавБух = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Строка(ВыборкаДетальныеЗаписи.ГлавБух));
				
				Если ВыборкаДетальныеЗаписи.Должность<>""Тогда	
					ПерваяБуква = Врег(Лев(ВыборкаДетальныеЗаписи.Должность, 1));
					СобраннаяСтрока = ПерваяБуква + Сред(ВыборкаДетальныеЗаписи.Должность, 2, СтрДлина(ВыборкаДетальныеЗаписи.Должность));
					Должность = СобраннаяСтрока;
				Иначе
					Должность = "";
				КонецЕсли;

				Подвал.Параметры.Должность = Должность;   
				ДатаОкончания = ВыборкаДетальныеЗаписи.ДатаОкончанияИнвентаризации; 
				ИНВОпись.Параметры.НомерСтроки = СписокОС.Количество();
			КонецЦикла;     
			
			Если ЗначениеЗаполнено(ДатаОкончания) Тогда
			    МесяцОкончания = Месяц(ДатаОкончания);
				Если МесяцОкончания = 1 Тогда
					 МесяцОкончания = "января";	
				ИначеЕсли Месяц(ДатаОкончания) = 2 Тогда
					 МесяцОкончания = "февраля";
				ИначеЕсли Месяц(ДатаОкончания) = 3 Тогда
					 МесяцОкончания = "марта";
				ИначеЕсли Месяц(ДатаОкончания) = 4 Тогда
					 МесяцОкончания = "апреля";
				ИначеЕсли Месяц(ДатаОкончания) = 5 Тогда
					 МесяцОкончания = "мая";
				ИначеЕсли Месяц(ДатаОкончания) = 6 Тогда
					 МесяцОкончания = "июня";
				ИначеЕсли Месяц(ДатаОкончания) = 7 Тогда
					 МесяцОкончания = "июля";
				ИначеЕсли Месяц(ДатаОкончания) = 8 Тогда
					 МесяцОкончания = "августа";
				ИначеЕсли Месяц(ДатаОкончания) = 9 Тогда
					 МесяцОкончания = "сентября";
				ИначеЕсли Месяц(ДатаОкончания) = 10 Тогда
					 МесяцОкончания = "октября";
				ИначеЕсли Месяц(ДатаОкончания) = 11 Тогда
					 МесяцОкончания = "ноября";
				ИначеЕсли Месяц(ДатаОкончания) = 12 Тогда
					 МесяцОкончания = "декабря";
				КонецЕсли;
				
				День = День(ДатаОкончания);
				Год = Год(ДатаОкончания);	
                Подвал.Параметры.ДатаОкончаниеИнвентаризации = Строка(День)+" "+МесяцОкончания+" "+Строка(Формат(Год, "ЧГ=0")); 
			КонецЕсли;	
				
			ТабДокумент.Вывести(ИНВОпись);
			ТабДокумент.Вывести(Подвал);
			
		КонецЕсли;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, ШапкаДокумента.Ссылка);
	
	КонецЦикла;
	
	Возврат ТабДокумент;

КонецФункции // ПечатьИНВ8()

//++Кубасов Евгений Кибернетика Задача:
Функция ПечатьИНВ16_2(МассивОбъектов, ОбъектыПечати) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИнвентаризацияОС.Дата КАК Дата,
	|	ИнвентаризацияОС.Номер КАК Номер,
	|	ИнвентаризацияОС.Организация КАК Организация,
	|	ИнвентаризацияОС.СтруктурноеПодразделение КАК СтруктурноеПодразделение,
	|	ИнвентаризацияОС.ПодразделениеОрганизации.Представление КАК ПодразделениеПредставление,
	|	ИнвентаризацияОС.ПодразделениеОрганизации.Код КАК ПодразделениеКод,
	|	ИнвентаризацияОС.ДатаНачалаИнвентаризации КАК ДатаНачалаИнвентаризации,
	|	ИнвентаризацияОС.ДатаОкончанияИнвентаризации КАК ДатаОкончанияИнвентаризации,
	|	ИнвентаризацияОС.ДокументОснованиеВид КАК ДокументОснованиеВид,
	|	ИнвентаризацияОС.ДокументОснованиеДата КАК ДокументОснованиеДата,
	|	ИнвентаризацияОС.ДокументОснованиеНомер КАК ДокументОснованиеНомер,
	|	ИнвентаризацияОС.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА СУММА(ИнвентаризацияОССолидарныеМол.НомерСтроки) > 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЕстьЛиСолидарныеМол
	|ИЗ
	|	Документ.ИнвентаризацияОС КАК ИнвентаризацияОС
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИнвентаризацияОС.СолидарныеМол КАК ИнвентаризацияОССолидарныеМол
	|		ПО ИнвентаризацияОС.Ссылка = ИнвентаризацияОССолидарныеМол.Ссылка
	|ГДЕ
	|	ИнвентаризацияОС.Ссылка В(&Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ИнвентаризацияОССолидарныеМол.Ссылка,
	|	ИнвентаризацияОС.Дата,
	|	ИнвентаризацияОС.Номер,
	|	ИнвентаризацияОС.Организация,
	|	ИнвентаризацияОС.СтруктурноеПодразделение,
	|	ИнвентаризацияОС.ПодразделениеОрганизации.Представление,
	|	ИнвентаризацияОС.ПодразделениеОрганизации.Код,
	|	ИнвентаризацияОС.ДатаНачалаИнвентаризации,
	|	ИнвентаризацияОС.ДатаОкончанияИнвентаризации,
	|	ИнвентаризацияОС.ДокументОснованиеВид,
	|	ИнвентаризацияОС.ДокументОснованиеДата,
	|	ИнвентаризацияОС.ДокументОснованиеНомер,
	|	ИнвентаризацияОС.Ссылка
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	ШапкаДокумента = Запрос.Выполнить().Выбрать();
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИнвентаризацияОСОС.НомерСтроки КАК НомерСтроки,
	|	ИнвентаризацияОСОС.ОсновноеСредство КАК ОсновноеСредство,
	|	ВЫРАЗИТЬ(ИнвентаризацияОСОС.ОсновноеСредство.НаименованиеПолное КАК СТРОКА(1000)) КАК ОсновноеСредствоНаименованиеПолное,
	|	ИнвентаризацияОСОС.ОсновноеСредство.ДатаВыпуска КАК ДатаВыпуска,
	|	ВЫРАЗИТЬ(ИнвентаризацияОСОС.ОсновноеСредство.ЗаводскойНомер КАК СТРОКА(1000)) КАК ЗаводскойНомер,
	|	ВЫРАЗИТЬ(ИнвентаризацияОСОС.ОсновноеСредство.НомерПаспорта КАК СТРОКА(1000)) КАК НомерПаспорта,
	|	ИнвентаризацияОСОС.СтоимостьПоДаннымУчета КАК СтоимостьПоДаннымУчета,
	|	ИнвентаризацияОСОС.СтоимостьФактическая КАК СтоимостьФактическая,
	|	ВЫБОР
	|		КОГДА ИнвентаризацияОСОС.НаличиеПоДаннымУчета = ИСТИНА
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НаличиеПоДаннымУчета,
	|	ВЫБОР
	|		КОГДА ИнвентаризацияОСОС.НаличиеФактическое = ИСТИНА
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НаличиеФактическое,
	|	ИнвентаризацияОСОС.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ИнвентаризацияОС.ОС КАК ИнвентаризацияОСОС
	|ГДЕ
	|	ИнвентаризацияОСОС.Ссылка В(&Ссылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|ИТОГИ ПО
	|	Ссылка
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	ВыборкаСтрок = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ИнвентаризацияОС.ПФ_MXL_ИНВ16");
	
	ТабДокумент = Новый ТабличныйДокумент;
	
	// Загрузим настройки пользователя
	ТабДокумент.КлючПараметровПечати = "ИнвентаризацияОС_ИНВ16";
	
	// Зададим параметры макета по умолчанию
	ТабДокумент.ПолеСверху              = 10;
	ТабДокумент.ПолеСлева               = 10;
	ТабДокумент.ПолеСнизу               = 0;
	ТабДокумент.ПолеСправа              = 0;
	ТабДокумент.РазмерКолонтитулаСверху = 10;
	ТабДокумент.ОриентацияСтраницы      = ОриентацияСтраницы.Ландшафт;
	 		
	Пока ШапкаДокумента.Следующий() Цикл

		// Получаем области макета для вывода в табличный документ
		Шапка                     = Макет.ПолучитьОбласть("Шапка");
		СекцияМОЛ                 = Макет.ПолучитьОбласть("СекцияМОЛ"); 
		//++Кубасов Евгений Кибернетика Задаем области Задача: I-20079
		ШапкаСекцииСолидарнойМО         = Макет.ПолучитьОбласть("ШапкаСекцииСолидарнойМО");
		СекцияСолидарнойМО				= Макет.ПолучитьОбласть("СекцияСолидарнойМО");
		//--Кубасов Евгений Кибернетика
		СтрокаНадТаблицей         = Макет.ПолучитьОбласть("СтрокаНадТаблицей");
		ЗаголовокТаблицы          = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
		СтрокаТаблицы             = Макет.ПолучитьОбласть("СтрокаТаблицы");
		ПодвалТаблицы             = Макет.ПолучитьОбласть("ПодвалТаблицы"); 
		ПодвалТаблицыИтог         = Макет.ПолучитьОбласть("ПодвалТаблицыИтог");
		ПодписьГлавногоБухгалтера = Макет.ПолучитьОбласть("ПодписьГлавногоБухгалтера");
		ШапкаПодписейМОЛ          = Макет.ПолучитьОбласть("ШапкаПодписейМОЛ");
		Подпись                   = Макет.ПолучитьОбласть("ПодписьМОЛ");
		
		Если ТабДокумент.ВысотаТаблицы > 0 Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;

		ВыборкаСтрок.Сбросить();
		
		Если ВыборкаСтрок.НайтиСледующий(ШапкаДокумента.Ссылка) Тогда
			ВыборкаСтрокОС = ВыборкаСтрок.Выбрать();
		Иначе
			ТекстСообщения = НСтр(
				"ru = 'Невозможно сформировать печатную форму ""Инв-16"" документа ""%1"",
				|так как табличная часть ""ОС"" в данном документе является пустой.'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ШапкаДокумента.Ссылка);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ШапкаДокумента.Ссылка);
			Продолжить;			
		КонецЕсли;

		СтруктурнаяЕдиницаОрганизация = ОбщегоНазначенияБК.ПолучитьСтруктурнуюЕдиницу(ШапкаДокумента.Организация, ШапкаДокумента.СтруктурноеПодразделение);

		// Выведем шапку документа
		СведенияОбОрганизации = ОбщегоНазначенияБКВызовСервера.СведенияОЮрФизЛице(СтруктурнаяЕдиницаОрганизация, ШапкаДокумента.Дата);
		
		Шапка.Параметры.Заполнить(ШапкаДокумента);
		Шапка.Параметры.ПредставлениеОрганизации = ОбщегоНазначенияБКВызовСервера.ОписаниеОрганизации(СведенияОбОрганизации, "ПолноеНаименование,");
		Шапка.Параметры.ОрганизацияРНН_БИН       = ОбщегоНазначенияБКВызовСервера.ОписаниеОрганизации(СведенияОбОрганизации, "БИН_ИИН,", Ложь, ШапкаДокумента.Дата, "ru");
		Шапка.Параметры.ДокументОснованиеДата    = СтрЗаменить(Формат(ШапкаДокумента.ДокументОснованиеДата,"ДЛФ=DD"), "г.", "года");
		
		Шапка.Параметры.НомерДок = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(ШапкаДокумента.Номер, ШапкаДокумента.Ссылка);
		Шапка.Параметры.ДатаДок  = Формат(ШапкаДокумента.Дата, "ДФ=dd.MM.yyyy") + " года";
		
		ТабДокумент.Вывести(Шапка); 
		
		НомерСтраницы   = 1;    
		
		ОбластьМакетаНомерСтроки = Макет.ПолучитьОбласть("НомерСтраницы");

	 	СписокОСДокумента = Новый ТаблицаЗначений;         	
		СписокОСДокумента.Колонки.Добавить("ОсновноеСредство",,"ОсновноеСредство");
		СписокОСДокумента.Колонки.Добавить("НаличиеФактическое",,"НаличиеФактическое");
		СписокОСДокумента.Колонки.Добавить("СтоимостьФактическая",,"СтоимостьФактическая");
		
		Если НЕ ВыборкаСтрокОС = Неопределено Тогда
			
			Пока ВыборкаСтрокОС.Следующий() Цикл
				
				Стр = СписокОСДокумента.Добавить();
				Стр.ОсновноеСредство 	 = ВыборкаСтрокОС.ОсновноеСредство;
				Стр.НаличиеФактическое   = ВыборкаСтрокОС.НаличиеФактическое;
				Стр.СтоимостьФактическая = ВыборкаСтрокОС.СтоимостьФактическая;
				
			КонецЦикла;
			
		КонецЕсли;
		
		ВыборкаСтрокОС.Сбросить();
		
		Если ВыборкаСтрокОС.Количество()<>0 Тогда 
			
			// Получим список МОЛ на основании списка ОС
			СписокОС = СписокОСДокумента.ВыгрузитьКолонку("ОсновноеСредство");
			
			Запрос = Новый Запрос();
			Запрос.УстановитьПараметр("ОсновноеСредство", СписокОС);
			Запрос.УстановитьПараметр("Организация",      ШапкаДокумента.Организация);
			Запрос.УстановитьПараметр("Дата",             ШапкаДокумента.Дата);
			
			Запрос.Текст =
			"ВЫБРАТЬ   РАЗЛИЧНЫЕ
			|	МестонахождениеОСБухгалтерскийУчетСрезПоследних.МОЛ КАК МОЛ
			|ИЗ
			|	РегистрСведений.МестонахождениеОСБухгалтерскийУчет.СрезПоследних(&Дата, Организация = &Организация И ОсновноеСредство В (&ОсновноеСредство)) КАК МестонахождениеОСБухгалтерскийУчетСрезПоследних";
			
			Результат = Запрос.Выполнить().Выгрузить();
			СписокМОЛ = Результат.ВыгрузитьКолонку("МОЛ");
			
			// Выведем подписи МОЛов
			ДанныеМОЛ 			 = ПроцедурыУправленияПерсоналомВызовСервера.ДанныеФизЛиц(ШапкаДокумента.Организация, СписокМОЛ, ШапкаДокумента.Дата);
			ВыводитьЗаголовокМОЛ = Истина;
			
			// Сначала выведем МОЛов из выборки
			Для Каждого СтрокаМОЛ Из ДанныеМОЛ Цикл
				
				//Если НЕ ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабДокумент, СекцияМОЛ) Тогда
				//	// Выведем разрыв страницы
				//	ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				//КонецЕсли;
				
				СекцияМОЛ.Параметры.Должность 		   = СтрокаМОЛ.Должность;
				СекцияМОЛ.Параметры.РасшифровкаПодписи = СтрокаМОЛ.Представление;
				
				//СекцияМОЛ.Параметры.ЗаголовокМОЛ = ?(ВыводитьЗаголовокМОЛ, НСтр("ru = 'находящихся на ответственном хранении'"), "" );
				ВыводитьЗаголовокМОЛ = Ложь;
				
				ТабДокумент.Вывести(СекцияМОЛ);
				
			КонецЦикла;
			
//++Кубасов Евгений Кибернетика Задача: I-20079 
//Уточнение Мы сейчас в Цикле ШапкаДокумента.Следующий() поэтому беру ССылку с запроса

Если ШапкаДокумента.ЕстьЛиСолидарныеМол Тогда 
	//Заполнение На основании Договора о солидарной Мат отв
	СолидарноеМолДата = ?(ЗначениеЗаполнено(ШапкаДокумента.Ссылка.СолидарноеМолДата),Формат(ШапкаДокумента.Ссылка.СолидарноеМолДата,	"ДФ=dd.MM.yyyy"),"_________");
	ШапкаСекцииСолидарнойМО.Параметры.ДатаСолидарнойМО = СолидарноеМолДата;
	ТабДокумент.Вывести(ШапкаСекцииСолидарнойМО);
	
	//Заполнения ПОдписей Договор МО			   
	СолидарнойМО = Новый Запрос();
	СолидарнойМО.УстановитьПараметр("Ссылка", ШапкаДокумента.Ссылка);
	СолидарнойМО.Текст = "ВЫБРАТЬ
	                     |	ИнвентаризацияОССолидарныеМол.ФизЛицо КАК ФизЛицо,
	                     |	РаботникиОрганизацийСрезПоследних.Должность КАК Должность
	                     |ИЗ
	                     |	Документ.ИнвентаризацияОС.СолидарныеМол КАК ИнвентаризацияОССолидарныеМол
	                     |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(, ) КАК РаботникиОрганизацийСрезПоследних
	                     |		ПО ИнвентаризацияОССолидарныеМол.ФизЛицо = РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо
	                     |ГДЕ
	                     |	ИнвентаризацияОССолидарныеМол.Ссылка =&Ссылка
	                     |АВТОУПОРЯДОЧИВАНИЕ";
				   
				СолидарнойМО = СолидарнойМО.Выполнить().Выбрать();
				Пока СолидарнойМО.Следующий() Цикл
                     ИнициалыФизЛица = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Строка(СолидарнойМО.ФизЛицо));
					 СекцияСолидарнойМО.Параметры.Должность 			= СолидарнойМО.Должность;
					 СекцияСолидарнойМО.Параметры.РасшифровкаПодписи 	= ИнициалыФизЛица;
					 ТабДокумент.Вывести(СекцияСолидарнойМО);
				 КонецЦикла;
				 СолидарнойМО.Сбросить();
КонецЕсли;				   
//--Кубасов Евгений Кибернетика
			
			
			
			// Проверим, помещаются ли строка над таблицей, заголовок и первая строка.
			ШапкаТаблицы = Новый Массив;
			ШапкаТаблицы.Добавить(СтрокаНадТаблицей);
			ШапкаТаблицы.Добавить(ЗаголовокТаблицы);
			ШапкаТаблицы.Добавить(СтрокаТаблицы);
			
			Если НЕ ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабДокумент, ШапкаТаблицы) Тогда
			//	 Выведем разрыв страницы
				//ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			//++ Кубасов Евгений скрыл
			//СтрокаНадТаблицей.Параметры.НомерСтраницы =  "Оборотная сторона формы Инв-16" + Символы.ПС + "Страница " + НомерСтраницы;
			//++ Кубасов Евгений скрыл

			СтрокаНадТаблицей.Параметры.ДатаНачалаИнвентаризации    = СтрЗаменить(Формат(ШапкаДокумента.ДатаНачалаИнвентаризации,"ДЛФ=DD"), "г.", "года");
			СтрокаНадТаблицей.Параметры.ДатаОкончанияИнвентаризации = СтрЗаменить(Формат(ШапкаДокумента.ДатаОкончанияИнвентаризации,"ДЛФ=DD"), "г.", "года");
			
			// Выведем строку над таблицей
			ТабДокумент.Вывести(СтрокаНадТаблицей);
			
			
			// Выведем заголовок таблицы
			ЗаголовокТаблицы.Параметры.Валюта = ОбщегоНазначенияБКВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета();
			ТабДокумент.Вывести(ЗаголовокТаблицы);
			
			// Создадим переменные для накопления итогов по каждой странице
			ИтогИзлишекКоличество   = 0;
			ИтогИзлишекСтоимость    = 0;
			ИтогНедостачаКоличество = 0;
			ИтогНедостачаСтоимость  = 0;   
			
			ИтогИзлишекКоличествоПоТаблице   = 0;
			ИтогИзлишекСтоимостьПоТаблице    = 0;
			ИтогНедостачаКоличествоПоТаблице = 0;
			ИтогНедостачаСтоимостьПоТаблице  = 0;	
					
			// Выведем строки таблицы
			Пока ВыборкаСтрокОС.Следующий() Цикл
				
				СтрокаСПодвалом = Новый Массив;
				СтрокаСПодвалом.Добавить(СтрокаТаблицы);
				СтрокаСПодвалом.Добавить(ПодвалТаблицы);
				Если (ВыборкаСтрокОС.НомерСтроки = ВыборкаСтрокОС.Количество()) Тогда // если последняя строка, должна
					СтрокаСПодвалом.Добавить(ПодписьГлавногоБухгалтера);             // помещаться и подпись гл.бухгалтера
				КонецЕсли;
				
				Если НЕ ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабДокумент, СтрокаСПодвалом) Тогда
					
					// Выведем подвал таблицы
					ПодвалТаблицы.Параметры.ИтогИзлишекКоличество   = ИтогИзлишекКоличество;
					ПодвалТаблицы.Параметры.ИтогИзлишекСтоимость    = ИтогИзлишекСтоимость;
					ПодвалТаблицы.Параметры.ИтогНедостачаКоличество = ИтогНедостачаКоличество;
					ПодвалТаблицы.Параметры.ИтогНедостачаСтоимость  = ИтогНедостачаСтоимость;
					
					//ТабДокумент.Вывести(ПодвалТаблицы); 
					
					ИтогИзлишекКоличествоПоТаблице 	 = ИтогИзлишекКоличествоПоТаблице + ИтогИзлишекКоличество; 
					ИтогИзлишекСтоимостьПоТаблице 	 = ИтогИзлишекСтоимостьПоТаблице + ИтогИзлишекСтоимость;
					ИтогНедостачаКоличествоПоТаблице = ИтогНедостачаКоличествоПоТаблице + ИтогНедостачаКоличество;
					ИтогНедостачаСтоимостьПоТаблице  = ИтогНедостачаСтоимостьПоТаблице + ИтогНедостачаСтоимость;
					
					// Обнулим переменные для накопления итогов по каждой странице
					ИтогИзлишекКоличество   = 0;
					ИтогИзлишекСтоимость    = 0;
					ИтогНедостачаКоличество = 0;
					ИтогНедостачаСтоимость  = 0;    
					
					НомерСтраницы = НомерСтраницы + 1;
					
					// Выведем разрыв страницы
					//ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц(); 
					
					//ОбластьМакетаНомерСтроки.Параметры.НомерСтраницы =  "Оборотная сторона формы Инв-16" + Символы.ПС + "Страница " + НомерСтраницы;
					//ТабДокумент.Вывести(ОбластьМакетаНомерСтроки);
					
					// Выведем заголовок таблицы	
					//ТабДокумент.Вывести(ЗаголовокТаблицы);
					
				КонецЕсли;
				
				РазницаПоНаличию   = ВыборкаСтрокОС.НаличиеФактическое - ВыборкаСтрокОС.НаличиеПоДаннымУчета;
				РазницаПоСтоимости = ВыборкаСтрокОС.СтоимостьФактическая - ВыборкаСтрокОС.СтоимостьПоДаннымУчета;
			
				Если (РазницаПоНаличию = 0) И (РазницаПоСтоимости = 0) Тогда
					Продолжить;	
				КонецЕсли;	
				
				СтрокаТаблицы.Параметры.Заполнить(ВыборкаСтрокОС);
				СтрокаТаблицы.Параметры.ИнвентарныйНомер = УправлениеВнеоборотнымиАктивамиСервер.СведенияОбИнвентарномНомереОСЗ(ВыборкаСтрокОС.ОсновноеСредство, ШапкаДокумента.Организация, ШапкаДокумента.Дата).ИнвентарныйНомер;
				СтрокаТаблицы.Параметры.ГодВыпуска		 = ВыборкаСтрокОС.ОсновноеСредство.ДатаВыпуска;
				
				ДокументПринятияКУчетуБУ = Неопределено;
				ДатаПриобретения 		 = '00010101';
				
				УправлениеВнеоборотнымиАктивамиСервер.ПолучитьДокументБухСостоянияОС(ВыборкаСтрокОС.ОсновноеСредство, ШапкаДокумента.Организация, Перечисления.ВидыСостоянийОС.Поступило, ШапкаДокумента.Дата, ДокументПринятияКУчетуБУ,  ДатаПриобретения);
				
				Если НЕ ЗначениеЗаполнено(ДатаПриобретения) Тогда
					УправлениеВнеоборотнымиАктивамиСервер.ПолучитьДокументБухСостоянияОС(ВыборкаСтрокОС.ОсновноеСредство, ШапкаДокумента.Организация, Перечисления.ВидыСостоянийОС.ПринятоКУчету, ШапкаДокумента.Дата, ДокументПринятияКУчетуБУ,  ДатаПриобретения);	
				КонецЕсли;	
				
				СтрокаТаблицы.Параметры.ДатаПриобретения = ДатаПриобретения;
				
				ИзлишекКоличество   = ?(РазницаПоНаличию > 0,   РазницаПоНаличию, 0);
				ИзлишекСтоимость    = ?(РазницаПоСтоимости > 0, РазницаПоСтоимости, 0);
				НедостачаКоличество = ?(РазницаПоНаличию < 0,  -РазницаПоНаличию, 0);
				НедостачаСтоимость  = ?(РазницаПоСтоимости < 0,-РазницаПоСтоимости, 0);
				
				ИтогИзлишекКоличество   = ИтогИзлишекКоличество + ИзлишекКоличество;
				ИтогИзлишекСтоимость    = ИтогИзлишекСтоимость  + ИзлишекСтоимость;
				ИтогНедостачаКоличество = ИтогНедостачаКоличество + НедостачаКоличество;
				ИтогНедостачаСтоимость  = ИтогНедостачаСтоимость  + НедостачаСтоимость;
				
				СтрокаТаблицы.Параметры.ИзлишекКоличество   = ИзлишекКоличество;
				СтрокаТаблицы.Параметры.ИзлишекСтоимость    = ИзлишекСтоимость;
				СтрокаТаблицы.Параметры.НедостачаКоличество = НедостачаКоличество;
				СтрокаТаблицы.Параметры.НедостачаСтоимость  = НедостачаСтоимость;
				
				ТабДокумент.Вывести(СтрокаТаблицы);
				
			КонецЦикла; 
			
			ИтогИзлишекКоличествоПоТаблице 	 = ИтогИзлишекКоличествоПоТаблице   + ИтогИзлишекКоличество; 
			ИтогИзлишекСтоимостьПоТаблице 	 = ИтогИзлишекСтоимостьПоТаблице    + ИтогИзлишекСтоимость;
			ИтогНедостачаКоличествоПоТаблице = ИтогНедостачаКоличествоПоТаблице + ИтогНедостачаКоличество;
			ИтогНедостачаСтоимостьПоТаблице  = ИтогНедостачаСтоимостьПоТаблице  + ИтогНедостачаСтоимость;	
			
			// Выведем подвал таблицы
			ПодвалТаблицы.Параметры.ИтогИзлишекКоличество   = ИтогИзлишекКоличество;
			ПодвалТаблицы.Параметры.ИтогИзлишекСтоимость    = ИтогИзлишекСтоимость;
			ПодвалТаблицы.Параметры.ИтогНедостачаКоличество = ИтогНедостачаКоличество;
			ПодвалТаблицы.Параметры.ИтогНедостачаСтоимость  = ИтогНедостачаСтоимость; 
			
			ПодвалТаблицыИтог.Параметры.ИтогВсегоИзлишекКоличество   = ИтогИзлишекКоличествоПоТаблице;
			ПодвалТаблицыИтог.Параметры.ИтогВсегоИзлишекСтоимость    = ИтогИзлишекСтоимостьПоТаблице;
			ПодвалТаблицыИтог.Параметры.ИтогВсегоНедостачаКоличество = ИтогНедостачаКоличествоПоТаблице;
			ПодвалТаблицыИтог.Параметры.ИтогВсегоНедостачаСтоимость  = ИтогНедостачаСтоимостьПоТаблице;
			
			//ТабДокумент.Вывести(ПодвалТаблицы);  		
			ТабДокумент.Вывести(ПодвалТаблицыИтог);
			
			// Выведем подпись бухгалтера
			Руководители = ОбщегоНазначенияБКВызовСервера.ОтветственныеЛицаОрганизаций(СтруктурнаяЕдиницаОрганизация, ШапкаДокумента.Дата);
			
			ПодписьГлавногоБухгалтера.Параметры.РасшифровкаПодписи = Руководители.ГлавныйБухгалтер;
			
			//ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
			ТабДокумент.Вывести(ПодписьГлавногоБухгалтера);
			
			// Проверим, помещаются ли шапка подписей и одна подпись
			Подписи = Новый Массив;
			Подписи.Добавить(ШапкаПодписейМОЛ);
			Подписи.Добавить(Подпись);
						
			Если НЕ ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабДокумент, Подписи) Тогда
					
				// Выведем разрыв страницы
				//ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц(); //*
			КонецЕсли;
			
			// Выведем шапку подписей МОЛ
			ТабДокумент.Вывести(ШапкаПодписейМОЛ);
			
			// Выведем подписи МОЛов
			ЗаголовокРазделаПодписей = НСтр("ru = 'Материально-ответственное(-ые) лицо(-а)'");
			ВыводитьЗаголовок = Истина;
			
			// Сначала выведем МОЛов из выборки
			Для Каждого СтрокаМОЛ Из ДанныеМОЛ Цикл
				
				Если НЕ ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабДокумент, Подпись) Тогда
					
					// Выведем разрыв страницы
					//ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц(); //*
					ВыводитьЗаголовок = Истина; // на новой странице выведем заголовок набора подписей
				
				КонецЕсли;
				
				Подпись.Параметры.ЗаголовокРазделаПодписей = ?(ВыводитьЗаголовок, 
				                                               ЗаголовокРазделаПодписей,
															   "");
				Подпись.Параметры.Должность                = СтрокаМОЛ.Должность;
				Подпись.Параметры.РасшифровкаПодписи       = СтрокаМОЛ.Представление;
				
				ТабДокумент.Вывести(Подпись);
				
				ВыводитьЗаголовок = Ложь; // в следующей итерации вывод заголовка не нужен
				
			КонецЦикла;			
		КонецЕсли;
		
//Внизу	под подписью	
Если ШапкаДокумента.ЕстьЛиСолидарныеМол Тогда 
	//Заполнение На основании Договора о солидарной Мат отв
	СолидарноеМолДата = ?(ЗначениеЗаполнено(ШапкаДокумента.Ссылка.СолидарноеМолДата),Формат(ШапкаДокумента.Ссылка.СолидарноеМолДата,	"ДФ=dd.MM.yyyy"),"_________");
	ШапкаСекцииСолидарнойМО.Параметры.ДатаСолидарнойМО = СолидарноеМолДата;
	ТабДокумент.Вывести(ШапкаСекцииСолидарнойМО);



Пока СолидарнойМО.Следующий() Цикл
ИнициалыФизЛица = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Строка(СолидарнойМО.ФизЛицо));
СекцияСолидарнойМО.Параметры.Должность 			= СолидарнойМО.Должность;
СекцияСолидарнойМО.Параметры.РасшифровкаПодписи 	= ИнициалыФизЛица;
ТабДокумент.Вывести(СекцияСолидарнойМО);
КонецЦикла;
КонецЕсли;   
//Внизу	под подписью
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, ШапкаДокумента.Ссылка);
		
		
		
	КонецЦикла;
	   	
	Возврат ТабДокумент;
	
КонецФункции // ПечатьИНВ16()
//--Кубасов Евгений Кибернетика


#КонецЕсли
