
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ВыбиратьКомпенсируемыеУдержания") И Параметры.ВыбиратьКомпенсируемыеУдержания Тогда
		
		СписокСпособовРасчета = Новый СписокЗначений;
		СписокСпособовРасчета.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ФиксированнойСуммой);
		СписокСпособовРасчета.Добавить(Перечисления.СпособыРасчетаОплатыТруда.Процентом);
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
					Список,
					"СпособРасчета",
					СписокСпособовРасчета,
					ВидСравненияКомпоновкиДанных.ВСписке,
					,
					Истина,
					РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
