#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

Функция ИспользуетсяРасширениеРасчетаСОЗаСчетГПХ() Экспорт

	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

Функция АналитикаРасходовПоУмолчанию(ФизическоеЛицо, Подразделение, ВидОперации, Контрагент, ТекущийДокумент, ДатаАктуальности) Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	&ФизическоеЛицо КАК ФизическоеЛицо,
	|	&Подразделение КАК Подразделение,
	|	&ВидОперации КАК ВидОперации,
	|	&Контрагент КАК Контрагент
	|ПОМЕСТИТЬ ВТНезаполненнаяАналитика";
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ФизическоеЛицо",           ФизическоеЛицо);
	Запрос.УстановитьПараметр("Подразделение",            Подразделение);
	Запрос.УстановитьПараметр("ВидОперации",              ВидОперации);
	Запрос.УстановитьПараметр("Контрагент",               Контрагент);
	Запрос.Выполнить();
	
	Документы.ОтражениеЗарплатыВБухучете.СоздатьВТАналитикаДругихДокументов(МенеджерВременныхТаблиц, ТекущийДокумент, ДатаАктуальности, "УдержаннаяЗарплата");
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	АналитикаДругихДокументов.ФизическоеЛицо КАК ФизическоеЛицо,
	|	АналитикаДругихДокументов.ВидОперации КАК ВидОперации,
	|	АналитикаДругихДокументов.СчетУчета КАК СчетУчета,
	|	АналитикаДругихДокументов.Субконто1 КАК Субконто1,
	|	АналитикаДругихДокументов.Субконто2 КАК Субконто2,
	|	АналитикаДругихДокументов.Субконто3 КАК Субконто3
	|ИЗ
	|	ЗаполненнаяСтатьяПассивов КАК АналитикаДругихДокументов";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	РезультатЗапроса = Запрос.Выполнить();
	
	АналитикаРасходов = Новый Структура("СчетУчета, Субконто1, Субконто2, Субконто3, ПредставлениеОтраженияВУчете");
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(АналитикаРасходов, Выборка);
        Если АналитикаРасходов.СчетУчета = ПланыСчетов.Типовой.ПрочаяКраткосрочнаяКредиторскаяЗадолженность Тогда
            Если ТипЗнч(Выборка.Субконто2) = Тип("СправочникСсылка.ДоговорыКонтрагентов") 
                И ЗначениеЗаполнено(Выборка.Субконто1) Тогда
                АналитикаРасходов.Субконто2 = ОбщегоНазначенияБК.ДоступныйДоговорКонтрагента(Выборка.Субконто1["ОсновнойДоговорКонтрагента"]);       
            КонецЕсли;
        ИначеЕсли АналитикаРасходов.СчетУчета = ПланыСчетов.Типовой.ОбязательстваПоПенсионнымОтчислениям Тогда
            Если НЕ ЗначениеЗаполнено(Выборка.Субконто1) Тогда
                АналитикаРасходов.Субконто1 = Справочники.НалогиСборыОтчисления.ОбязательныеПенсионныеВзносы;
                АналитикаРасходов.Субконто2 = Перечисления.ВидыПлатежейВБюджетИФОнды.Налог;
            КонецЕсли;
        КонецЕсли; 
	КонецЕсли;
	
	АналитикаРасходов.ПредставлениеОтраженияВУчете = Документы.ОтражениеЗарплатыВБухучете.ПредставлениеОтраженияВУчете(АналитикаРасходов);
	
	Возврат АналитикаРасходов;
	
КонецФункции

Процедура СоздатьВТАналитикаДругихДокументов(МенеджерВременныхТаблиц, ТекущийДокумент, ДатаАктуальности, ИмяТаблицы = "") Экспорт
	
	// Получаем последние используемые значения по совпадающим сочетаниям заполненных полей.
	
	ТекстЗапросаУдержаннаяЗарплата = 
	"ВЫБРАТЬ
    |   ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.АлиментыПрочиеИсполнительныеЛисты) КАК ВидОперации,
    |   ЗНАЧЕНИЕ(ПланСчетов.Типовой.КраткосрочнаяЗадолженностьПоИсполнительнымЛистам) КАК СчетУчета,
    |   ЛОЖЬ КАК АналитикаПоРаботникам,
    |   ИСТИНА КАК АналитикаПоКонтрагентам
    |ПОМЕСТИТЬ ВТСчетаПоОперациям
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |   ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВозмещениеУщерба),
    |   ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПрочаяКраткосрочнаяЗадолженностьРаботников),
    |   ИСТИНА,
    |   ЛОЖЬ
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |   ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВознаграждениеПлатежногоАгента),
    |   ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПрочаяКраткосрочнаяКредиторскаяЗадолженность),
    |   ЛОЖЬ,
    |   ИСТИНА
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |   ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.Профвзносы),
    |   ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПрочаяКраткосрочнаяКредиторскаяЗадолженность),
    |   ЛОЖЬ,
    |   ИСТИНА
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |   ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПрочиеУдержания),
    |   ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПрочаяКраткосрочнаяЗадолженностьРаботников),
    |   ИСТИНА,
    |   ЛОЖЬ
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |   ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.УдержаниеЗаОтпуск),
    |   ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПрочаяКраткосрочнаяЗадолженностьРаботников),
    |   ИСТИНА,
    |   ЛОЖЬ
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |   ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.УдержаниеНеизрасходованныхПодотчетныхСумм),
    |   ЗНАЧЕНИЕ(ПланСчетов.Типовой.КраткосрочнаяЗадолженностьПодотчетныхЛиц),
    |   ИСТИНА,
    |   ЛОЖЬ
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |   ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.УдержаниеПоПрочимОперациямСРаботниками),
    |   ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПрочаяКраткосрочнаяЗадолженностьРаботников),
    |   ИСТИНА,
    |   ЛОЖЬ
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |   ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПогашениеЗаймов),
    |   ЗНАЧЕНИЕ(ПланСчетов.Типовой.КраткосрочнаяЗадолженностьПоПредоставленнымРаботникамЗаймам),
    |   ИСТИНА,
    |   ЛОЖЬ
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |   ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПроцентыПоЗайму),
    |   ЗНАЧЕНИЕ(ПланСчетов.Типовой.КраткосрочныеВознагражденияКПолучениюРаботникам),
    |   ИСТИНА,
    |   ЛОЖЬ
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |   ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.НачисленоПроцентовПоЗайму),
    |   ЗНАЧЕНИЕ(ПланСчетов.Типовой.ДоходыПоВознаграждениям),
    |   ИСТИНА,
    |   ЛОЖЬ
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |   ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.АлиментыПрочиеИсполнительныеЛистыКонтрагенты),
    |   ЗНАЧЕНИЕ(ПланСчетов.Типовой.КраткосрочнаяЗадолженностьПоИсполнительнымЛистам),
    |   ЛОЖЬ,
    |   ИСТИНА
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |   ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВозвратИзлишнеВыплаченныхСуммВследствиеСчетныхОшибок),
    |   ЗНАЧЕНИЕ(ПланСчетов.Типовой.КраткосрочнаяЗадолженностьПоВыплаченнойЗаработнойПлате),
    |   ИСТИНА,
    |   ЛОЖЬ
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |   ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ДобровольныеВзносыВНПФ),
    |   ЗНАЧЕНИЕ(ПланСчетов.Типовой.ОбязательстваПоПенсионнымОтчислениям),
    |   ИСТИНА,
    |   ЛОЖЬ
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |   ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВознаграждениеПлатежногоАгентаКонтрагенты),
    |   ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПрочаяКраткосрочнаяКредиторскаяЗадолженность),
    |   ЛОЖЬ,
    |   ИСТИНА
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
    |   НезаполненнаяАналитика.ВидОперации КАК ВидОперации,
    |   НезаполненнаяАналитика.ФизическоеЛицо КАК ФизическоеЛицо,
    |   НезаполненнаяАналитика.Подразделение КАК Подразделение,
    |   Документы.Дата КАК Дата,
    |   Удержания.СчетУчета КАК СчетУчета,
    |   Удержания.Субконто1 КАК Субконто1,
    |   Удержания.Субконто2 КАК Субконто2,
    |   Удержания.Субконто3 КАК Субконто3,
    |   Удержания.Контрагент КАК Контрагент
    |ПОМЕСТИТЬ ВТАналитикаДругихДокументовУдержания
    |ИЗ
    |   ВТНезаполненнаяАналитика КАК НезаполненнаяАналитика
    |       ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтражениеЗарплатыВБухучете.УдержаннаяЗарплата КАК Удержания
    |           ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтражениеЗарплатыВБухучете КАК Документы
    |           ПО Удержания.Ссылка = Документы.Ссылка
    |       ПО НезаполненнаяАналитика.ВидОперации = Удержания.ВидОперации
    |           И (ВЫБОР
    |               КОГДА Удержания.РаботникОрганизации = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
    |                   ТОГДА Удержания.ФизическоеЛицо = НезаполненнаяАналитика.ФизическоеЛицо
    |               ИНАЧЕ Удержания.РаботникОрганизации = НезаполненнаяАналитика.ФизическоеЛицо
    |           КОНЕЦ)
    |           И (Удержания.Подразделение = НезаполненнаяАналитика.Подразделение)
    |           И (Удержания.Контрагент = НезаполненнаяАналитика.Контрагент)
    |ГДЕ
    |   Удержания.Ссылка <> &ТекущийДокумент
    |   И Документы.ПериодРегистрации <= &ДатаАктуальности
    |   И Документы.Проведен
    |
    |ИНДЕКСИРОВАТЬ ПО
    |   ФизическоеЛицо,
    |   ВидОперации,
    |   Подразделение,
    |   Дата,
    |   Контрагент
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ РАЗЛИЧНЫЕ
    |   ВТАналитикаДругихДокументовУдержания.ВидОперации КАК ВидОперации,
    |   ВТАналитикаДругихДокументовУдержания.ФизическоеЛицо КАК ФизическоеЛицо,
    |   ВТАналитикаДругихДокументовУдержания.Подразделение КАК Подразделение,
    |   МАКСИМУМ(ВТАналитикаДругихДокументовУдержания.Дата) КАК Дата,
    |   ВТАналитикаДругихДокументовУдержания.Контрагент КАК Контрагент
    |ПОМЕСТИТЬ ВТЕдинственныеЗначенияСтатьи
    |ИЗ
    |   ВТАналитикаДругихДокументовУдержания КАК ВТАналитикаДругихДокументовУдержания
    |
    |СГРУППИРОВАТЬ ПО
    |   ВТАналитикаДругихДокументовУдержания.ФизическоеЛицо,
    |   ВТАналитикаДругихДокументовУдержания.Подразделение,
    |   ВТАналитикаДругихДокументовУдержания.ВидОперации,
    |   ВТАналитикаДругихДокументовУдержания.Контрагент
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |   ВТАналитикаДругихДокументовУдержания.ВидОперации КАК ВидОперации,
    |   ВТАналитикаДругихДокументовУдержания.ФизическоеЛицо КАК ФизическоеЛицо,
    |   ВТАналитикаДругихДокументовУдержания.Подразделение КАК Подразделение,
    |   ВТАналитикаДругихДокументовУдержания.СчетУчета КАК СчетУчета,
    |   ВТАналитикаДругихДокументовУдержания.Субконто1 КАК Субконто1,
    |   ВТАналитикаДругихДокументовУдержания.Субконто2 КАК Субконто2,
    |   ВТАналитикаДругихДокументовУдержания.Субконто3 КАК Субконто3,
    |   ВТАналитикаДругихДокументовУдержания.Контрагент КАК Контрагент
    |ПОМЕСТИТЬ ВТЗаполненнаяСтатьяПассивов
    |ИЗ
    |   ВТАналитикаДругихДокументовУдержания КАК ВТАналитикаДругихДокументовУдержания
    |       ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЕдинственныеЗначенияСтатьи КАК ВТЕдинственныеЗначенияСтатьи
    |       ПО (ВТЕдинственныеЗначенияСтатьи.ВидОперации = ВТАналитикаДругихДокументовУдержания.ВидОперации)
    |           И (ВТЕдинственныеЗначенияСтатьи.ФизическоеЛицо = ВТАналитикаДругихДокументовУдержания.ФизическоеЛицо)
    |           И (ВТЕдинственныеЗначенияСтатьи.Подразделение = ВТАналитикаДругихДокументовУдержания.Подразделение)
    |           И (ВТЕдинственныеЗначенияСтатьи.Дата = ВТАналитикаДругихДокументовУдержания.Дата)
    |           И ВТАналитикаДругихДокументовУдержания.Контрагент = ВТЕдинственныеЗначенияСтатьи.Контрагент
    |
    |ИНДЕКСИРОВАТЬ ПО
    |   ВидОперации,
    |   ФизическоеЛицо,
    |   Подразделение,
    |   Контрагент
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ РАЗЛИЧНЫЕ
    |   НезаполненнаяАналитика.ВидОперации КАК ВидОперации,
    |   НезаполненнаяАналитика.ФизическоеЛицо КАК ФизическоеЛицо,
    |   НезаполненнаяАналитика.Подразделение КАК Подразделение,
    |   ВЫБОР
    |       КОГДА ВТЗаполненнаяСтатьяПассивов.СчетУчета ЕСТЬ NULL
    |               ИЛИ ВТЗаполненнаяСтатьяПассивов.СчетУчета = ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка)
    |           ТОГДА ВТСчетаПоОперациям.СчетУчета
    |       ИНАЧЕ ВТЗаполненнаяСтатьяПассивов.СчетУчета
    |   КОНЕЦ КАК СчетУчета,
    |   ВЫБОР
    |       КОГДА (ВТЗаполненнаяСтатьяПассивов.СчетУчета ЕСТЬ NULL
    |               ИЛИ ВТЗаполненнаяСтатьяПассивов.СчетУчета = ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка))
    |               И ВТСчетаПоОперациям.АналитикаПоРаботникам 
    |               И НезаполненнаяАналитика.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ДобровольныеВзносыВНПФ) 
    |           ТОГДА НезаполненнаяАналитика.ФизическоеЛицо
    |       КОГДА (ВТЗаполненнаяСтатьяПассивов.СчетУчета ЕСТЬ NULL
    |               ИЛИ ВТЗаполненнаяСтатьяПассивов.СчетУчета = ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка))
    |               И ВТСчетаПоОперациям.АналитикаПоКонтрагентам
    |           ТОГДА ВЫБОР
    |                   КОГДА НезаполненнаяАналитика.Контрагент <> НЕОПРЕДЕЛЕНО
    |                       ТОГДА НезаполненнаяАналитика.Контрагент
    |                   ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
    |               КОНЕЦ
    |       ИНАЧЕ ВТЗаполненнаяСтатьяПассивов.Субконто1
    |   КОНЕЦ КАК Субконто1,
    |   ВЫБОР
    |       КОГДА (ВТЗаполненнаяСтатьяПассивов.СчетУчета ЕСТЬ NULL
    |               ИЛИ ВТЗаполненнаяСтатьяПассивов.СчетУчета = ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка))
    |               И ВТСчетаПоОперациям.АналитикаПоКонтрагентам
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
    |       ИНАЧЕ ЕСТЬNULL(ВТЗаполненнаяСтатьяПассивов.Субконто2, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка))
    |   КОНЕЦ КАК Субконто2,
    |   ВЫБОР
    |       КОГДА (ВТЗаполненнаяСтатьяПассивов.СчетУчета ЕСТЬ NULL
    |               ИЛИ ВТЗаполненнаяСтатьяПассивов.СчетУчета = ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка))
    |               И ВТСчетаПоОперациям.АналитикаПоРаботникам 
    |               И НезаполненнаяАналитика.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ДобровольныеВзносыВНПФ)
    |           ТОГДА НезаполненнаяАналитика.ФизическоеЛицо
    |       ИНАЧЕ ВТЗаполненнаяСтатьяПассивов.Субконто3
    |   КОНЕЦ КАК Субконто3
    |ПОМЕСТИТЬ ЗаполненнаяСтатьяПассивов
    |ИЗ
    |   ВТНезаполненнаяАналитика КАК НезаполненнаяАналитика
    |       ЛЕВОЕ СОЕДИНЕНИЕ ВТЗаполненнаяСтатьяПассивов КАК ВТЗаполненнаяСтатьяПассивов
    |       ПО НезаполненнаяАналитика.ВидОперации = ВТЗаполненнаяСтатьяПассивов.ВидОперации
    |           И НезаполненнаяАналитика.ФизическоеЛицо = ВТЗаполненнаяСтатьяПассивов.ФизическоеЛицо
    |           И НезаполненнаяАналитика.Подразделение = ВТЗаполненнаяСтатьяПассивов.Подразделение
    |           И НезаполненнаяАналитика.Контрагент = ВТЗаполненнаяСтатьяПассивов.Контрагент
    |       ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСчетаПоОперациям КАК ВТСчетаПоОперациям
    |       ПО НезаполненнаяАналитика.ВидОперации = ВТСчетаПоОперациям.ВидОперации";
	
	Если ИмяТаблицы = "" Тогда
		ТекстЗапроса = ТекстЗапросаУдержаннаяЗарплата;
	ИначеЕсли ИмяТаблицы = "УдержаннаяЗарплата" Тогда
		ТекстЗапроса = ТекстЗапросаУдержаннаяЗарплата;
	КонецЕсли;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
	Запрос.УстановитьПараметр("ДатаАктуальности", ДатаАктуальности);
	Запрос.Выполнить();
	
КонецПроцедуры

Функция ПредставлениеОтраженияВУчете(ОтражениеВУчете) Экспорт
	
	Результат = НСтр("ru = 'Настроить'");
	
    Если Не ЗначениеЗаполнено(ОтражениеВУчете.СчетУчета) Тогда
    	Возврат Результат;
    КонецЕсли;
    
    МассивПолей = Новый Массив;
    МассивПолей.Добавить(Строка(ОтражениеВУчете.СчетУчета));
    
    СвойстваСчета = ПроцедурыБухгалтерскогоУчетаВызовСервераПовтИсп.ПолучитьСвойстваСчета(ОтражениеВУчете.СчетУчета);
    Для НомерСубконто = 1 По СвойстваСчета.КоличествоСубконто Цикл
    	ЗначениеСубконто = ОтражениеВУчете["Субконто" + НомерСубконто];
    	
    	Если ЗначениеЗаполнено(ЗначениеСубконто) Тогда
    		МассивПолей.Добавить(Строка(ЗначениеСубконто));
    	КонецЕсли;
    	
    КонецЦикла;
    
    Результат = СтрСоединить(МассивПолей, ", ");
    
    Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьПредставлениеСчетаУчетаВТЧ(ТаблицаФормы) Экспорт
	
	Для каждого СтрокаТаблицы Из ТаблицаФормы Цикл
		
		СтрокаТаблицы.ПредставлениеОтраженияВУчете = Документы.ОтражениеЗарплатыВБухучете.ПредставлениеОтраженияВУчете(СтрокаТаблицы);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Проведение

Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ) Экспорт

	ВалютаРеглУчета     = Константы.ВалютаРегламентированногоУчета.Получить();
	
	ПараметрыПроведения = Новый Структура;
	ПараметрыПроведения.Вставить("ВалютаРеглУчета", ВалютаРеглУчета);
	ПараметрыПроведения.Вставить("ДокументСсылка",  ДокументСсылка);
	
	Запрос = Новый Запрос;
	МенеджерВременныхТаблиц  = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("ВалютаРеглУчета", ВалютаРеглУчета);
	
	НомераТаблиц = Новый Структура;
	
	Запрос.Текст = ТекстЗапросаРеквизитыДокумента(НомераТаблиц);
	Результат = Запрос.ВыполнитьПакет();
	ТаблицаРеквизиты = Результат[НомераТаблиц["Реквизиты"]].Выгрузить();
	ПараметрыПроведения.Вставить("Реквизиты", ТаблицаРеквизиты);
	
	Реквизиты = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ТаблицаРеквизиты[0]);

	Если НЕ УчетнаяПолитикаСервер.Существует(Реквизиты.Организация, Реквизиты.Дата, "БУ", Истина, ДокументСсылка)
		ИЛИ НЕ УчетнаяПолитикаСервер.Существует(Реквизиты.Организация, Реквизиты.Дата, "НУ", Истина, ДокументСсылка) Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат ПараметрыПроведения;
	КонецЕсли;      
	
	ОрганизацияПлательщикНалогаНаПрибыль 			= ПроцедурыНалоговогоУчета.ПолучитьПризнакПлательщикаНалогаНаПрибыль(Реквизиты.Организация, Реквизиты.Дата);
	ВедениеУчетаПоСотрудникам = ОбщегоНазначенияБК.ПолучитьПризнакВеденияУчетаПоСотрудникам();
    ИспользуютсяРезервыОплатыТруда = Справочники.НастройкиРасчетаРезервовПоОплатеТруда.ФормируютсяРезервыВОрганизации(Реквизиты.Организация, Реквизиты.ПериодРегистрации);
	
	// пустая ссылка на счет - для проверок способов отражения в бухучете и в налоговом учете
	ПустойСчет 		= ПланыСчетов.Типовой.ПустаяСсылка();
	ПустойСчетНУ 	= ПланыСчетов.Налоговый.ПустаяСсылка();

	Реквизиты.Вставить("ВедениеУчетаПоСотрудникам", 				     ВедениеУчетаПоСотрудникам);		
	Реквизиты.Вставить("ИспользуютсяРезервыОплатыТруда", 				 ИспользуютсяРезервыОплатыТруда);		
	
	ПараметрыПроведения.Реквизиты.ЗаполнитьЗначения(ВедениеУчетаПоСотрудникам, "ВедениеУчетаПоСотрудникам");
	
	Запрос.УстановитьПараметр("ПериодРегистрации", 					Реквизиты.ПериодРегистрации);
	Запрос.УстановитьПараметр("парамПустойСпособБУ", 				Справочники.СпособыОтраженияЗарплатыВБухУчете.ПустаяСсылка());

	Запрос.УстановитьПараметр("парамПустойСчет", 					ПустойСчет);
	Запрос.УстановитьПараметр("парамПустойСчетНУ", 					ПустойСчетНУ);

	Запрос.УстановитьПараметр("ВедениеУчетаПоСотрудникам"      , ВедениеУчетаПоСотрудникам);
	Запрос.УстановитьПараметр("ИспользуютсяРезервыОплатыТруда" , ИспользуютсяРезервыОплатыТруда);
	Запрос.УстановитьПараметр("ВидСубконтоРаботникиОрганизаций", ПланыВидовХарактеристик.ВидыСубконтоТиповые.РаботникиОрганизаций);
	
	// ВидыСубконтоТиповые	                                                                             
	Запрос.УстановитьПараметр("парамВидСубконтоРаботникиОрганизаций", 	ПланыВидовХарактеристик.ВидыСубконтоТиповые.РаботникиОрганизаций);
	Запрос.УстановитьПараметр("парамВидСубконтоКонтрагенты", 			ПланыВидовХарактеристик.ВидыСубконтоТиповые.Контрагенты);
	Запрос.УстановитьПараметр("парамВидСубконтоСтатьиЗатрат", 			ПланыВидовХарактеристик.ВидыСубконтоТиповые.СтатьиЗатрат);
	Запрос.УстановитьПараметр("парамВидСубконтоПодразделения", 			ПланыВидовХарактеристик.ВидыСубконтоТиповые.Подразделения);
	Запрос.УстановитьПараметр("парамВидСубконтоВидПлатежа", 			ПланыВидовХарактеристик.ВидыСубконтоТиповые.ВидыПлатежейВБюджетИФонды);
	Запрос.УстановитьПараметр("парамВидСубконтоРезервы", 				ПланыВидовХарактеристик.ВидыСубконтоТиповые.Резервы);
	Запрос.УстановитьПараметр("парамВидСубконтоДоговорыКонтрагентов", 	ПланыВидовХарактеристик.ВидыСубконтоТиповые.Договоры);
	
	// Дорофеева А. 10.01.2025 Кибернетика
	Запрос.УстановитьПараметр("СоциальныеОтчисления", 							Справочники.СтатьиЗатрат.НайтиПоКоду("000379   "));//Справочники.СтатьиЗатрат.НайтиПоНаименованию("Социальные отчисления (резерв отпусков)"));
	Запрос.УстановитьПараметр("СоциальныйНалог", 								Справочники.СтатьиЗатрат.НайтиПоКоду("000380   "));//Справочники.СтатьиЗатрат.НайтиПоНаименованию("Социальный налог (резерв отпусков)"));
	Запрос.УстановитьПараметр("ОбязательныеПенсионныеВзносыРаботодателя", 		Справочники.СтатьиЗатрат.НайтиПоКоду("000381   "));//Справочники.СтатьиЗатрат.НайтиПоНаименованию("Обязательные пенсионные взносы работодателя (резерв отпусков)"));
	Запрос.УстановитьПараметр("ОбязательныеПрофессиональныеПенсионныеВзносы", 	Справочники.СтатьиЗатрат.НайтиПоКоду("000383   "));//Справочники.СтатьиЗатрат.НайтиПоНаименованию("Обязательные профессиональные пенсионные взносы (резерв отпусков)"));
	Запрос.УстановитьПараметр("ОтчисленияОСМС", 								Справочники.СтатьиЗатрат.НайтиПоКоду("000382   "));//Справочники.СтатьиЗатрат.НайтиПоНаименованию("Отчисления ОСМС (резерв отпусков)"));
	Запрос.УстановитьПараметр("ФОТ", 											Справочники.СтатьиЗатрат.НайтиПоКоду("000384   "));//Справочники.СтатьиЗатрат.НайтиПоНаименованию("ФОТ"));
	//********************
	
	// ПланСчетов
	Запрос.УстановитьПараметр("парамПустойСчет", 					ПустойСчет);
	Запрос.УстановитьПараметр("парамПустойСчетНУ", 					ПустойСчетНУ);
	
	СчетКраткосрочнаяЗадолженностьПоОплатеТруда = ПланыСчетов.Типовой.КраткосрочнаяЗадолженностьПоОплатеТруда;
	СчетНУКраткосрочнаяЗадолженностьПоОплатеТруда = СчетКраткосрочнаяЗадолженностьПоОплатеТруда.СчетНУ;
	СчетКраткосрочныеВознагражденияКПолучениюРаботникам =  ПланыСчетов.Типовой.КраткосрочныеВознагражденияКПолучениюРаботникам;
	СчетНУКраткосрочныеВознагражденияКПолучениюРаботникам = СчетКраткосрочныеВознагражденияКПолучениюРаботникам.СчетНУ;
	
	Запрос.УстановитьПараметр("СчетНУКраткосрочнаяЗадолженностьПоОплатеТруда", СчетНУКраткосрочнаяЗадолженностьПоОплатеТруда);
	Запрос.УстановитьПараметр("СчетНУКраткосрочныеВознагражденияКПолучениюРаботникам", СчетНУКраткосрочныеВознагражденияКПолучениюРаботникам);
	
	МассивВидыОперацийРезервы = Новый Массив();
	МассивВидыОперацийРезервы.Добавить(ПредопределенноеЗначение("Перечисление.ВидыОперацийПоЗарплате.ЕжегодныйОтпускОценочныеОбязательстваИРезервы"));
	МассивВидыОперацийРезервы.Добавить(ПредопределенноеЗначение("Перечисление.ВидыОперацийПоЗарплате.ЕжегодныйОтпускРезервы"));
	МассивВидыОперацийРезервы.Добавить(ПредопределенноеЗначение("Перечисление.ВидыОперацийПоЗарплате.КомпенсацияЕжегодногоОтпускаОценочныеОбязательства"));
	МассивВидыОперацийРезервы.Добавить(ПредопределенноеЗначение("Перечисление.ВидыОперацийПоЗарплате.ЕжегодныйОтпускОценочныеОбязательства"));
	
	Запрос.УстановитьПараметр("МассивВидыОперацийРезервы", МассивВидыОперацийРезервы);
	
	ВедениеУчетаВременныхРазницБалансовымМетодом = УчетнаяПолитикаСервер.ВедетсяУчетВременныхРазницБалансовымМетодом(Реквизиты.Организация, Реквизиты.Дата);
	Запрос.УстановитьПараметр("ВедениеУчетаВременныхРазницБалансовымМетодом", ВедениеУчетаВременныхРазницБалансовымМетодом);
	
	ПоддержкаРаботыСоСтруктурнымиПодразделениями = ПолучитьФункциональнуюОпцию("ПоддержкаРаботыСоСтруктурнымиПодразделениями");	
	Запрос.УстановитьПараметр("ПоддержкаРаботыСоСтруктурнымиПодразделениями", ПоддержкаРаботыСоСтруктурнымиПодразделениями);
	Запрос.УстановитьПараметр("ПустоеПодразделение", Справочники.ПодразделенияОрганизаций.ПустаяСсылка());
    Запрос.УстановитьПараметр("ОбособленноеПодразделение", Реквизиты.Организация);
    
	ДанныеНалоговыйКомитет = Новый Структура;
	
	ЗаполнятьНКпоИПНВНУ = ПланыСчетов.Налоговый.ИндивидуальныйПодоходныйНалог.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоТиповые.Контрагенты) <> Неопределено;
	ЗаполнятьНКпоСНВНУ	= ПланыСчетов.Налоговый.ПрочиеНалоги.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоТиповые.Контрагенты) <> Неопределено;
	ЗаполнятьНКпоИПН 	= ПланыСчетов.Типовой.ИндивидуальныйПодоходныйНалог.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоТиповые.Контрагенты) <> Неопределено;
	ЗаполнятьНКпоСН		= ПланыСчетов.Типовой.СоциальныйНалог.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоТиповые.Контрагенты) <> Неопределено;
	
	Если ПоддержкаРаботыСоСтруктурнымиПодразделениями Тогда
		ИсчислениеНалоговСтруктурныхЕдиниц = ПолныеПраваПовтИсп.ЗаполнитьИсчислениеНалоговСтруктурныхЕдиниц();
	Иначе
		ЗаполнятьНКпоИПН 	= Ложь;
		ЗаполнятьНКпоСН 	= Ложь;
		ЗаполнятьНКпоИПНВНУ = Ложь;
		ЗаполнятьНКпоСНВНУ 	= Ложь;
	КонецЕсли;
	
	ДанныеНалоговыйКомитет.Вставить("ЗаполнятьНКпоИПНВНУ", ЗаполнятьНКпоИПНВНУ);
	ДанныеНалоговыйКомитет.Вставить("ЗаполнятьНКпоСНВНУ",  ЗаполнятьНКпоСНВНУ);
	ДанныеНалоговыйКомитет.Вставить("ЗаполнятьНКпоИПН",    ЗаполнятьНКпоИПН);
	ДанныеНалоговыйКомитет.Вставить("ЗаполнятьНКпоСН",     ЗаполнятьНКпоСН);
	ДанныеНалоговыйКомитет.Вставить("ИсчислениеНалоговСтруктурныхЕдиниц",    ИсчислениеНалоговСтруктурныхЕдиниц);
	
	НомераТаблиц = Новый Структура;
	
	ТекстЗапроса = ТекстЗапросаВременныеТаблицыДокументыКОтражению();
	
    Если Реквизиты.ВидОперации = Перечисления.ВидыОперацийОтражениеЗарплатыВБухучете.ОтражениеОценочныхОбязательств Тогда
		ТекстЗапроса = ТекстЗапроса + ТекстЗапросаВременныеТаблицыДокументаОтражениеОценочныхОбязательств();
	ИначеЕсли Реквизиты.ВидОперации = Перечисления.ВидыОперацийОтражениеЗарплатыВБухучете.ОтражениеРезервовОплатыТруда Тогда
		ТекстЗапроса = ТекстЗапроса + ТекстЗапросаВременныеТаблицыДокументаОтражениеРезервовОплатыТруда();
	Иначе
		ТекстЗапроса = ТекстЗапроса + ТекстЗапросаВременныеТаблицыДокументаОтражениеЗарплаты();
	КонецЕсли;

	Запрос.Текст = ТекстЗапроса;
	
	Запрос.Выполнить();
	Налогоплательщик = Реквизиты.Организация;
	НалогоплательщикНДС = Реквизиты.Организация;
	ПоддержкаРаботыСоСтруктурнымиПодразделениями = ПолучитьФункциональнуюОпцию("ПоддержкаРаботыСоСтруктурнымиПодразделениями");	
	Если ПоддержкаРаботыСоСтруктурнымиПодразделениями Тогда
		Налогоплательщик = ПроцедурыНалоговогоУчетаВызовСервераПовтИсп.ПолучитьНалогоплательщикаСтруктурнойЕдиницы(Реквизиты.Организация,
									Реквизиты.Организация,
									Перечисления.РазделыНалоговогоУчета.НалогиСЗаработнойПлаты);
		НалогоплательщикНДС = ПроцедурыНалоговогоУчетаВызовСервераПовтИсп.ПолучитьНалогоплательщикаСтруктурнойЕдиницы(Реквизиты.Организация,
									Реквизиты.Организация,
									Перечисления.РазделыНалоговогоУчета.НДС);
	КонецЕсли;	
	Запрос.УстановитьПараметр("Налогоплательщик"         , Налогоплательщик);  
	Запрос.УстановитьПараметр("НалогоплательщикНДС"      , НалогоплательщикНДС);  
	
	ТекстЗапроса = ТекстЗапросаПоОтражениюВУчете(НомераТаблиц);
	
    Если Реквизиты.ВидОперации = Перечисления.ВидыОперацийОтражениеЗарплатыВБухучете.ОтражениеЗарплатыВзносовУдержаний Тогда
		
		ТекстЗапроса = ТекстЗапроса 
	                   + ТекстЗапросаОборотПоПриобретеннымУслугамГПХВЦеляхНДС(НомераТаблиц)
	                   + ТекстЗапросаВзаиморасчетыСПолучателямиИЛ(НомераТаблиц);
		
	Иначе
		
		ПустаяТаблица = Новый ТаблицаЗначений;
		ПараметрыПроведения.Вставить("ВзаиморасчетыСПолучателямиИЛ", ПустаяТаблица);
		ПараметрыПроведения.Вставить("ТаблицаОборотПоПриобретеннымУслугамГПХВЦеляхНДС", ПустаяТаблица);
					   
	КонецЕсли;	
				   
	Запрос.Текст = ТекстЗапроса; 
		
	Результат = Запрос.ВыполнитьПакет();

	Для Каждого НомерТаблицы ИЗ НомераТаблиц Цикл
		Если НомерТаблицы.Ключ = "ТаблицаОтражениеВУчетеБУ"
			ИЛИ НомерТаблицы.Ключ = "ТаблицаОтражениеВУчетеНУ" Тогда
			ТаблицаОтражениеВУчете = Результат[НомерТаблицы.Значение].Выгрузить();
			Для каждого СтрокаДанных Из ТаблицаОтражениеВУчете Цикл
				АвтозаполнениеСубконто(СтрокаДанных, ПустойСчет, ПустойСчетНУ, , ДанныеНалоговыйКомитет);
			КонецЦикла;
			ПараметрыПроведения.Вставить(НомерТаблицы.Ключ, ТаблицаОтражениеВУчете);
		Иначе
			ПараметрыПроведения.Вставить(НомерТаблицы.Ключ, Результат[НомерТаблицы.Значение].Выгрузить());
		КонецЕсли;
	КонецЦикла;

	Возврат ПараметрыПроведения;
КонецФункции

Функция ТекстЗапросаРеквизитыДокумента(НомераТаблиц)
	
	НомераТаблиц.Вставить("ВременнаяТаблицаРеквизиты", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("Реквизиты", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК Ссылка,
	|	Реквизиты.Ссылка КАК Регистратор,
	|	Реквизиты.Дата КАК Дата,
	|	ВЫБОР
	|		КОГДА Реквизиты.Дата >= Реквизиты.ПериодРегистрации
	|				И Реквизиты.Дата <= КОНЕЦПЕРИОДА(Реквизиты.ПериодРегистрации, МЕСЯЦ)
	|			ТОГДА Реквизиты.Дата
	|		ИНАЧЕ КОНЕЦПЕРИОДА(Реквизиты.ПериодРегистрации, МЕСЯЦ)
	|	КОНЕЦ КАК Период,
	|	Реквизиты.Номер КАК Номер,
	|	Реквизиты.Организация КАК Организация,
	|	Реквизиты.ПериодРегистрации КАК ПериодРегистрации,
	|	Реквизиты.ВидОперации КАК ВидОперации,
	|	Реквизиты.ВидОперацииРезервовПоОплатеТруда КАК ВидОперацииРезервовПоОплатеТруда,
	|	&ВалютаРеглУчета КАК ВалютаРеглУчета,
	|	ЛОЖЬ КАК ВедениеУчетаПоСотрудникам,
	|	ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.НУ) КАК ВидУчетаНУ
	|ПОМЕСТИТЬ Реквизиты
	|ИЗ
	|	Документ.ОтражениеЗарплатыВБухучете КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК Ссылка,
	|	Реквизиты.Ссылка КАК Регистратор,
	|	Реквизиты.Дата КАК Дата,
	|	Реквизиты.Период КАК Период,
	|	Реквизиты.Номер КАК Номер,
	|	Реквизиты.Организация КАК Организация,
	|	Реквизиты.ПериодРегистрации КАК ПериодРегистрации,
	|	Реквизиты.ВидОперации КАК ВидОперации,
	|	Реквизиты.ВидОперацииРезервовПоОплатеТруда КАК ВидОперацииРезервовПоОплатеТруда,
	|	Реквизиты.ВалютаРеглУчета КАК ВалютаРеглУчета,
	|	Реквизиты.ВедениеУчетаПоСотрудникам КАК ВедениеУчетаПоСотрудникам,
	|	Реквизиты.ВидУчетаНУ КАК ВидУчетаНУ
	|ИЗ
	|	Реквизиты КАК Реквизиты";

	Возврат ТекстЗапроса + ОбщегоНазначенияБКВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

Функция ТекстЗапросаВременныеТаблицыДокументыКОтражению()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
    |   ОтражениеЗарплатыВБухучете.Ссылка КАК Ссылка,
    |   ОтражениеЗарплатыВБухучете.Организация КАК Организация,
    |   ОтражениеЗарплатыВБухучете.Резерв КАК Резерв,
    |   ОтражениеЗарплатыВБухучете.ВидОперации КАК ВидОперации
    |ПОМЕСТИТЬ ДокументыКОтражению
    |ИЗ
    |   Документ.ОтражениеЗарплатыВБухучете КАК ОтражениеЗарплатыВБухучете
    |ГДЕ
    |   ОтражениеЗарплатыВБухучете.Ссылка = &Ссылка
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////";

	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВременныеТаблицыДокументаОтражениеЗарплаты()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	//Сухомлинов++
	|   Зарплата.киб_Начисление КАК киб_Начисление,
	|   Зарплата.киб_Участок КАК киб_Участок,
	//Сухомлинов--
	|   Зарплата.Ссылка КАК Ссылка,
    |   ДокументыКОтражению.Организация КАК Организация,
    |   Зарплата.НомерСтроки КАК НомерСтроки,
    |   Зарплата.Подразделение КАК Подразделение,
    |   Зарплата.ВидОперации КАК ВидОперации,
    |   Зарплата.СпособОтраженияЗарплатыВБухучете КАК СпособОтраженияЗарплатыВБухучете,
    |   Зарплата.СтруктурноеПодразделение КАК СтруктурноеПодразделение,
    |   Зарплата.ФизическоеЛицо КАК ФизическоеЛицо,
    |   Зарплата.Контрагент КАК Контрагент,
    |   Зарплата.ДоговорКонтрагента КАК ДоговорКонтрагента,
    |   Зарплата.Резерв КАК РезервОплатыТруда,
    |   Зарплата.РезервБУ КАК РезервБУ,
    |   Зарплата.РезервНУ КАК РезервНУ,
    |   СУММА(ВЫБОР
    |           КОГДА Зарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.НатуральныйДоход)
    |               ТОГДА 0
    |           ИНАЧЕ Зарплата.Сумма
    |       КОНЕЦ) КАК Сумма,
    |   СУММА(Зарплата.СН) КАК СН,
    |   СУММА(Зарплата.СО) КАК СО,
    |   СУММА(Зарплата.ОППВ) КАК ОППВ,
    |   СУММА(Зарплата.ОПВР) КАК ОПВР,
    |   СУММА(Зарплата.ООСМС) КАК ООСМС,
    |   СУММА(Зарплата.ЕП) КАК ЕП,
	|	ВЫБОР
	|		КОГДА &ИспользуютсяРезервыОплатыТруда
	|			ТОГДА Зарплата.Резерв
	|		ИНАЧЕ ДокументыКОтражению.Резерв
	|	КОНЕЦ КАК Резерв
	|ПОМЕСТИТЬ ВТТаблицаЗарплатаИВзносы
    |ИЗ
    |   Документ.ОтражениеЗарплатыВБухучете.НачисленнаяЗарплатаИВзносы КАК Зарплата
    |       ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКОтражению КАК ДокументыКОтражению
    |       ПО Зарплата.Ссылка = ДокументыКОтражению.Ссылка
    |
    |СГРУППИРОВАТЬ ПО
	//Сухомлинов++
	|   Зарплата.киб_Начисление,
	|   Зарплата.киб_Участок,
	//Сухомлинов--
    |   Зарплата.Подразделение,
    |   Зарплата.ВидОперации,
    |   Зарплата.СпособОтраженияЗарплатыВБухучете,
    |   Зарплата.СтруктурноеПодразделение,
    |   Зарплата.Ссылка,
    |   ДокументыКОтражению.Организация,
    |   Зарплата.НомерСтроки,
    |   Зарплата.ФизическоеЛицо,
    |   Зарплата.Контрагент,
    |   Зарплата.Резерв,
    |   Зарплата.РезервБУ,
    |   Зарплата.РезервНУ,
    |   Зарплата.ДоговорКонтрагента,
    |   ДокументыКОтражению.Резерв
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |   ПеняПоВзносамИОтчислениям.Ссылка КАК Ссылка,
    |   ПеняПоВзносамИОтчислениям.Ссылка.Организация КАК Организация,
    |   ПеняПоВзносамИОтчислениям.НомерСтроки КАК НомерСтроки,
    |   ПеняПоВзносамИОтчислениям.Подразделение КАК Подразделение,
    |   ПеняПоВзносамИОтчислениям.ВидОперации КАК ВидОперации,
    |   ПеняПоВзносамИОтчислениям.СпособОтраженияЗарплатыВБухучете КАК СпособОтраженияЗарплатыВБухучете,
    |   ПеняПоВзносамИОтчислениям.ВидПлатежа КАК ВидПлатежа,
    |   ПеняПоВзносамИОтчислениям.ФизическоеЛицо КАК ФизическоеЛицо,
    |   СУММА(ПеняПоВзносамИОтчислениям.Сумма) КАК Сумма,
    |   ПеняПоВзносамИОтчислениям.СтруктурноеПодразделение КАК СтруктурноеПодразделение
    |ПОМЕСТИТЬ ВТТаблицаПени
    |ИЗ
    |   Документ.ОтражениеЗарплатыВБухучете.ПеняПоВзносамИОтчислениям КАК ПеняПоВзносамИОтчислениям
    |       ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКОтражению КАК ДокументыКОтражению
    |       ПО ПеняПоВзносамИОтчислениям.Ссылка = ДокументыКОтражению.Ссылка
    |
    |СГРУППИРОВАТЬ ПО
    |   ПеняПоВзносамИОтчислениям.Ссылка,
    |   ПеняПоВзносамИОтчислениям.Ссылка.Организация,
    |   ПеняПоВзносамИОтчислениям.НомерСтроки,
    |   ПеняПоВзносамИОтчислениям.Подразделение,
    |   ПеняПоВзносамИОтчислениям.ВидОперации,
    |   ПеняПоВзносамИОтчислениям.СпособОтраженияЗарплатыВБухучете,
    |   ПеняПоВзносамИОтчислениям.ВидПлатежа,
    |   ПеняПоВзносамИОтчислениям.ФизическоеЛицо,
    |   ПеняПоВзносамИОтчислениям.СтруктурноеПодразделение
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |   РегламентированныеУдержания.Ссылка КАК Ссылка,
    |   РегламентированныеУдержания.Ссылка.Организация КАК Организация,
    |   РегламентированныеУдержания.НомерСтроки КАК НомерСтроки,
    |   РегламентированныеУдержания.Подразделение КАК Подразделение,
    |   РегламентированныеУдержания.ВидОперации КАК ВидОперации,
    |   РегламентированныеУдержания.ФизическоеЛицо КАК ФизическоеЛицо,
    |   РегламентированныеУдержания.Контрагент КАК Контрагент,
    |   РегламентированныеУдержания.ДоговорКонтрагента КАК ДоговорКонтрагента,
    |   СУММА(РегламентированныеУдержания.Сумма) КАК Сумма,
    |   РегламентированныеУдержания.СтруктурноеПодразделение КАК СтруктурноеПодразделение
    |ПОМЕСТИТЬ ВТТаблицаРегламентированныеУдержания
    |ИЗ
    |   Документ.ОтражениеЗарплатыВБухучете.РегламентированныеУдержания КАК РегламентированныеУдержания
    |       ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКОтражению КАК ДокументыКОтражению
    |       ПО РегламентированныеУдержания.Ссылка = ДокументыКОтражению.Ссылка
    |
    |СГРУППИРОВАТЬ ПО
    |   РегламентированныеУдержания.Ссылка,
    |   РегламентированныеУдержания.Ссылка.Организация,
    |   РегламентированныеУдержания.НомерСтроки,
    |   РегламентированныеУдержания.Подразделение,
    |   РегламентированныеУдержания.ВидОперации,
    |   РегламентированныеУдержания.ФизическоеЛицо,
    |   РегламентированныеУдержания.Контрагент,
    |   РегламентированныеУдержания.ДоговорКонтрагента,
    |   РегламентированныеУдержания.СтруктурноеПодразделение
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |   ОтражениеЗарплатыВБухучетеУдержаннаяЗарплата.Ссылка КАК Ссылка,
    |   ОтражениеЗарплатыВБухучетеУдержаннаяЗарплата.Ссылка.Организация КАК Организация,
    |   ОтражениеЗарплатыВБухучетеУдержаннаяЗарплата.НомерСтроки КАК НомерСтроки,
    |   ОтражениеЗарплатыВБухучетеУдержаннаяЗарплата.Подразделение КАК Подразделение,
    |   ОтражениеЗарплатыВБухучетеУдержаннаяЗарплата.ВидОперации КАК ВидОперации,
    |   ОтражениеЗарплатыВБухучетеУдержаннаяЗарплата.ФизическоеЛицо КАК ФизическоеЛицо,
    |   СУММА(ОтражениеЗарплатыВБухучетеУдержаннаяЗарплата.Сумма) КАК Сумма,
    |   ОтражениеЗарплатыВБухучетеУдержаннаяЗарплата.СтруктурноеПодразделение КАК СтруктурноеПодразделение,
    |   ОтражениеЗарплатыВБухучетеУдержаннаяЗарплата.Контрагент КАК Контрагент,
    |   ОтражениеЗарплатыВБухучетеУдержаннаяЗарплата.КонтрагентОтправитель КАК КонтрагентОтправитель,
    |   ОтражениеЗарплатыВБухучетеУдержаннаяЗарплата.РаботникОрганизации КАК РаботникОрганизации,
    |   ОтражениеЗарплатыВБухучетеУдержаннаяЗарплата.СчетУчета КАК СчетУчета,
    |   ОтражениеЗарплатыВБухучетеУдержаннаяЗарплата.Субконто1 КАК Субконто1,
    |   ОтражениеЗарплатыВБухучетеУдержаннаяЗарплата.Субконто2 КАК Субконто2,
    |   ОтражениеЗарплатыВБухучетеУдержаннаяЗарплата.Субконто3 КАК Субконто3
    |ПОМЕСТИТЬ ВТТаблицаУдержаннаяЗарплата
    |ИЗ
    |   Документ.ОтражениеЗарплатыВБухучете.УдержаннаяЗарплата КАК ОтражениеЗарплатыВБухучетеУдержаннаяЗарплата
    |       ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКОтражению КАК ДокументыКОтражению
    |       ПО ОтражениеЗарплатыВБухучетеУдержаннаяЗарплата.Ссылка = ДокументыКОтражению.Ссылка
    |
    |СГРУППИРОВАТЬ ПО
    |   ОтражениеЗарплатыВБухучетеУдержаннаяЗарплата.Ссылка,
    |   ОтражениеЗарплатыВБухучетеУдержаннаяЗарплата.Ссылка.Организация,
    |   ОтражениеЗарплатыВБухучетеУдержаннаяЗарплата.НомерСтроки,
    |   ОтражениеЗарплатыВБухучетеУдержаннаяЗарплата.Подразделение,
    |   ОтражениеЗарплатыВБухучетеУдержаннаяЗарплата.ВидОперации,
    |   ОтражениеЗарплатыВБухучетеУдержаннаяЗарплата.ФизическоеЛицо,
    |   ОтражениеЗарплатыВБухучетеУдержаннаяЗарплата.СтруктурноеПодразделение,
    |   ОтражениеЗарплатыВБухучетеУдержаннаяЗарплата.Контрагент,
    |   ОтражениеЗарплатыВБухучетеУдержаннаяЗарплата.КонтрагентОтправитель,
    |   ОтражениеЗарплатыВБухучетеУдержаннаяЗарплата.РаботникОрганизации,
    |   ОтражениеЗарплатыВБухучетеУдержаннаяЗарплата.СчетУчета,
    |   ОтражениеЗарплатыВБухучетеУдержаннаяЗарплата.Субконто1,
    |   ОтражениеЗарплатыВБухучетеУдержаннаяЗарплата.Субконто2,
    |   ОтражениеЗарплатыВБухучетеУдержаннаяЗарплата.Субконто3
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |   ОтражениеЗарплатыВБухучетеУдержаннаяЗарплата.Ссылка КАК Ссылка,
    |   ОтражениеЗарплатыВБухучетеУдержаннаяЗарплата.Контрагент КАК Получатель,
    |   СУММА(ОтражениеЗарплатыВБухучетеУдержаннаяЗарплата.Сумма) КАК СуммаВзаиморасчетов,
    |   ОтражениеЗарплатыВБухучетеУдержаннаяЗарплата.Подразделение КАК ПодразделениеОрганизации,
    |   0 КАК СуммаСборов,
    |   ВЫБОР
    |       КОГДА &ПоддержкаРаботыСоСтруктурнымиПодразделениями
    |               И ОтражениеЗарплатыВБухучетеУдержаннаяЗарплата.СтруктурноеПодразделение.ЯвляетсяСтруктурнымПодразделением
    |           ТОГДА ОтражениеЗарплатыВБухучетеУдержаннаяЗарплата.СтруктурноеПодразделение
    |       ИНАЧЕ &ОбособленноеПодразделение
    |   КОНЕЦ КАК СтруктурнаяЕдиница,
    |   ОтражениеЗарплатыВБухучетеУдержаннаяЗарплата.ДокументОснование КАК ДокументОснование
    |ПОМЕСТИТЬ ВТ_ВзаиморасчетыСПолучателямиИЛ
    |ИЗ
    |   Документ.ОтражениеЗарплатыВБухучете.УдержаннаяЗарплата КАК ОтражениеЗарплатыВБухучетеУдержаннаяЗарплата
    |ГДЕ
    |   ОтражениеЗарплатыВБухучетеУдержаннаяЗарплата.Ссылка = &Ссылка
    |   И ОтражениеЗарплатыВБухучетеУдержаннаяЗарплата.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.АлиментыПрочиеИсполнительныеЛисты), ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.АлиментыПрочиеИсполнительныеЛистыКонтрагенты))
    |
    |СГРУППИРОВАТЬ ПО
    |   ОтражениеЗарплатыВБухучетеУдержаннаяЗарплата.Ссылка,
    |   ОтражениеЗарплатыВБухучетеУдержаннаяЗарплата.Контрагент,
    |   ОтражениеЗарплатыВБухучетеУдержаннаяЗарплата.Подразделение,
    |   ВЫБОР
    |       КОГДА &ПоддержкаРаботыСоСтруктурнымиПодразделениями
    |               И ОтражениеЗарплатыВБухучетеУдержаннаяЗарплата.СтруктурноеПодразделение.ЯвляетсяСтруктурнымПодразделением
    |           ТОГДА ОтражениеЗарплатыВБухучетеУдержаннаяЗарплата.СтруктурноеПодразделение
    |       ИНАЧЕ &ОбособленноеПодразделение
    |   КОНЕЦ,
    |   ОтражениеЗарплатыВБухучетеУдержаннаяЗарплата.ДокументОснование
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |   ОтражениеЗарплатыВБухучетеУдержаннаяЗарплата.Ссылка,
    |   ИсполнительныйЛист.Получатель,
    |   0,
    |   ОтражениеЗарплатыВБухучетеУдержаннаяЗарплата.Подразделение,
    |   СУММА(ОтражениеЗарплатыВБухучетеУдержаннаяЗарплата.Сумма),
    |   ВЫБОР
    |       КОГДА &ПоддержкаРаботыСоСтруктурнымиПодразделениями
    |               И ОтражениеЗарплатыВБухучетеУдержаннаяЗарплата.СтруктурноеПодразделение.ЯвляетсяСтруктурнымПодразделением
    |           ТОГДА ОтражениеЗарплатыВБухучетеУдержаннаяЗарплата.СтруктурноеПодразделение
    |       ИНАЧЕ &ОбособленноеПодразделение
    |   КОНЕЦ,
    |   ОтражениеЗарплатыВБухучетеУдержаннаяЗарплата.ДокументОснование
    |ИЗ
    |   Документ.ОтражениеЗарплатыВБухучете.УдержаннаяЗарплата КАК ОтражениеЗарплатыВБухучетеУдержаннаяЗарплата
    |       ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИсполнительныйЛист КАК ИсполнительныйЛист
    |       ПО ОтражениеЗарплатыВБухучетеУдержаннаяЗарплата.ДокументОснование = ИсполнительныйЛист.Ссылка
    |ГДЕ
    |   ОтражениеЗарплатыВБухучетеУдержаннаяЗарплата.Ссылка = &Ссылка
    |   И ОтражениеЗарплатыВБухучетеУдержаннаяЗарплата.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВознаграждениеПлатежногоАгента), ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВознаграждениеПлатежногоАгентаКонтрагенты))
    |
    |СГРУППИРОВАТЬ ПО
    |   ОтражениеЗарплатыВБухучетеУдержаннаяЗарплата.Ссылка,
    |   ОтражениеЗарплатыВБухучетеУдержаннаяЗарплата.Подразделение,
    |   ВЫБОР
    |       КОГДА &ПоддержкаРаботыСоСтруктурнымиПодразделениями
    |               И ОтражениеЗарплатыВБухучетеУдержаннаяЗарплата.СтруктурноеПодразделение.ЯвляетсяСтруктурнымПодразделением
    |           ТОГДА ОтражениеЗарплатыВБухучетеУдержаннаяЗарплата.СтруктурноеПодразделение
    |       ИНАЧЕ &ОбособленноеПодразделение
    |   КОНЕЦ,
    |   ОтражениеЗарплатыВБухучетеУдержаннаяЗарплата.ДокументОснование,
    |   ИсполнительныйЛист.Получатель
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
	//Сухомлинов++
    |   ВТТаблицаЗарплатаИВзносы.киб_Участок КАК киб_Участок,
	//Сухомлинов--
    |   ВТТаблицаЗарплатаИВзносы.Ссылка КАК Ссылка,
    |   ВТТаблицаЗарплатаИВзносы.НомерСтроки КАК НомерСтроки,
    |   ВТТаблицаЗарплатаИВзносы.Подразделение КАК Подразделение,
    |   ВТТаблицаЗарплатаИВзносы.ВидОперации КАК ВидОперации,
    |   ВТТаблицаЗарплатаИВзносы.ФизическоеЛицо КАК ФизическоеЛицо,
    |   ВТТаблицаЗарплатаИВзносы.СтруктурноеПодразделение КАК СтруктурноеПодразделение,
    |   ВТТаблицаЗарплатаИВзносы.Резерв КАК Резерв,
    |   ВТТаблицаЗарплатаИВзносы.Контрагент КАК Контрагент,
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.ПустаяСсылка) КАК ВидПлатежа,
    |   ВЫБОР
    |       КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |           ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1
    |       ИНАЧЕ ВТТаблицаЗарплатаИВзносы.Подразделение
    |   КОНЕЦ КАК ПодразделениеБУ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |           ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоНУ1
    |       ИНАЧЕ ВТТаблицаЗарплатаИВзносы.Подразделение
    |   КОНЕЦ КАК ПодразделениеНУ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СчетБУ
    |       КОГДА ВТТаблицаЗарплатаИВзносы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.Дивиденды)
    |           ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Типовой.НераспределеннаяПрибыльНепокрытыйУбытокОтчетногоГода)
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы)
    |   КОНЕЦ КАК СчетДт,
	|   ВЫБОР
	|       КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
	|               И ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
	
	//Сухомлинов++
	//|           ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1
	|			 ТОГДА ВЫБОР
	|				КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1 ССЫЛКА Справочник.СтатьиЗатрат
	|					ТОГДА ЕСТЬNULL(киб_СоответствиеСпособовОтраженияНачисленийИСтатейЗатратСрезПоследних.СтатьяЗатрат, ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1)
	|				ИНАЧЕ ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1
	|			КОНЕЦ  
	//Сухомлинов--
	
	|       КОГДА ВТТаблицаЗарплатаИВзносы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.Дивиденды)
	|           ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыИзмененийВСобственномКапитале.Дивиденды)
	|       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка)
	|   КОНЕЦ КАК СубконтоДт1,  
    |   ВЫБОР
    |       КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
	
	//Сухомлинов++
	//|           ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2
	|			 ТОГДА ВЫБОР
	|				КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2 ССЫЛКА Справочник.СтатьиЗатрат
	|					ТОГДА ЕСТЬNULL(киб_СоответствиеСпособовОтраженияНачисленийИСтатейЗатратСрезПоследних.СтатьяЗатрат, ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2)
	|				ИНАЧЕ ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2
	|			КОНЕЦ  
	//Сухомлинов--

    |       КОГДА ВТТаблицаЗарплатаИВзносы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.Дивиденды)
    |           ТОГДА НЕОПРЕДЕЛЕНО
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
    |   КОНЕЦ КАК СубконтоДт2,
    |   ВЫБОР
    |       КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
	
	//Сухомлинов++
	//|           ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3
	|			 ТОГДА ВЫБОР
	|				КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3 ССЫЛКА Справочник.СтатьиЗатрат
	|					ТОГДА ЕСТЬNULL(киб_СоответствиеСпособовОтраженияНачисленийИСтатейЗатратСрезПоследних.СтатьяЗатрат, ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3)
	|				ИНАЧЕ ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3
	|			КОНЕЦ  
	//Сухомлинов--
	
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ КАК СубконтоДт3,
    |   ВЫБОР
    |       КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СчетНУ
    |       КОГДА ВТТаблицаЗарплатаИВзносы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.Дивиденды)
    |           ТОГДА ВЫБОР
    |                   КОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.НераспределеннаяПрибыльНепокрытыйУбытокОтчетногоГода) КАК ПланСчетов.Типовой).СчетНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяСсылка)
    |                       ТОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.НераспределеннаяПрибыльНепокрытыйУбытокОтчетногоГода) КАК ПланСчетов.Типовой).СчетНУ
    |                   ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ИтоговаяПрибыльИтоговыйУбытокОтчетногоГода)
    |               КОНЕЦ
    |       КОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы) КАК ПланСчетов.Типовой).СчетНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяСсылка)
    |           ТОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы) КАК ПланСчетов.Типовой).СчетНУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ОбщиеИАдминистративныеРасходы)
    |   КОНЕЦ КАК СчетДтНУ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
	
	//Сухомлинов++
	//|           ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоНУ1
	|			 ТОГДА ВЫБОР
	|				КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоНУ1 ССЫЛКА Справочник.СтатьиЗатрат
	|					ТОГДА ЕСТЬNULL(киб_СоответствиеСпособовОтраженияНачисленийИСтатейЗатратСрезПоследних.СтатьяЗатрат, ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоНУ1)
	|				ИНАЧЕ ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоНУ1
	|			КОНЕЦ  
	//Сухомлинов--
	
    |       КОГДА ВТТаблицаЗарплатаИВзносы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.Дивиденды)
    |           ТОГДА НЕОПРЕДЕЛЕНО
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка)
    |   КОНЕЦ КАК СубконтоДтНУ1,
    |   ВЫБОР
    |       КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
	
	//Сухомлинов++
	//|           ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоНУ2
	|			 ТОГДА ВЫБОР
	|				КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоНУ2 ССЫЛКА Справочник.СтатьиЗатрат
	|					ТОГДА ЕСТЬNULL(киб_СоответствиеСпособовОтраженияНачисленийИСтатейЗатратСрезПоследних.СтатьяЗатрат, ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоНУ2)
	|				ИНАЧЕ ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоНУ2
	|			КОНЕЦ  
	//Сухомлинов--

    |       КОГДА ВТТаблицаЗарплатаИВзносы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.Дивиденды)
    |           ТОГДА НЕОПРЕДЕЛЕНО
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
    |   КОНЕЦ КАК СубконтоДтНУ2,
    |   ВЫБОР
    |       КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
	
	//Сухомлинов++
	//|           ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоНУ3
	|			 ТОГДА ВЫБОР
	|				КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоНУ3 ССЫЛКА Справочник.СтатьиЗатрат
	|					ТОГДА ЕСТЬNULL(киб_СоответствиеСпособовОтраженияНачисленийИСтатейЗатратСрезПоследних.СтатьяЗатрат, ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоНУ3)
	|				ИНАЧЕ ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоНУ3
	|			КОНЕЦ  
	//Сухомлинов--

    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ КАК СубконтоДтНУ3,
    |   ВТТаблицаЗарплатаИВзносы.Сумма КАК Сумма,
    |   ВЫБОР
    |       КОГДА ВТТаблицаЗарплатаИВзносы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВыплатыБывшимСотрудникам)
    |           ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПрочаяКраткосрочнаяКредиторскаяЗадолженность)
    |       КОГДА ВТТаблицаЗарплатаИВзносы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ДоходыКонтрагентов)
    |           ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПрочаяКраткосрочнаяКредиторскаяЗадолженность)
    |       КОГДА ВТТаблицаЗарплатаИВзносы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.Дивиденды)
    |           ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Типовой.КраткосрочнаяКредиторскаяЗадолженностьПоДивидендамИДоходамУчастников)
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.КраткосрочнаяЗадолженностьПоОплатеТруда)
    |   КОНЕЦ КАК СчетКт,
    |   ВЫБОР
    |       КОГДА ВТТаблицаЗарплатаИВзносы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВыплатыБывшимСотрудникам)
    |           ТОГДА ВТТаблицаЗарплатаИВзносы.Контрагент
    |       КОГДА ВТТаблицаЗарплатаИВзносы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ДоходыКонтрагентов)
    |               ИЛИ ВТТаблицаЗарплатаИВзносы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.Дивиденды)
    |           ТОГДА ВТТаблицаЗарплатаИВзносы.Контрагент
    |       КОГДА НЕ &ВедениеУчетаПоСотрудникам
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ КАК СубконтоКт1,
    |   ВЫБОР
    |       КОГДА ВТТаблицаЗарплатаИВзносы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВыплатыБывшимСотрудникам)
    |           ТОГДА ВТТаблицаЗарплатаИВзносы.ДоговорКонтрагента
    |       КОГДА ВТТаблицаЗарплатаИВзносы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ДоходыКонтрагентов)
    |               ИЛИ ВТТаблицаЗарплатаИВзносы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.Дивиденды)
    |           ТОГДА ВТТаблицаЗарплатаИВзносы.ДоговорКонтрагента
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ КАК СубконтоКт2,
    |   НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
    |   ВЫБОР
    |       КОГДА ВЫРАЗИТЬ(ВЫБОР
    |                   КОГДА ВТТаблицаЗарплатаИВзносы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВыплатыБывшимСотрудникам)
    |                       ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПрочаяКраткосрочнаяКредиторскаяЗадолженность)
    |                   КОГДА ВТТаблицаЗарплатаИВзносы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ДоходыКонтрагентов)
    |                       ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПрочаяКраткосрочнаяКредиторскаяЗадолженность)
    |                   КОГДА ВТТаблицаЗарплатаИВзносы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.Дивиденды)
    |                       ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Типовой.КраткосрочнаяКредиторскаяЗадолженностьПоДивидендамИДоходамУчастников)
    |                   ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.КраткосрочнаяЗадолженностьПоОплатеТруда)
    |               КОНЕЦ КАК ПланСчетов.Типовой).СчетНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяСсылка)
    |           ТОГДА ВЫРАЗИТЬ(ВЫБОР
    |                       КОГДА ВТТаблицаЗарплатаИВзносы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВыплатыБывшимСотрудникам)
    |                           ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПрочаяКраткосрочнаяКредиторскаяЗадолженность)
    |                       КОГДА ВТТаблицаЗарплатаИВзносы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ДоходыКонтрагентов)
    |                           ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПрочаяКраткосрочнаяКредиторскаяЗадолженность)
    |                       КОГДА ВТТаблицаЗарплатаИВзносы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.Дивиденды)
    |                           ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Типовой.КраткосрочнаяКредиторскаяЗадолженностьПоДивидендамИДоходамУчастников)
    |                       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.КраткосрочнаяЗадолженностьПоОплатеТруда)
    |                   КОНЕЦ КАК ПланСчетов.Типовой).СчетНУ
    |       ИНАЧЕ ВЫБОР
    |               КОГДА ВТТаблицаЗарплатаИВзносы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВыплатыБывшимСотрудникам)
    |                   ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ОбщиеИАдминистративныеРасходы)
    |               КОГДА ВТТаблицаЗарплатаИВзносы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ДоходыКонтрагентов)
    |                   ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ОбщиеИАдминистративныеРасходы)
    |               КОГДА ВТТаблицаЗарплатаИВзносы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.Дивиденды)
    |                   ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПоступлениеИВыбытиеИмуществаработУслугПрав)
    |               ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ВзаиморасчетыСРаботниками)
    |           КОНЕЦ
    |   КОНЕЦ КАК СчетКтНУ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаЗарплатаИВзносы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВыплатыБывшимСотрудникам)
    |           ТОГДА ВТТаблицаЗарплатаИВзносы.Контрагент
    |       КОГДА ВТТаблицаЗарплатаИВзносы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ДоходыКонтрагентов)
    |               ИЛИ ВТТаблицаЗарплатаИВзносы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.Дивиденды)
    |           ТОГДА ВТТаблицаЗарплатаИВзносы.Контрагент
    |       КОГДА НЕ &ВедениеУчетаПоСотрудникам
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ КАК СубконтоКтНУ1,
    |   ВЫБОР
    |       КОГДА ВТТаблицаЗарплатаИВзносы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВыплатыБывшимСотрудникам)
    |           ТОГДА ВТТаблицаЗарплатаИВзносы.ДоговорКонтрагента
    |       КОГДА ВТТаблицаЗарплатаИВзносы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ДоходыКонтрагентов)
    |               ИЛИ ВТТаблицаЗарплатаИВзносы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.Дивиденды)
    |           ТОГДА ВТТаблицаЗарплатаИВзносы.ДоговорКонтрагента
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ КАК СубконтоКтНУ2,
    |   НЕОПРЕДЕЛЕНО КАК СубконтоКтНУ3,
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка) КАК ВидУчетаДт,
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка) КАК ВидУчетаКт,
    |   НЕОПРЕДЕЛЕНО КАК ВидНалогаОтчисления,
    |   НЕОПРЕДЕЛЕНО КАК СтатьяЗатрат,
    |   НЕОПРЕДЕЛЕНО КАК КонтрагентОтправитель,
    |   НЕОПРЕДЕЛЕНО КАК РаботникОрганизации
    |ПОМЕСТИТЬ ВТТаблицаОтражениеВУчете
    |ИЗ
    |   ВТТаблицаЗарплатаИВзносы КАК ВТТаблицаЗарплатаИВзносы
	//Сухомлинов++
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.киб_СоответствиеСпособовОтраженияНачисленийИСтатейЗатрат.СрезПоследних(&ПериодРегистрации, ) КАК киб_СоответствиеСпособовОтраженияНачисленийИСтатейЗатратСрезПоследних
	|	ПО (ВЫБОР
	|			КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
	|					И ВТТаблицаЗарплатаИВзносы.киб_Начисление <> ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ПустаяСсылка)
	|				ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете = киб_СоответствиеСпособовОтраженияНачисленийИСтатейЗатратСрезПоследних.СпособОтражения
	|						И ВТТаблицаЗарплатаИВзносы.киб_Начисление = киб_СоответствиеСпособовОтраженияНачисленийИСтатейЗатратСрезПоследних.Начисление
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ)
	//Сухомлинов--		
	|ГДЕ
	|	НЕ ВТТаблицаЗарплатаИВзносы.ВидОперации В (&МассивВидыОперацийРезервы)
	|		И ВТТаблицаЗарплатаИВзносы.РезервОплатыТруда = ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка)
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
	//Сухомлинов++
    |   ВТТаблицаЗарплатаИВзносы.киб_Участок,
	//Сухомлинов--
    |   ВТТаблицаЗарплатаИВзносы.Ссылка,
    |   ВТТаблицаЗарплатаИВзносы.НомерСтроки,
    |   ВТТаблицаЗарплатаИВзносы.Подразделение,
    |   ВТТаблицаЗарплатаИВзносы.ВидОперации,
    |   ВТТаблицаЗарплатаИВзносы.ФизическоеЛицо,
    |   ВТТаблицаЗарплатаИВзносы.СтруктурноеПодразделение,
    |   ВТТаблицаЗарплатаИВзносы.Резерв,
    |   ВТТаблицаЗарплатаИВзносы.Контрагент,
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.Налог),
    |   ВЫБОР
    |       КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |           ТОГДА ВЫБОР
    |                   КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1
    |                   КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2
    |                   КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3
    |                   ИНАЧЕ ВТТаблицаЗарплатаИВзносы.Подразделение
    |               КОНЕЦ
    |       ИНАЧЕ ВТТаблицаЗарплатаИВзносы.Подразделение
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |           ТОГДА ВЫБОР
    |                   КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоНУ1 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоНУ1
    |                   КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоНУ2 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоНУ2
    |                   КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоНУ3 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоНУ3
    |                   ИНАЧЕ ВТТаблицаЗарплатаИВзносы.Подразделение
    |               КОНЕЦ
    |       ИНАЧЕ ВТТаблицаЗарплатаИВзносы.Подразделение
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СчетБУ
    |       КОГДА ВТТаблицаЗарплатаИВзносы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.Дивиденды)
    |           ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Типовой.НераспределеннаяПрибыльНепокрытыйУбытокОтчетногоГода)
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |           ТОГДА ВЫБОР
    |                   КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1 ССЫЛКА Справочник.СтатьиЗатрат
    |                       ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.СоциальныйНалог)
    |                   ИНАЧЕ ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1
    |               КОНЕЦ
    |       КОГДА ВТТаблицаЗарплатаИВзносы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.Дивиденды)
    |           ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыИзмененийВСобственномКапитале.Дивиденды)
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.СоциальныйНалог)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2
    |       КОГДА ВТТаблицаЗарплатаИВзносы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.Дивиденды)
    |           ТОГДА НЕОПРЕДЕЛЕНО
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СчетНУ
    |       КОГДА ВТТаблицаЗарплатаИВзносы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.Дивиденды)
    |           ТОГДА ВЫБОР
    |                   КОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.НераспределеннаяПрибыльНепокрытыйУбытокОтчетногоГода) КАК ПланСчетов.Типовой).СчетНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяСсылка)
    |                       ТОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.НераспределеннаяПрибыльНепокрытыйУбытокОтчетногоГода) КАК ПланСчетов.Типовой).СчетНУ
    |                   ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ИтоговаяПрибыльИтоговыйУбытокОтчетногоГода)
    |               КОНЕЦ
    |       КОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы) КАК ПланСчетов.Типовой).СчетНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяСсылка)
    |           ТОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы) КАК ПланСчетов.Типовой).СчетНУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ОбщиеИАдминистративныеРасходы)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |           ТОГДА ВЫБОР
    |                   КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоНУ1 ССЫЛКА Справочник.СтатьиЗатрат
    |                       ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.СоциальныйНалог)
    |                   ИНАЧЕ ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоНУ1
    |               КОНЕЦ
    |       КОГДА ВТТаблицаЗарплатаИВзносы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.Дивиденды)
    |           ТОГДА НЕОПРЕДЕЛЕНО
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.СоциальныйНалог)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоНУ2
    |       КОГДА ВТТаблицаЗарплатаИВзносы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.Дивиденды)
    |           ТОГДА НЕОПРЕДЕЛЕНО
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоНУ3
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   ВТТаблицаЗарплатаИВзносы.СН,
    |   ВЫБОР
    |       КОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ <> ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка)
    |           ТОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.СоциальныйНалог)
    |   КОНЕЦ,
    |   ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.СоциальныйНалог),
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФОнды.Налог),
    |   ВЫБОР
    |       КОГДА НЕ &ВедениеУчетаПоСотрудникам
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ <> ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка)
    |               И НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяСсылка)
    |           ТОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомНУ
    |       КОГДА ВЫРАЗИТЬ(ВЫБОР
    |                   КОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ <> ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка)
    |                       ТОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ
    |                   ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.СоциальныйНалог)
    |               КОНЕЦ КАК ПланСчетов.Типовой).СчетНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяССылка)
    |           ТОГДА ВЫРАЗИТЬ(ВЫБОР
    |                       КОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ <> ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка)
    |                           ТОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ
    |                       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.СоциальныйНалог)
    |                   КОНЕЦ КАК ПланСчетов.Типовой).СчетНУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПрочиеНалоги)
    |   КОНЕЦ,
    |   ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.СоциальныйНалог),
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФОнды.Налог),
    |   ВЫБОР
    |       КОГДА НЕ &ВедениеУчетаПоСотрудникам
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка),
    |   НалогиСборыОтчисления.Ссылка,
    |   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.СоциальныйНалог),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО
    |ИЗ
    |   ВТТаблицаЗарплатаИВзносы КАК ВТТаблицаЗарплатаИВзносы
    |       ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НалогиСборыОтчисления КАК НалогиСборыОтчисления
    |       ПО (НалогиСборыОтчисления.Ссылка = ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.СоциальныйНалог))
    |ГДЕ
	|	НЕ ВТТаблицаЗарплатаИВзносы.ВидОперации В (&МассивВидыОперацийРезервы)
	|		И ВТТаблицаЗарплатаИВзносы.РезервОплатыТруда = ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка)
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
	//Сухомлинов++
    |   ВТТаблицаЗарплатаИВзносы.киб_Участок,
	//Сухомлинов--
    |   ВТТаблицаЗарплатаИВзносы.Ссылка,
    |   ВТТаблицаЗарплатаИВзносы.НомерСтроки,
    |   ВТТаблицаЗарплатаИВзносы.Подразделение,
    |   ВТТаблицаЗарплатаИВзносы.ВидОперации,
    |   ВТТаблицаЗарплатаИВзносы.ФизическоеЛицо,
    |   ВТТаблицаЗарплатаИВзносы.СтруктурноеПодразделение,
    |   ВТТаблицаЗарплатаИВзносы.Резерв,
    |   ВТТаблицаЗарплатаИВзносы.Контрагент,
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.Налог),
    |   ВЫБОР
    |       КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |           ТОГДА ВЫБОР
    |                   КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1
    |                   КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2
    |                   КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3
    |                   ИНАЧЕ ВТТаблицаЗарплатаИВзносы.Подразделение
    |               КОНЕЦ
    |       ИНАЧЕ ВТТаблицаЗарплатаИВзносы.Подразделение
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |           ТОГДА ВЫБОР
    |                   КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоНУ1 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоНУ1
    |                   КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоНУ2 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоНУ2
    |                   КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоНУ3 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоНУ3
    |                   ИНАЧЕ ВТТаблицаЗарплатаИВзносы.Подразделение
    |               КОНЕЦ
    |       ИНАЧЕ ВТТаблицаЗарплатаИВзносы.Подразделение
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СчетБУ
    |       КОГДА ВТТаблицаЗарплатаИВзносы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.Дивиденды)
    |           ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Типовой.НераспределеннаяПрибыльНепокрытыйУбытокОтчетногоГода)
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |           ТОГДА ВЫБОР
    |                   КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1 ССЫЛКА Справочник.СтатьиЗатрат
    |                       ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.СоциальныеОтчисления)
    |                   ИНАЧЕ ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1
    |               КОНЕЦ
    |       КОГДА ВТТаблицаЗарплатаИВзносы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.Дивиденды)
    |           ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыИзмененийВСобственномКапитале.Дивиденды)
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.СоциальныеОтчисления)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2
    |       КОГДА ВТТаблицаЗарплатаИВзносы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.Дивиденды)
    |           ТОГДА НЕОПРЕДЕЛЕНО
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СчетНУ
    |       КОГДА ВТТаблицаЗарплатаИВзносы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.Дивиденды)
    |           ТОГДА ВЫБОР
    |                   КОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.НераспределеннаяПрибыльНепокрытыйУбытокОтчетногоГода) КАК ПланСчетов.Типовой).СчетНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяСсылка)
    |                       ТОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.НераспределеннаяПрибыльНепокрытыйУбытокОтчетногоГода) КАК ПланСчетов.Типовой).СчетНУ
    |                   ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ИтоговаяПрибыльИтоговыйУбытокОтчетногоГода)
    |               КОНЕЦ
    |       КОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы) КАК ПланСчетов.Типовой).СчетНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяСсылка)
    |           ТОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы) КАК ПланСчетов.Типовой).СчетНУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ОбщиеИАдминистративныеРасходы)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |           ТОГДА ВЫБОР
    |                   КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоНУ1 ССЫЛКА Справочник.СтатьиЗатрат
    |                       ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.СоциальныеОтчисления)
    |                   ИНАЧЕ ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоНУ1
    |               КОНЕЦ
    |       КОГДА ВТТаблицаЗарплатаИВзносы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.Дивиденды)
    |           ТОГДА НЕОПРЕДЕЛЕНО
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.СоциальныеОтчисления)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоНУ2
    |       КОГДА ВТТаблицаЗарплатаИВзносы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.Дивиденды)
    |           ТОГДА НЕОПРЕДЕЛЕНО
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоНУ3
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   ВТТаблицаЗарплатаИВзносы.СО,
    |   ВЫБОР
    |       КОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ <> ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка)
    |           ТОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.ОбязательстваПоСоциальномуСтрахованию)
    |   КОНЕЦ,
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФОнды.Налог),
    |   ВЫБОР
    |       КОГДА НЕ &ВедениеУчетаПоСотрудникам
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   НЕОПРЕДЕЛЕНО,
    |   ВЫБОР
    |       КОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ <> ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка)
    |               И НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяСсылка)
    |           ТОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомНУ
    |       КОГДА ВЫРАЗИТЬ(ВЫБОР
    |                   КОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ <> ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка)
    |                       ТОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ
    |                   ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.ОбязательстваПоСоциальномуСтрахованию)
    |               КОНЕЦ КАК ПланСчетов.Типовой).СчетНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяССылка)
    |           ТОГДА ВЫРАЗИТЬ(ВЫБОР
    |                       КОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ <> ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка)
    |                           ТОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ
    |                       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.ОбязательстваПоСоциальномуСтрахованию)
    |                   КОНЕЦ КАК ПланСчетов.Типовой).СчетНУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ОбязательстваПоСоциальномуСтрахованию)
    |   КОНЕЦ,
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФОнды.Налог),
    |   ВЫБОР
    |       КОГДА НЕ &ВедениеУчетаПоСотрудникам
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка),
    |   НалогиСборыОтчисления.Ссылка,
    |   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.СоциальныеОтчисления),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО
    |ИЗ
    |   ВТТаблицаЗарплатаИВзносы КАК ВТТаблицаЗарплатаИВзносы
    |       ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НалогиСборыОтчисления КАК НалогиСборыОтчисления
    |       ПО (НалогиСборыОтчисления.Ссылка = ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.ОбязательныеСоциальныеОтчисления))
    |ГДЕ
	|	НЕ ВТТаблицаЗарплатаИВзносы.ВидОперации В (&МассивВидыОперацийРезервы)
	|		И ВТТаблицаЗарплатаИВзносы.РезервОплатыТруда = ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка)
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
	//Сухомлинов++
    |   ВТТаблицаЗарплатаИВзносы.киб_Участок,
	//Сухомлинов--
    |   ВТТаблицаЗарплатаИВзносы.Ссылка,
    |   ВТТаблицаЗарплатаИВзносы.НомерСтроки,
    |   ВТТаблицаЗарплатаИВзносы.Подразделение,
    |   ВТТаблицаЗарплатаИВзносы.ВидОперации,
    |   ВТТаблицаЗарплатаИВзносы.ФизическоеЛицо,
    |   ВТТаблицаЗарплатаИВзносы.СтруктурноеПодразделение,
    |   ВТТаблицаЗарплатаИВзносы.Резерв,
    |   ВТТаблицаЗарплатаИВзносы.Контрагент,
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.Налог),
    |   ВЫБОР
    |       КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |           ТОГДА ВЫБОР
    |                   КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1
    |                   КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2
    |                   КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3
    |                   ИНАЧЕ ВТТаблицаЗарплатаИВзносы.Подразделение
    |               КОНЕЦ
    |       ИНАЧЕ ВТТаблицаЗарплатаИВзносы.Подразделение
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |           ТОГДА ВЫБОР
    |                   КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоНУ1 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоНУ1
    |                   КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоНУ2 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоНУ2
    |                   КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоНУ3 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоНУ3
    |                   ИНАЧЕ ВТТаблицаЗарплатаИВзносы.Подразделение
    |               КОНЕЦ
    |       ИНАЧЕ ВТТаблицаЗарплатаИВзносы.Подразделение
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СчетБУ
    |       КОГДА ВТТаблицаЗарплатаИВзносы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.Дивиденды)
    |           ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Типовой.НераспределеннаяПрибыльНепокрытыйУбытокОтчетногоГода)
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |           ТОГДА ВЫБОР
    |                   КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1 ССЫЛКА Справочник.СтатьиЗатрат
    |                       ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ОбязательныеПрофессиональныеПенсионныеВзносы)
    |                   ИНАЧЕ ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1
    |               КОНЕЦ
    |       КОГДА ВТТаблицаЗарплатаИВзносы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.Дивиденды)
    |           ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыИзмененийВСобственномКапитале.Дивиденды)
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ОбязательныеПрофессиональныеПенсионныеВзносы)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2
    |       КОГДА ВТТаблицаЗарплатаИВзносы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.Дивиденды)
    |           ТОГДА НЕОПРЕДЕЛЕНО
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СчетНУ
    |       КОГДА ВТТаблицаЗарплатаИВзносы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.Дивиденды)
    |           ТОГДА ВЫБОР
    |                   КОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.НераспределеннаяПрибыльНепокрытыйУбытокОтчетногоГода) КАК ПланСчетов.Типовой).СчетНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяСсылка)
    |                       ТОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.НераспределеннаяПрибыльНепокрытыйУбытокОтчетногоГода) КАК ПланСчетов.Типовой).СчетНУ
    |                   ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ИтоговаяПрибыльИтоговыйУбытокОтчетногоГода)
    |               КОНЕЦ
    |       КОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы) КАК ПланСчетов.Типовой).СчетНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяСсылка)
    |           ТОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы) КАК ПланСчетов.Типовой).СчетНУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ОбщиеИАдминистративныеРасходы)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |           ТОГДА ВЫБОР
    |                   КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоНУ1 ССЫЛКА Справочник.СтатьиЗатрат
    |                       ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ОбязательныеПрофессиональныеПенсионныеВзносы)
    |                   ИНАЧЕ ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоНУ1
    |               КОНЕЦ
    |       КОГДА ВТТаблицаЗарплатаИВзносы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.Дивиденды)
    |           ТОГДА НЕОПРЕДЕЛЕНО
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ОбязательныеПрофессиональныеПенсионныеВзносы)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоНУ2
    |       КОГДА ВТТаблицаЗарплатаИВзносы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.Дивиденды)
    |           ТОГДА НЕОПРЕДЕЛЕНО
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоНУ3
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   ВТТаблицаЗарплатаИВзносы.ОППВ,
    |   ВЫБОР
    |       КОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ <> ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка)
    |           ТОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.ОбязательстваПоПенсионнымОтчислениям)
    |   КОНЕЦ,
    |   ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.ОбязательныеПрофессиональныеПенсионныеВзносы),
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФОнды.Налог),
    |   ВЫБОР
    |       КОГДА НЕ &ВедениеУчетаПоСотрудникам
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ <> ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка)
    |               И НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяСсылка)
    |           ТОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомНУ
    |       КОГДА ВЫРАЗИТЬ(ВЫБОР
    |                   КОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ <> ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка)
    |                       ТОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ
    |                   ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.ОбязательстваПоПенсионнымОтчислениям)
    |               КОНЕЦ КАК ПланСчетов.Типовой).СчетНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяССылка)
    |           ТОГДА ВЫРАЗИТЬ(ВЫБОР
    |                       КОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ <> ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка)
    |                           ТОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ
    |                       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.ОбязательстваПоПенсионнымОтчислениям)
    |                   КОНЕЦ КАК ПланСчетов.Типовой).СчетНУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ОбязательстваПоПенсионнымОтчислениям)
    |   КОНЕЦ,
    |   ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.ОбязательныеПрофессиональныеПенсионныеВзносы),
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФОнды.Налог),
    |   ВЫБОР
    |       КОГДА НЕ &ВедениеУчетаПоСотрудникам
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка),
    |   НалогиСборыОтчисления.Ссылка,
    |   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ОбязательныеПрофессиональныеПенсионныеВзносы),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО
    |ИЗ
    |   ВТТаблицаЗарплатаИВзносы КАК ВТТаблицаЗарплатаИВзносы
    |       ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НалогиСборыОтчисления КАК НалогиСборыОтчисления
    |       ПО (НалогиСборыОтчисления.Ссылка = ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.ОбязательныеПрофессиональныеПенсионныеВзносы))
    |ГДЕ
	|	НЕ ВТТаблицаЗарплатаИВзносы.ВидОперации В (&МассивВидыОперацийРезервы)
	|		И ВТТаблицаЗарплатаИВзносы.РезервОплатыТруда = ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка)
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
	//Сухомлинов++
    |   ВТТаблицаЗарплатаИВзносы.киб_Участок,
	//Сухомлинов--
    |   ВТТаблицаЗарплатаИВзносы.Ссылка,
    |   ВТТаблицаЗарплатаИВзносы.НомерСтроки,
    |   ВТТаблицаЗарплатаИВзносы.Подразделение,
    |   ВТТаблицаЗарплатаИВзносы.ВидОперации,
    |   ВТТаблицаЗарплатаИВзносы.ФизическоеЛицо,
    |   ВТТаблицаЗарплатаИВзносы.СтруктурноеПодразделение,
    |   ВТТаблицаЗарплатаИВзносы.Резерв,
    |   ВТТаблицаЗарплатаИВзносы.Контрагент,
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.Налог),
    |   ВЫБОР
    |       КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |           ТОГДА ВЫБОР
    |                   КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1
    |                   КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2
    |                   КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3
    |                   ИНАЧЕ ВТТаблицаЗарплатаИВзносы.Подразделение
    |               КОНЕЦ
    |       ИНАЧЕ ВТТаблицаЗарплатаИВзносы.Подразделение
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |           ТОГДА ВЫБОР
    |                   КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоНУ1 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоНУ1
    |                   КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоНУ2 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоНУ2
    |                   КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоНУ3 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоНУ3
    |                   ИНАЧЕ ВТТаблицаЗарплатаИВзносы.Подразделение
    |               КОНЕЦ
    |       ИНАЧЕ ВТТаблицаЗарплатаИВзносы.Подразделение
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СчетБУ
    |       КОГДА ВТТаблицаЗарплатаИВзносы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.Дивиденды)
    |           ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Типовой.НераспределеннаяПрибыльНепокрытыйУбытокОтчетногоГода)
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |           ТОГДА ВЫБОР
    |                   КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1 ССЫЛКА Справочник.СтатьиЗатрат
    |                       ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ОбязательныеПенсионныеВзносыРаботодателя)
    |                   ИНАЧЕ ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1
    |               КОНЕЦ
    |       КОГДА ВТТаблицаЗарплатаИВзносы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.Дивиденды)
    |           ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыИзмененийВСобственномКапитале.Дивиденды)
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ОбязательныеПенсионныеВзносыРаботодателя)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2
    |       КОГДА ВТТаблицаЗарплатаИВзносы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.Дивиденды)
    |           ТОГДА НЕОПРЕДЕЛЕНО
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СчетНУ
    |       КОГДА ВТТаблицаЗарплатаИВзносы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.Дивиденды)
    |           ТОГДА ВЫБОР
    |                   КОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.НераспределеннаяПрибыльНепокрытыйУбытокОтчетногоГода) КАК ПланСчетов.Типовой).СчетНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяСсылка)
    |                       ТОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.НераспределеннаяПрибыльНепокрытыйУбытокОтчетногоГода) КАК ПланСчетов.Типовой).СчетНУ
    |                   ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ИтоговаяПрибыльИтоговыйУбытокОтчетногоГода)
    |               КОНЕЦ
    |       КОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы) КАК ПланСчетов.Типовой).СчетНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяСсылка)
    |           ТОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы) КАК ПланСчетов.Типовой).СчетНУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ОбщиеИАдминистративныеРасходы)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |           ТОГДА ВЫБОР
    |                   КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоНУ1 ССЫЛКА Справочник.СтатьиЗатрат
    |                       ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ОбязательныеПенсионныеВзносыРаботодателя)
    |                   ИНАЧЕ ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоНУ1
    |               КОНЕЦ
    |       КОГДА ВТТаблицаЗарплатаИВзносы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.Дивиденды)
    |           ТОГДА НЕОПРЕДЕЛЕНО
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ОбязательныеПенсионныеВзносыРаботодателя)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоНУ2
    |       КОГДА ВТТаблицаЗарплатаИВзносы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.Дивиденды)
    |           ТОГДА НЕОПРЕДЕЛЕНО
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоНУ3
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   ВТТаблицаЗарплатаИВзносы.ОПВР,
    |   ВЫБОР
    |       КОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ <> ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка)
    |           ТОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.ОбязательстваПоОбязательнымПенсионнымВзносамРаботодателя)
    |   КОНЕЦ,
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФОнды.Налог),
    |   ВЫБОР
    |       КОГДА НЕ &ВедениеУчетаПоСотрудникам
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   НЕОПРЕДЕЛЕНО,
	|   ВЫБОР
    |       КОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ <> ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка)
    |               И НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяСсылка)
    |           ТОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомНУ
    |       КОГДА ВЫРАЗИТЬ(ВЫБОР
    |                   КОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ <> ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка)
    |                       ТОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ
    |                   ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.ОбязательстваПоОбязательнымПенсионнымВзносамРаботодателя)
    |               КОНЕЦ КАК ПланСчетов.Типовой).СчетНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяССылка)
    |           ТОГДА ВЫРАЗИТЬ(ВЫБОР
    |                       КОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ <> ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка)
    |                           ТОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ
    |                       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.ОбязательстваПоОбязательнымПенсионнымВзносамРаботодателя)
    |                   КОНЕЦ КАК ПланСчетов.Типовой).СчетНУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ОбязательстваПоОбязательнымПенсионнымВзносамРаботодателя)
    |   КОНЕЦ,
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФОнды.Налог),
    |   ВЫБОР
    |       КОГДА НЕ &ВедениеУчетаПоСотрудникам
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   НЕОПРЕДЕЛЕНО,
	|   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка),
    |   НалогиСборыОтчисления.Ссылка,
    |   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ОбязательныеПенсионныеВзносыРаботодателя),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО
    |ИЗ
    |   ВТТаблицаЗарплатаИВзносы КАК ВТТаблицаЗарплатаИВзносы
    |       ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НалогиСборыОтчисления КАК НалогиСборыОтчисления
    |       ПО (НалогиСборыОтчисления.Ссылка = ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.ОбязательныеПенсионныеВзносыРаботодателя))
    |ГДЕ
	|	НЕ ВТТаблицаЗарплатаИВзносы.ВидОперации В (&МассивВидыОперацийРезервы)
	|		И ВТТаблицаЗарплатаИВзносы.РезервОплатыТруда = ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка)
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
	//Сухомлинов++
    |   ВТТаблицаЗарплатаИВзносы.киб_Участок,
	//Сухомлинов--
    |   ВТТаблицаЗарплатаИВзносы.Ссылка,
    |   ВТТаблицаЗарплатаИВзносы.НомерСтроки,
    |   ВТТаблицаЗарплатаИВзносы.Подразделение,
    |   ВТТаблицаЗарплатаИВзносы.ВидОперации,
    |   ВТТаблицаЗарплатаИВзносы.ФизическоеЛицо,
    |   ВТТаблицаЗарплатаИВзносы.СтруктурноеПодразделение,
    |   ВТТаблицаЗарплатаИВзносы.Резерв,
    |   ВТТаблицаЗарплатаИВзносы.Контрагент,
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.Налог),
    |   ВЫБОР
    |       КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |           ТОГДА ВЫБОР
    |                   КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1
    |                   КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2
    |                   КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3
    |                   ИНАЧЕ ВТТаблицаЗарплатаИВзносы.Подразделение
    |               КОНЕЦ
    |       ИНАЧЕ ВТТаблицаЗарплатаИВзносы.Подразделение
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |           ТОГДА ВЫБОР
    |                   КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоНУ1 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоНУ1
    |                   КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоНУ2 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоНУ2
    |                   КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоНУ3 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоНУ3
    |                   ИНАЧЕ ВТТаблицаЗарплатаИВзносы.Подразделение
    |               КОНЕЦ
    |       ИНАЧЕ ВТТаблицаЗарплатаИВзносы.Подразделение
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СчетБУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |           ТОГДА ВЫБОР
    |                   КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1 ССЫЛКА Справочник.СтатьиЗатрат
    |                       ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ЕдиныйПлатеж)
    |                   ИНАЧЕ ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1
    |               КОНЕЦ
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ЕдиныйПлатеж)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2
    |       КОГДА ВТТаблицаЗарплатаИВзносы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.Дивиденды)
    |           ТОГДА НЕОПРЕДЕЛЕНО
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СчетНУ
    |       КОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы) КАК ПланСчетов.Типовой).СчетНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяСсылка)
    |           ТОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы) КАК ПланСчетов.Типовой).СчетНУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ОбщиеИАдминистративныеРасходы)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |           ТОГДА ВЫБОР
    |                   КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоНУ1 ССЫЛКА Справочник.СтатьиЗатрат
    |                       ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ЕдиныйПлатеж)
    |                   ИНАЧЕ ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоНУ1
    |               КОНЕЦ
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ЕдиныйПлатеж)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоНУ2
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоНУ3
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   ВТТаблицаЗарплатаИВзносы.ЕП,
    |   ВЫБОР
    |       КОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ <> ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка)
    |           ТОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.ОбязательстваПоЕдиномуПлатежу)
    |   КОНЕЦ,
    |   ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.ЕдиныйПлатеж),
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФОнды.Налог),
    |   ВЫБОР
    |       КОГДА НЕ &ВедениеУчетаПоСотрудникам
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ <> ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка)
    |               И НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяСсылка)
    |           ТОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомНУ
    |       КОГДА ВЫРАЗИТЬ(ВЫБОР
    |                   КОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ <> ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка)
    |                       ТОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ
    |                   ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.ОбязательстваПоЕдиномуПлатежу)
    |               КОНЕЦ КАК ПланСчетов.Типовой).СчетНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяССылка)
    |           ТОГДА ВЫРАЗИТЬ(ВЫБОР
    |                       КОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ <> ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка)
    |                           ТОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ
    |                       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.ОбязательстваПоЕдиномуПлатежу)
    |                   КОНЕЦ КАК ПланСчетов.Типовой).СчетНУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ОбязательстваПоЕдиномуПлатежу)
    |   КОНЕЦ,
    |   ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.ЕдиныйПлатеж),
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФОнды.Налог),
    |   ВЫБОР
    |       КОГДА НЕ &ВедениеУчетаПоСотрудникам
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка),
    |   НалогиСборыОтчисления.Ссылка,
    |   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ЕдиныйПлатеж),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО
    |ИЗ
    |   ВТТаблицаЗарплатаИВзносы КАК ВТТаблицаЗарплатаИВзносы
    |       ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НалогиСборыОтчисления КАК НалогиСборыОтчисления
    |       ПО (НалогиСборыОтчисления.Ссылка = ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.ЕдиныйПлатеж))
    |ГДЕ
	|	НЕ ВТТаблицаЗарплатаИВзносы.ВидОперации В (&МассивВидыОперацийРезервы)
	|		И ВТТаблицаЗарплатаИВзносы.РезервОплатыТруда = ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка)
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
	//Сухомлинов++
    |   ВТТаблицаЗарплатаИВзносы.киб_Участок,
	//Сухомлинов--
    |   ВТТаблицаЗарплатаИВзносы.Ссылка,
    |   ВТТаблицаЗарплатаИВзносы.НомерСтроки,
    |   ВТТаблицаЗарплатаИВзносы.Подразделение,
    |   ВТТаблицаЗарплатаИВзносы.ВидОперации,
    |   ВТТаблицаЗарплатаИВзносы.ФизическоеЛицо,
    |   ВТТаблицаЗарплатаИВзносы.СтруктурноеПодразделение,
    |   ВТТаблицаЗарплатаИВзносы.Резерв,
    |   ВТТаблицаЗарплатаИВзносы.Контрагент,
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.Налог),
    |   ВЫБОР
    |       КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |           ТОГДА ВЫБОР
    |                   КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1
    |                   КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2
    |                   КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3
    |                   ИНАЧЕ ВТТаблицаЗарплатаИВзносы.Подразделение
    |               КОНЕЦ
    |       ИНАЧЕ ВТТаблицаЗарплатаИВзносы.Подразделение
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |           ТОГДА ВЫБОР
    |                   КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоНУ1 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоНУ1
    |                   КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоНУ2 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоНУ2
    |                   КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоНУ3 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоНУ3
    |                   ИНАЧЕ ВТТаблицаЗарплатаИВзносы.Подразделение
    |               КОНЕЦ
    |       ИНАЧЕ ВТТаблицаЗарплатаИВзносы.Подразделение
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СчетБУ
    |       КОГДА ВТТаблицаЗарплатаИВзносы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.Дивиденды)
    |           ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Типовой.НераспределеннаяПрибыльНепокрытыйУбытокОтчетногоГода)
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |           ТОГДА ВЫБОР
    |                   КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1 ССЫЛКА Справочник.СтатьиЗатрат
    |                       ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ОтчисленияОСМС)
    |                   ИНАЧЕ ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1
    |               КОНЕЦ
    |       КОГДА ВТТаблицаЗарплатаИВзносы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.Дивиденды)
    |           ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыИзмененийВСобственномКапитале.Дивиденды)
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ОтчисленияОСМС)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2
    |       КОГДА ВТТаблицаЗарплатаИВзносы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.Дивиденды)
    |           ТОГДА НЕОПРЕДЕЛЕНО
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СчетНУ
    |       КОГДА ВТТаблицаЗарплатаИВзносы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.Дивиденды)
    |           ТОГДА ВЫБОР
    |                   КОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.НераспределеннаяПрибыльНепокрытыйУбытокОтчетногоГода) КАК ПланСчетов.Типовой).СчетНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяСсылка)
    |                       ТОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.НераспределеннаяПрибыльНепокрытыйУбытокОтчетногоГода) КАК ПланСчетов.Типовой).СчетНУ
    |                   ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ИтоговаяПрибыльИтоговыйУбытокОтчетногоГода)
    |               КОНЕЦ
    |       КОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы) КАК ПланСчетов.Типовой).СчетНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяСсылка)
    |           ТОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы) КАК ПланСчетов.Типовой).СчетНУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ОбщиеИАдминистративныеРасходы)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |           ТОГДА ВЫБОР
    |                   КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоНУ1 ССЫЛКА Справочник.СтатьиЗатрат
    |                       ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ОтчисленияОСМС)
    |                   ИНАЧЕ ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоНУ1
    |               КОНЕЦ
    |       КОГДА ВТТаблицаЗарплатаИВзносы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.Дивиденды)
    |           ТОГДА НЕОПРЕДЕЛЕНО
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ОтчисленияОСМС)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоНУ2
    |       КОГДА ВТТаблицаЗарплатаИВзносы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.Дивиденды)
    |           ТОГДА НЕОПРЕДЕЛЕНО
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоНУ3
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   ВТТаблицаЗарплатаИВзносы.ООСМС,
    |   ВЫБОР
    |       КОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ <> ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка)
    |           ТОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.ОбязательстваПоОтчислениямОСМС)
    |   КОНЕЦ,
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФОнды.Налог),
    |   ВЫБОР
    |       КОГДА НЕ &ВедениеУчетаПоСотрудникам
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   НЕОПРЕДЕЛЕНО,
    |   ВЫБОР
    |       КОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ <> ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка)
    |               И НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяСсылка)
    |           ТОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомНУ
    |       КОГДА ВЫРАЗИТЬ(ВЫБОР
    |                   КОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ <> ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка)
    |                       ТОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ
    |                   ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.ОбязательстваПоОтчислениямОСМС)
    |               КОНЕЦ КАК ПланСчетов.Типовой).СчетНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяССылка)
    |           ТОГДА ВЫРАЗИТЬ(ВЫБОР
    |                       КОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ <> ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка)
    |                           ТОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ
    |                       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.ОбязательстваПоОтчислениямОСМС)
    |                   КОНЕЦ КАК ПланСчетов.Типовой).СчетНУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ОбязательстваПоОтчислениямОСМС)
    |   КОНЕЦ,
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФОнды.Налог),
    |   ВЫБОР
    |       КОГДА НЕ &ВедениеУчетаПоСотрудникам
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка),
    |   НалогиСборыОтчисления.Ссылка,
    |   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ОтчисленияОСМС),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО
    |ИЗ
    |   ВТТаблицаЗарплатаИВзносы КАК ВТТаблицаЗарплатаИВзносы
    |       ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НалогиСборыОтчисления КАК НалогиСборыОтчисления
    |       ПО (НалогиСборыОтчисления.Ссылка = ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.ОтчисленияОбязательноеСоциальноеМедицинскоеСтрахование))
    |ГДЕ
	|	НЕ ВТТаблицаЗарплатаИВзносы.ВидОперации В (&МассивВидыОперацийРезервы)
	|		И ВТТаблицаЗарплатаИВзносы.РезервОплатыТруда = ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка)
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
	//Сухомлинов++  киб_Участок
    |   НЕОПРЕДЕЛЕНО,
	//Сухомлинов--
    |   ВТТаблицаПени.Ссылка,
    |   ВТТаблицаПени.НомерСтроки,
    |   ВТТаблицаПени.Подразделение,
    |   ВТТаблицаПени.ВидОперации,
    |   ВТТаблицаПени.ФизическоеЛицо,
    |   ВТТаблицаПени.СтруктурноеПодразделение,
    |   ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка),
    |   ВТТаблицаПени.ВидПлатежа,
    |   ВЫБОР
    |       КОГДА ВТТаблицаПени.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |           ТОГДА ВТТаблицаПени.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1
    |       ИНАЧЕ ВТТаблицаПени.Подразделение
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаПени.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |           ТОГДА ВТТаблицаПени.СпособОтраженияЗарплатыВБухучете.СубконтоНУ1
    |       ИНАЧЕ ВТТаблицаПени.Подразделение
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаПени.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаПени.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаПени.СпособОтраженияЗарплатыВБухучете.СчетБУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаПени.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаПени.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаПени.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1
    |       ИНАЧЕ ВЫБОР
    |               КОГДА ВТТаблицаПени.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.СОПеня)
    |                   ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПеняПоСО)
    |               КОГДА ВТТаблицаПени.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОПВПеня)
    |                   ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПеняПоОПВ)
    |               КОГДА ВТТаблицаПени.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОППВПеня)
    |                   ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПеняПоОППВ)
    |               КОГДА ВТТаблицаПени.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОПВРПеня)
    |                   ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПеняПоОПВР)
    |               КОГДА ВТТаблицаПени.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМСПеня)
    |                   ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПеняПоВОСМС)
    |               КОГДА ВТТаблицаПени.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ЕППеня)
    |                   ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПеняПоЕП)
    |               ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПеняПоООСМС)
    |           КОНЕЦ
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаПени.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаПени.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаПени.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаПени.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаПени.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаПени.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаПени.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаПени.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаПени.СпособОтраженияЗарплатыВБухучете.СчетНУ
    |       КОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы) КАК ПланСчетов.Типовой).СчетНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяСсылка)
    |           ТОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы) КАК ПланСчетов.Типовой).СчетНУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ОбщиеИАдминистративныеРасходы)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаПени.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаПени.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаПени.СпособОтраженияЗарплатыВБухучете.СубконтоНУ1
    |       ИНАЧЕ ВЫБОР
    |               КОГДА ВТТаблицаПени.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.СОПеня)
    |                   ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПеняПоСО)
    |               КОГДА ВТТаблицаПени.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОПВПеня)
    |                   ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПеняПоОПВ)
    |               КОГДА ВТТаблицаПени.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОППВПеня)
    |                   ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПеняПоОППВ)
    |               КОГДА ВТТаблицаПени.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОПВРПеня)
    |                   ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПеняПоОПВР)
    |               КОГДА ВТТаблицаПени.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМСПеня)
    |                   ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПеняПоВОСМС)
    |               КОГДА ВТТаблицаПени.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ЕППеня)
    |                   ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПеняПоЕП)
    |               ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПеняПоООСМС)
    |           КОНЕЦ
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаПени.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаПени.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаПени.СпособОтраженияЗарплатыВБухучете.СубконтоНУ2
    |       КОГДА НЕ &ВедениеУчетаПоСотрудникам
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаПени.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаПени.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаПени.СпособОтраженияЗарплатыВБухучете.СубконтоНУ3
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   ВТТаблицаПени.Сумма,
    |   ВЫБОР
    |       КОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ <> ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка)
    |           ТОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ
    |       ИНАЧЕ ВЫБОР
    |               КОГДА ВТТаблицаПени.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.СОПеня)
    |                   ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Типовой.ОбязательстваПоСоциальномуСтрахованию)
    |               КОГДА ВТТаблицаПени.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМСПеня)
    |                   ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Типовой.ОбязательстваПоВзносамОСМС)
    |               КОГДА ВТТаблицаПени.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ООСМСПеня)
    |                   ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Типовой.ОбязательстваПоОтчислениямОСМС)
    |               КОГДА ВТТаблицаПени.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ЕППеня)
    |                   ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Типовой.ОбязательстваПоЕдиномуПлатежу)
    |               КОГДА ВТТаблицаПени.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОПВРПеня)
    |                   ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Типовой.ОбязательстваПоОбязательнымПенсионнымВзносамРаботодателя)
    |               ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.ОбязательстваПоПенсионнымОтчислениям)
    |           КОНЕЦ
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаПени.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.СОПеня)
    |               ИЛИ ВТТаблицаПени.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМСПеня)
    |               ИЛИ ВТТаблицаПени.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ООСМСПеня)
	|				ИЛИ ВТТаблицаПени.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОПВРПеня)
    |           ТОГДА ВЫБОР
    |                   КОГДА ВТТаблицаПени.ВидПлатежа = ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.ПустаяССылка)
    |                       ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.ПениСам)
    |                   ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.ПустаяСсылка)
    |               КОНЕЦ
    |       КОГДА ВТТаблицаПени.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОПВПеня)
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.ОбязательныеПенсионныеВзносы)
    |       КОГДА ВТТаблицаПени.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ЕППеня)
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.ЕдиныйПлатеж)
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.ОбязательныеПрофессиональныеПенсионныеВзносы)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаПени.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.СОПеня)
    |               ИЛИ ВТТаблицаПени.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМСПеня)
    |               ИЛИ ВТТаблицаПени.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ООСМСПеня)
    |               ИЛИ ВТТаблицаПени.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОПВРПеня)
    |           ТОГДА ВЫБОР
    |                   КОГДА НЕ &ВедениеУчетаПоСотрудникам
    |                       ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
    |                   ИНАЧЕ НЕОПРЕДЕЛЕНО
    |               КОНЕЦ
    |       ИНАЧЕ ВЫБОР
    |               КОГДА ВТТаблицаПени.ВидПлатежа = ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.ПустаяССылка)
    |                   ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.ПениСам)
    |               ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.ПустаяСсылка)
    |           КОНЕЦ
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаПени.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОПВПеня)
    |               ИЛИ ВТТаблицаПени.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОППВПеня)
    |           ТОГДА ВЫБОР
    |                   КОГДА НЕ &ВедениеУчетаПоСотрудникам
    |                       ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
    |                   ИНАЧЕ НЕОПРЕДЕЛЕНО
    |               КОНЕЦ
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ <> ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка)
    |               И НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяСсылка)
    |           ТОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомНУ
    |       КОГДА ВЫРАЗИТЬ(ВЫБОР
    |                   КОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ <> ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка)
    |                       ТОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ
    |                   ИНАЧЕ ВЫБОР
    |                           КОГДА ВТТаблицаПени.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.СОПеня)
    |                               ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Типовой.ОбязательстваПоСоциальномуСтрахованию)
    |                           КОГДА ВТТаблицаПени.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМСПеня)
    |                               ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Типовой.ОбязательстваПоВзносамОСМС)
    |                           КОГДА ВТТаблицаПени.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ООСМСПеня)
    |                               ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Типовой.ОбязательстваПоОтчислениямОСМС)
    |                           КОГДА ВТТаблицаПени.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ЕППеня)
    |                               ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Типовой.ОбязательстваПоЕдиномуПлатежу)
    |                           КОГДА ВТТаблицаПени.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОПВРПеня)
    |                               ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Типовой.ОбязательстваПоОбязательнымПенсионнымВзносамРаботодателя)
    |                           ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.ОбязательстваПоПенсионнымОтчислениям)
    |                       КОНЕЦ
    |               КОНЕЦ КАК ПланСчетов.Типовой).СчетНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяСсылка)
    |           ТОГДА ВЫРАЗИТЬ(ВЫБОР
    |                       КОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ <> ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка)
    |                           ТОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ
    |                       ИНАЧЕ ВЫБОР
    |                               КОГДА ВТТаблицаПени.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.СОПеня)
    |                                   ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Типовой.ОбязательстваПоСоциальномуСтрахованию)
    |                               КОГДА ВТТаблицаПени.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМСПеня)
    |                                   ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Типовой.ОбязательстваПоВзносамОСМС)
    |                               КОГДА ВТТаблицаПени.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ООСМСПеня)
    |                                   ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Типовой.ОбязательстваПоОтчислениямОСМС)
    |                               КОГДА ВТТаблицаПени.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ЕППеня)
    |                                   ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Типовой.ОбязательстваПоЕдиномуПлатежу)
    |                               КОГДА ВТТаблицаПени.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОПВРПеня)
    |                                   ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Типовой.ОбязательстваПоОбязательнымПенсионнымВзносамРаботодателя)
    |                               ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.ОбязательстваПоПенсионнымОтчислениям)
    |                           КОНЕЦ
    |                   КОНЕЦ КАК ПланСчетов.Типовой).СчетНУ
    |       ИНАЧЕ ВЫБОР
    |               КОГДА ВТТаблицаПени.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.СОПеня)
    |                   ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ОбязательстваПоСоциальномуСтрахованию)
    |               КОГДА ВТТаблицаПени.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМСПеня)
    |                   ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ОбязательстваПоВзносамОСМС)
    |               КОГДА ВТТаблицаПени.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ООСМСПеня)
    |                   ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ОбязательстваПоОтчислениямОСМС)
    |               КОГДА ВТТаблицаПени.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ЕППеня)
    |                   ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ОбязательстваПоЕдиномуПлатежу)
    |               КОГДА ВТТаблицаПени.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОПВРПеня)
    |                   ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ОбязательстваПоОбязательнымПенсионнымВзносамРаботодателя)
    |               ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ОбязательстваПоПенсионнымОтчислениям)
    |           КОНЕЦ
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаПени.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.СОПеня)
    |               ИЛИ ВТТаблицаПени.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМСПеня)
    |               ИЛИ ВТТаблицаПени.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ООСМСПеня)
	|				ИЛИ ВТТаблицаПени.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОПВРПеня)
    |           ТОГДА ВЫБОР
    |                   КОГДА ВТТаблицаПени.ВидПлатежа = ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.ПустаяССылка)
    |                       ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.ПениСам)
    |                   ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.ПустаяСсылка)
    |               КОНЕЦ
    |       КОГДА ВТТаблицаПени.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОПВПеня)
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.ОбязательныеПенсионныеВзносы)
    |       КОГДА ВТТаблицаПени.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ЕППеня)
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.ЕдиныйПлатеж)
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.ОбязательныеПрофессиональныеПенсионныеВзносы)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаПени.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.СОПеня)
    |               ИЛИ ВТТаблицаПени.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМСПеня)
    |               ИЛИ ВТТаблицаПени.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ООСМСПеня)
    |               ИЛИ ВТТаблицаПени.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОПВРПеня)
    |           ТОГДА ВЫБОР
    |                   КОГДА НЕ &ВедениеУчетаПоСотрудникам
    |                       ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
    |                   ИНАЧЕ НЕОПРЕДЕЛЕНО
    |               КОНЕЦ
    |       ИНАЧЕ ВЫБОР
    |               КОГДА ВТТаблицаПени.ВидПлатежа = ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.ПустаяССылка)
    |                   ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.ПениСам)
    |               ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.ПустаяСсылка)
    |           КОНЕЦ
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаПени.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОПВПеня)
    |               ИЛИ ВТТаблицаПени.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОППВПеня)
    |           ТОГДА ВЫБОР
    |                   КОГДА НЕ &ВедениеУчетаПоСотрудникам
    |                       ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
    |                   ИНАЧЕ НЕОПРЕДЕЛЕНО
    |               КОНЕЦ
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО
    |ИЗ
    |   ВТТаблицаПени КАК ВТТаблицаПени
    |       ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НалогиСборыОтчисления КАК НалогиСборыОтчисления
    |       ПО (ВЫБОР
    |               КОГДА ВТТаблицаПени.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.СОПеня)
    |                   ТОГДА НалогиСборыОтчисления.Ссылка = ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.ОбязательныеСоциальныеОтчисления)
    |               КОГДА ВТТаблицаПени.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОПВПеня)
    |                   ТОГДА НалогиСборыОтчисления.Ссылка = ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.ОбязательныеПенсионныеВзносы)
    |               КОГДА ВТТаблицаПени.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОППВПеня)
    |                   ТОГДА НалогиСборыОтчисления.Ссылка = ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.ОбязательныеПрофессиональныеПенсионныеВзносы)
    |               КОГДА ВТТаблицаПени.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОПВРПеня)
    |                   ТОГДА НалогиСборыОтчисления.Ссылка = ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.ОбязательныеПенсионныеВзносыРаботодателя)
    |               КОГДА ВТТаблицаПени.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМСПеня)
    |                   ТОГДА НалогиСборыОтчисления.Ссылка = ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.ВзносыОбязательноеСоциальноеМедицинскоеСтрахование)
    |               КОГДА ВТТаблицаПени.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ЕППеня)
    |                   ТОГДА НалогиСборыОтчисления.Ссылка = ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.ЕдиныйПлатеж)
    |               ИНАЧЕ НалогиСборыОтчисления.Ссылка = ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.ОтчисленияОбязательноеСоциальноеМедицинскоеСтрахование)
    |           КОНЕЦ)
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
	//Сухомлинов++  киб_Участок
    |   НЕОПРЕДЕЛЕНО,
	//Сухомлинов--
    |   ВТТаблицаРегламентированныеУдержания.Ссылка,
    |   ВТТаблицаРегламентированныеУдержания.НомерСтроки,
    |   ВТТаблицаРегламентированныеУдержания.Подразделение,
    |   ВТТаблицаРегламентированныеУдержания.ВидОперации,
    |   ВТТаблицаРегламентированныеУдержания.ФизическоеЛицо,
    |   ВТТаблицаРегламентированныеУдержания.СтруктурноеПодразделение,
    |   ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка),
    |   ВТТаблицаРегламентированныеУдержания.Контрагент,
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.Налог),
    |   ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
    |   ВЫБОР
    |       КОГДА ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ИПН)
    |               ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОПВ)
    |               ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМС)
    |               ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ЕП)
    |           ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Типовой.КраткосрочнаяЗадолженностьПоОплатеТруда)
    |       КОГДА ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ИПНДивиденды)
    |           ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Типовой.КраткосрочнаяКредиторскаяЗадолженностьПоДивидендамИДоходамУчастников)
    |       КОГДА ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОПВДоходыСубъектаПредпринимательства)
    |           ТОГДА УчетнаяПолитикаНалоговыйУчет.СпособОтраженияОПВИП.СчетДт
    |       КОГДА ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМСДоходыСубъектаПредпринимательства)
    |           ТОГДА УчетнаяПолитикаНалоговыйУчет.СпособОтраженияВОСМСИП.СчетДт
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПрочаяКраткосрочнаяКредиторскаяЗадолженность)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ИПН)
    |               ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОПВ)
    |               ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМС)
    |               ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ЕП)
    |           ТОГДА ВЫБОР
    |                   КОГДА НЕ &ВедениеУчетаПоСотрудникам
    |                       ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
    |                   ИНАЧЕ НЕОПРЕДЕЛЕНО
    |               КОНЕЦ
    |       КОГДА ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОПВДоходыСубъектаПредпринимательства)
    |           ТОГДА УчетнаяПолитикаНалоговыйУчет.СпособОтраженияОПВИП.СубконтоДт1
    |       КОГДА ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМСДоходыСубъектаПредпринимательства)
    |           ТОГДА УчетнаяПолитикаНалоговыйУчет.СпособОтраженияВОСМСИП.СубконтоДт1
    |       ИНАЧЕ ВТТаблицаРегламентированныеУдержания.Контрагент
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ИПН)
    |               ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОПВ)
    |               ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМС)
    |               ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ЕП)
    |           ТОГДА НЕОПРЕДЕЛЕНО
    |       КОГДА ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОПВДоходыСубъектаПредпринимательства)
    |           ТОГДА УчетнаяПолитикаНалоговыйУчет.СпособОтраженияОПВИП.СубконтоДт2
    |       КОГДА ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМСДоходыСубъектаПредпринимательства)
    |           ТОГДА УчетнаяПолитикаНалоговыйУчет.СпособОтраженияВОСМСИП.СубконтоДт2
    |       ИНАЧЕ ВТТаблицаРегламентированныеУдержания.ДоговорКонтрагента
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОПВДоходыСубъектаПредпринимательства)
    |           ТОГДА УчетнаяПолитикаНалоговыйУчет.СпособОтраженияОПВИП.СубконтоДт3
    |       КОГДА ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМСДоходыСубъектаПредпринимательства)
    |           ТОГДА УчетнаяПолитикаНалоговыйУчет.СпособОтраженияВОСМСИП.СубконтоДт3
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВЫРАЗИТЬ(ВЫБОР
    |                   КОГДА ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ИПН)
    |                           ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОПВ)
    |                           ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМС)
    |                           ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ЕП)
    |                       ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Типовой.КраткосрочнаяЗадолженностьПоОплатеТруда)
    |                   КОГДА ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ИПНДивиденды)
    |                       ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Типовой.КраткосрочнаяКредиторскаяЗадолженностьПоДивидендамИДоходамУчастников)
    |                   КОГДА ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОПВДоходыСубъектаПредпринимательства)
    |                       ТОГДА УчетнаяПолитикаНалоговыйУчет.СпособОтраженияОПВИП.СчетДт
    |                   КОГДА ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМСДоходыСубъектаПредпринимательства)
    |                       ТОГДА УчетнаяПолитикаНалоговыйУчет.СпособОтраженияВОСМСИП.СчетДт
    |                   ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПрочаяКраткосрочнаяКредиторскаяЗадолженность)
    |               КОНЕЦ КАК ПланСчетов.Типовой).СчетНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяССылка)
    |           ТОГДА ВЫРАЗИТЬ(ВЫБОР
    |                       КОГДА ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ИПН)
    |                               ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОПВ)
    |                               ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМС)
    |                               ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ЕП)
    |                           ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Типовой.КраткосрочнаяЗадолженностьПоОплатеТруда)
    |                       КОГДА ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ИПНДивиденды)
    |                           ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Типовой.КраткосрочнаяКредиторскаяЗадолженностьПоДивидендамИДоходамУчастников)
    |                       КОГДА ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОПВДоходыСубъектаПредпринимательства)
    |                           ТОГДА УчетнаяПолитикаНалоговыйУчет.СпособОтраженияОПВИП.СчетДт
    |                       КОГДА ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМСДоходыСубъектаПредпринимательства)
    |                           ТОГДА УчетнаяПолитикаНалоговыйУчет.СпособОтраженияВОСМСИП.СчетДт
    |                       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПрочаяКраткосрочнаяКредиторскаяЗадолженность)
    |                   КОНЕЦ КАК ПланСчетов.Типовой).СчетНУ
    |       ИНАЧЕ ВЫБОР
    |               КОГДА ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ИПН)
    |                       ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОПВ)
    |                       ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМС)
    |                       ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ЕП)
    |                   ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ВзаиморасчетыСРаботниками)
    |               КОГДА ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ИПНДивиденды)
    |                   ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПоступлениеИВыбытиеИмуществаработУслугПрав)
    |               КОГДА ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОПВДоходыСубъектаПредпринимательства)
    |                   ТОГДА УчетнаяПолитикаНалоговыйУчет.СпособОтраженияОПВИП.СчетДт
    |               КОГДА ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМСДоходыСубъектаПредпринимательства)
    |                   ТОГДА УчетнаяПолитикаНалоговыйУчет.СпособОтраженияВОСМСИП.СчетДт
    |               ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПоступлениеИВыбытиеИмуществаработУслугПрав)
    |           КОНЕЦ
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ИПН)
    |               ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОПВ)
    |               ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМС)
    |               ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ЕП)
    |           ТОГДА ВЫБОР
    |                   КОГДА НЕ &ВедениеУчетаПоСотрудникам
    |                       ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
    |                   ИНАЧЕ НЕОПРЕДЕЛЕНО
    |               КОНЕЦ
    |       КОГДА ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОПВДоходыСубъектаПредпринимательства)
    |           ТОГДА УчетнаяПолитикаНалоговыйУчет.СпособОтраженияОПВИП.СубконтоДтНУ1
    |       КОГДА ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМСДоходыСубъектаПредпринимательства)
    |           ТОГДА УчетнаяПолитикаНалоговыйУчет.СпособОтраженияВОСМСИП.СубконтоДтНУ1
    |       ИНАЧЕ ВТТаблицаРегламентированныеУдержания.Контрагент
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ИПН)
    |               ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОПВ)
    |               ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМС)
    |               ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ЕП)
    |           ТОГДА НЕОПРЕДЕЛЕНО
    |       КОГДА ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОПВДоходыСубъектаПредпринимательства)
    |           ТОГДА УчетнаяПолитикаНалоговыйУчет.СпособОтраженияОПВИП.СубконтоДтНУ2
    |       КОГДА ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМСДоходыСубъектаПредпринимательства)
    |           ТОГДА УчетнаяПолитикаНалоговыйУчет.СпособОтраженияВОСМСИП.СубконтоДтНУ2
    |       ИНАЧЕ ВТТаблицаРегламентированныеУдержания.ДоговорКонтрагента
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОПВДоходыСубъектаПредпринимательства)
    |           ТОГДА УчетнаяПолитикаНалоговыйУчет.СпособОтраженияОПВИП.СубконтоДтНУ3
    |       КОГДА ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМСДоходыСубъектаПредпринимательства)
    |           ТОГДА УчетнаяПолитикаНалоговыйУчет.СпособОтраженияВОСМСИП.СубконтоДтНУ3
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   ВТТаблицаРегламентированныеУдержания.Сумма,
    |   ВЫБОР
    |       КОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ <> ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка)
    |           ТОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ
    |       ИНАЧЕ ВЫБОР
    |               КОГДА ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМС)
    |                       ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМСДоходыКонтрагентов)
    |                       ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМСРасчетыСБывшимиСотрудниками)
    |                       ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМСДоходыСубъектаПредпринимательства)
    |                   ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Типовой.ОбязательстваПоВзносамОСМС)
    |               КОГДА ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОПВ)
    |                       ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОПВДоходыКонтрагентов)
    |                       ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОПВРасчетыСБывшимиСотрудниками)
    |                       ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОПВДоходыСубъектаПредпринимательства)
    |                   ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Типовой.ОбязательстваПоПенсионнымОтчислениям)
    |               КОГДА ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ИПНРасчетыСБывшимиСотрудниками)
    |                       ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ИПНДоходыКонтрагентов)
    |                       ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ИПНДоходыСубъектаПредпринимательства)
    |                       ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ИПНДивиденды)
    |                       ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ИПН)
    |                   ТОГДА ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.ИндивидуальныйПодоходныйНалог)
    |               КОГДА ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ЕП)
    |                   ТОГДА ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.ЕдиныйПлатеж)
    |               ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.ОбязательныеПрофессиональныеПенсионныеВзносы)
    |           КОНЕЦ
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМС)
    |               ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМСДоходыКонтрагентов)
    |               ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМСРасчетыСБывшимиСотрудниками)
    |               ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМСДоходыСубъектаПредпринимательства)
    |           ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФОнды.Налог)
    |       КОГДА ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОПВ)
    |               ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОПВДоходыКонтрагентов)
    |               ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОПВРасчетыСБывшимиСотрудниками)
    |               ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОПВДоходыСубъектаПредпринимательства)
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.ОбязательныеПенсионныеВзносы)
    |       КОГДА ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ЕП)
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.ЕдиныйПлатеж)
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.ИндивидуальныйПодоходныйНалог)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМС)
    |               ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМСДоходыКонтрагентов)
    |               ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМСРасчетыСБывшимиСотрудниками)
    |               ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМСДоходыСубъектаПредпринимательства)
    |           ТОГДА ВЫБОР
    |                   КОГДА НЕ &ВедениеУчетаПоСотрудникам
    |                       ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
    |                   ИНАЧЕ НЕОПРЕДЕЛЕНО
    |               КОНЕЦ
    |       ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФОнды.Налог)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМС)
    |               ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМСДоходыКонтрагентов)
    |               ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМСРасчетыСБывшимиСотрудниками)
    |               ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМСДоходыСубъектаПредпринимательства)
    |                   И НЕ &ВедениеУчетаПоСотрудникам
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
    |       КОГДА ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ИПНРасчетыСБывшимиСотрудниками)
    |               ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ИПНДоходыКонтрагентов)
    |               ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ИПНДоходыСубъектаПредпринимательства)
    |               ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ИПНДивиденды)
    |           ТОГДА ВТТаблицаРегламентированныеУдержания.Контрагент
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ <> ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка)
    |               И НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяСсылка)
    |           ТОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомНУ
    |       КОГДА ВЫРАЗИТЬ(ВЫБОР
    |                   КОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ <> ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка)
    |                       ТОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ
    |                   ИНАЧЕ ВЫБОР
    |                           КОГДА ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМС)
    |                                   ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМСДоходыКонтрагентов)
    |                                   ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМСРасчетыСБывшимиСотрудниками)
    |                                   ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМСДоходыСубъектаПредпринимательства)
    |                               ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Типовой.ОбязательстваПоВзносамОСМС)
    |                           КОГДА ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОПВ)
    |                                   ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОПВДоходыКонтрагентов)
    |                                   ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОПВРасчетыСБывшимиСотрудниками)
    |                                   ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОПВДоходыСубъектаПредпринимательства)
    |                               ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Типовой.ОбязательстваПоПенсионнымОтчислениям)
    |                           КОГДА ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ЕП)
    |                               ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Типовой.ОбязательстваПоЕдиномуПлатежу)
    |                           ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.ИндивидуальныйПодоходныйНалог)
    |                       КОНЕЦ
    |               КОНЕЦ КАК ПланСчетов.Типовой).СчетНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяССылка)
    |           ТОГДА ВЫРАЗИТЬ(ВЫБОР
    |                       КОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ <> ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка)
    |                           ТОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ
    |                       ИНАЧЕ ВЫБОР
    |                               КОГДА ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМС)
    |                                       ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМСДоходыКонтрагентов)
    |                                       ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМСРасчетыСБывшимиСотрудниками)
    |                                       ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМСДоходыСубъектаПредпринимательства)
    |                                   ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Типовой.ОбязательстваПоВзносамОСМС)
    |                               КОГДА ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОПВ)
    |                                       ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОПВДоходыКонтрагентов)
    |                                       ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОПВРасчетыСБывшимиСотрудниками)
    |                                       ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОПВДоходыСубъектаПредпринимательства)
    |                                   ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Типовой.ОбязательстваПоПенсионнымОтчислениям)
    |                               КОГДА ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ЕП)
    |                                   ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Типовой.ОбязательстваПоЕдиномуПлатежу)
    |                               ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.ИндивидуальныйПодоходныйНалог)
    |                           КОНЕЦ
    |                   КОНЕЦ КАК ПланСчетов.Типовой).СчетНУ
    |       ИНАЧЕ ВЫБОР
    |               КОГДА ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМС)
    |                       ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМСДоходыКонтрагентов)
    |                       ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМСРасчетыСБывшимиСотрудниками)
    |                       ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМСДоходыСубъектаПредпринимательства)
    |                   ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ОбязательстваПоВзносамОСМС)
    |               КОГДА ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОПВ)
    |                       ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОПВДоходыКонтрагентов)
    |                       ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОПВРасчетыСБывшимиСотрудниками)
    |                       ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОПВДоходыСубъектаПредпринимательства)
    |                   ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ОбязательстваПоПенсионнымОтчислениям)
    |               КОГДА ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ЕП)
    |                   ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ОбязательстваПоЕдиномуПлатежу)
    |               ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ИндивидуальныйПодоходныйНалог)
    |           КОНЕЦ
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМС)
    |               ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМСДоходыКонтрагентов)
    |               ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМСРасчетыСБывшимиСотрудниками)
    |               ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМСДоходыСубъектаПредпринимательства)
    |           ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФОнды.Налог)
    |       КОГДА ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОПВ)
    |               ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОПВДоходыКонтрагентов)
    |               ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОПВРасчетыСБывшимиСотрудниками)
    |               ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОПВДоходыСубъектаПредпринимательства)
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.ОбязательныеПенсионныеВзносы)
    |       КОГДА ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ИПНРасчетыСБывшимиСотрудниками)
    |               ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ИПНДоходыСубъектаПредпринимательства)
    |               ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ИПНДоходыКонтрагентов)
    |               ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ИПНДивиденды)
    |               ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ИПН)
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.ИндивидуальныйПодоходныйНалог)
    |       КОГДА ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ЕП)
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.ЕдиныйПлатеж)
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.ОбязательныеПрофессиональныеПенсионныеВзносы)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМС)
    |               ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМСДоходыКонтрагентов)
    |               ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМСРасчетыСБывшимиСотрудниками)
    |               ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМСДоходыСубъектаПредпринимательства)
    |           ТОГДА ВЫБОР
    |                   КОГДА НЕ &ВедениеУчетаПоСотрудникам
    |                       ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
    |                   ИНАЧЕ НЕОПРЕДЕЛЕНО
    |               КОНЕЦ
    |       ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФОнды.Налог)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМС)
    |               ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМСДоходыКонтрагентов)
    |               ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМСРасчетыСБывшимиСотрудниками)
    |               ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМСДоходыСубъектаПредпринимательства)
    |                   И НЕ &ВедениеУчетаПоСотрудникам
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
    |       КОГДА ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ИПНРасчетыСБывшимиСотрудниками)
    |               ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ИПНДоходыКонтрагентов)
    |               ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ИПНДоходыСубъектаПредпринимательства)
    |               ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ИПНДивиденды)
    |           ТОГДА ВТТаблицаРегламентированныеУдержания.Контрагент
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО
    |ИЗ
    |   ВТТаблицаРегламентированныеУдержания КАК ВТТаблицаРегламентированныеУдержания
    |       ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НалогиСборыОтчисления КАК НалогиСборыОтчисления
    |       ПО (ВЫБОР
    |               КОГДА ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМС)
    |                       ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМСДоходыКонтрагентов)
    |                       ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМСРасчетыСБывшимиСотрудниками)
    |                       ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМСДоходыСубъектаПредпринимательства)
    |                   ТОГДА НалогиСборыОтчисления.Ссылка = ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.ВзносыОбязательноеСоциальноеМедицинскоеСтрахование)
    |               КОГДА ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОПВ)
    |                       ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОПВДоходыКонтрагентов)
    |                       ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОПВРасчетыСБывшимиСотрудниками)
    |                       ИЛИ ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОПВДоходыСубъектаПредпринимательства)
    |                   ТОГДА НалогиСборыОтчисления.Ссылка = ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.ОбязательныеПенсионныеВзносы)
    |               КОГДА ВТТаблицаРегламентированныеУдержания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ЕП)
    |                   ТОГДА НалогиСборыОтчисления.Ссылка = ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.ЕдиныйПлатеж)
    |               ИНАЧЕ НалогиСборыОтчисления.Ссылка = ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.ИндивидуальныйПодоходныйНалог)
    |           КОНЕЦ)
    |       ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаНалоговыйУчет.СрезПоследних(&ПериодРегистрации, ) КАК УчетнаяПолитикаНалоговыйУчет
    |       ПО ВТТаблицаРегламентированныеУдержания.Организация = УчетнаяПолитикаНалоговыйУчет.Организация
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
	//Сухомлинов++  киб_Участок
    |   НЕОПРЕДЕЛЕНО,
	//Сухомлинов--
    |   ВТТаблицаУдержаннаяЗарплата.Ссылка,
    |   ВТТаблицаУдержаннаяЗарплата.НомерСтроки,
    |   ВТТаблицаУдержаннаяЗарплата.Подразделение,
    |   ВТТаблицаУдержаннаяЗарплата.ВидОперации,
    |   ВТТаблицаУдержаннаяЗарплата.ФизическоеЛицо,
    |   ВТТаблицаУдержаннаяЗарплата.СтруктурноеПодразделение,
    |   ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка),
    |   ВТТаблицаУдержаннаяЗарплата.Контрагент,
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
    |   ВЫБОР
    |       КОГДА ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.НачисленоПроцентовПоЗайму)
    |           ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Типовой.КраткосрочныеВознагражденияКПолучениюРаботникам)
    |       КОГДА ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.АлиментыПрочиеИсполнительныеЛистыКонтрагенты)
    |               ИЛИ ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВознаграждениеПлатежногоАгентаКонтрагенты)
    |           ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПрочаяКраткосрочнаяКредиторскаяЗадолженность)
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.КраткосрочнаяЗадолженностьПоОплатеТруда)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.АлиментыПрочиеИсполнительныеЛистыКонтрагенты)
    |               ИЛИ ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВознаграждениеПлатежногоАгентаКонтрагенты)
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
    |       КОГДА НЕ &ВедениеУчетаПоСотрудникам
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.АлиментыПрочиеИсполнительныеЛистыКонтрагенты)
    |               ИЛИ ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВознаграждениеПлатежногоАгентаКонтрагенты)
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
    |       КОГДА НЕ &ВедениеУчетаПоСотрудникам
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   НЕОПРЕДЕЛЕНО,
    |   ВЫБОР
    |       КОГДА ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.НачисленоПроцентовПоЗайму)
    |           ТОГДА &СчетНУКраткосрочныеВознагражденияКПолучениюРаботникам
    |       КОГДА ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.АлиментыПрочиеИсполнительныеЛистыКонтрагенты)
    |               ИЛИ ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВознаграждениеПлатежногоАгентаКонтрагенты)
    |           ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПоступлениеИВыбытиеИмуществаработУслугПрав)
    |       ИНАЧЕ &СчетНУКраткосрочнаяЗадолженностьПоОплатеТруда
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.НачисленоПроцентовПоЗайму)
    |               ИЛИ ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.АлиментыПрочиеИсполнительныеЛистыКонтрагенты)
    |               ИЛИ ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВознаграждениеПлатежногоАгентаКонтрагенты)
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
    |       ИНАЧЕ ВЫБОР
    |               КОГДА &ВедениеУчетаПоСотрудникам
    |                   ТОГДА НЕОПРЕДЕЛЕНО
    |               ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
    |           КОНЕЦ
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.НачисленоПроцентовПоЗайму)
    |               ИЛИ ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.АлиментыПрочиеИсполнительныеЛистыКонтрагенты)
    |               ИЛИ ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВознаграждениеПлатежногоАгентаКонтрагенты)
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяССылка)
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   НЕОПРЕДЕЛЕНО,
    |   ВТТаблицаУдержаннаяЗарплата.Сумма,
    |   ВЫБОР
    |       КОГДА ВТТаблицаУдержаннаяЗарплата.СчетУчета <> ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка)
    |           ТОГДА ВТТаблицаУдержаннаяЗарплата.СчетУчета
    |       КОГДА ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.АлиментыПрочиеИсполнительныеЛисты)
    |               ИЛИ ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.АлиментыПрочиеИсполнительныеЛистыКонтрагенты)
    |           ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Типовой.КраткосрочнаяЗадолженностьПоИсполнительнымЛистам)
    |       КОГДА ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВозвратИзлишнеВыплаченныхСуммВследствиеСчетныхОшибок)
    |           ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Типовой.КраткосрочнаяЗадолженностьПоВыплаченнойЗаработнойПлате)
    |       КОГДА ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВознаграждениеПлатежногоАгента)
    |               ИЛИ ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВознаграждениеПлатежногоАгентаКонтрагенты)
    |           ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПрочаяКраткосрочнаяКредиторскаяЗадолженность)
    |       КОГДА ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.НачисленоПроцентовПоЗайму)
    |           ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Типовой.ДоходыПоВознаграждениям)
    |       КОГДА ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПогашениеЗаймов)
    |           ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Типовой.КраткосрочнаяЗадолженностьПоПредоставленнымРаботникамЗаймам)
    |       КОГДА ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.Профвзносы)
    |           ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПрочаяКраткосрочнаяКредиторскаяЗадолженность)
    |       КОГДА ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПроцентыПоЗайму)
    |           ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Типовой.КраткосрочныеВознагражденияКПолучениюРаботникам)
    |       КОГДА ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.УдержаниеНеизрасходованныхПодотчетныхСумм)
    |           ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Типовой.КраткосрочнаяЗадолженностьПодотчетныхЛиц)
    |       КОГДА ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ДобровольныеВзносыВНПФ)
    |           ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Типовой.ОбязательстваПоПенсионнымОтчислениям)
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПрочаяКраткосрочнаяЗадолженностьРаботников)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаУдержаннаяЗарплата.СчетУчета <> ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка)
    |           ТОГДА ВТТаблицаУдержаннаяЗарплата.Субконто1
    |       КОГДА ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.АлиментыПрочиеИсполнительныеЛисты)
    |               ИЛИ ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.АлиментыПрочиеИсполнительныеЛистыКонтрагенты)
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
    |       КОГДА ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВозвратИзлишнеВыплаченныхСуммВследствиеСчетныхОшибок)
    |               И НЕ &ВедениеУчетаПоСотрудникам
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
    |       КОГДА ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВознаграждениеПлатежногоАгента)
    |               ИЛИ ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВознаграждениеПлатежногоАгентаКонтрагенты)
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
    |       КОГДА ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.НачисленоПроцентовПоЗайму)
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.Доходы.ПустаяСсылка)
    |       КОГДА ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПогашениеЗаймов)
    |               И НЕ &ВедениеУчетаПоСотрудникам
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
    |       КОГДА ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.Профвзносы)
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
    |       КОГДА ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПроцентыПоЗайму)
    |               И НЕ &ВедениеУчетаПоСотрудникам
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
    |       КОГДА ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.УдержаниеНеизрасходованныхПодотчетныхСумм)
    |               И НЕ &ВедениеУчетаПоСотрудникам
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
    |       КОГДА ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ДобровольныеВзносыВНПФ)
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.ОбязательныеПенсионныеВзносы)
    |       ИНАЧЕ ВЫБОР
    |               КОГДА &ВедениеУчетаПоСотрудникам
    |                   ТОГДА НЕОПРЕДЕЛЕНО
    |               ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
    |           КОНЕЦ
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаУдержаннаяЗарплата.СчетУчета <> ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка)
    |           ТОГДА ВТТаблицаУдержаннаяЗарплата.Субконто2
    |       КОГДА ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВознаграждениеПлатежногоАгента)
    |               ИЛИ ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВознаграждениеПлатежногоАгентаКонтрагенты)
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
    |       КОГДА ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.Профвзносы)
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
    |       КОГДА ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.УдержаниеНеизрасходованныхПодотчетныхСумм)
    |           ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЗадолженностиПодотчетныхЛиц.Прочие)
    |       КОГДА ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.НачисленоПроцентовПоЗайму)
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
    |       КОГДА ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ДобровольныеВзносыВНПФ)
    |           ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФОнды.Налог)
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаУдержаннаяЗарплата.СчетУчета <> ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка)
    |           ТОГДА ВТТаблицаУдержаннаяЗарплата.Субконто3
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВЫРАЗИТЬ(ВЫБОР
    |                   КОГДА ВТТаблицаУдержаннаяЗарплата.СчетУчета <> ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка)
    |                       ТОГДА ВТТаблицаУдержаннаяЗарплата.СчетУчета
    |                   КОГДА ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.АлиментыПрочиеИсполнительныеЛисты)
    |                           ИЛИ ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.АлиментыПрочиеИсполнительныеЛистыКонтрагенты)
    |                       ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Типовой.КраткосрочнаяЗадолженностьПоИсполнительнымЛистам)
    |                   КОГДА ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВозвратИзлишнеВыплаченныхСуммВследствиеСчетныхОшибок)
    |                       ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Типовой.КраткосрочнаяЗадолженностьПоВыплаченнойЗаработнойПлате)
    |                   КОГДА ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВознаграждениеПлатежногоАгента)
    |                           ИЛИ ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВознаграждениеПлатежногоАгентаКонтрагенты)
    |                       ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПрочаяКраткосрочнаяКредиторскаяЗадолженность)
    |                   КОГДА ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.НачисленоПроцентовПоЗайму)
    |                       ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Типовой.ДоходыПоВознаграждениям)
    |                   КОГДА ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПогашениеЗаймов)
    |                       ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Типовой.КраткосрочнаяЗадолженностьПоПредоставленнымРаботникамЗаймам)
    |                   КОГДА ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.Профвзносы)
    |                       ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПрочаяКраткосрочнаяКредиторскаяЗадолженность)
    |                   КОГДА ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПроцентыПоЗайму)
    |                       ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Типовой.КраткосрочныеВознагражденияКПолучениюРаботникам)
    |                   КОГДА ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.УдержаниеНеизрасходованныхПодотчетныхСумм)
    |                       ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Типовой.КраткосрочнаяЗадолженностьПодотчетныхЛиц)
    |                   КОГДА ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ДобровольныеВзносыВНПФ)
    |                       ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Типовой.ОбязательстваПоПенсионнымОтчислениям)
    |                   ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПрочаяКраткосрочнаяЗадолженностьРаботников)
    |               КОНЕЦ КАК ПланСчетов.Типовой).СчетНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяСсылка)
    |           ТОГДА ВЫРАЗИТЬ(ВЫБОР
    |                       КОГДА ВТТаблицаУдержаннаяЗарплата.СчетУчета <> ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка)
    |                           ТОГДА ВТТаблицаУдержаннаяЗарплата.СчетУчета
    |                       КОГДА ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.АлиментыПрочиеИсполнительныеЛисты)
    |                               ИЛИ ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.АлиментыПрочиеИсполнительныеЛистыКонтрагенты)
    |                           ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Типовой.КраткосрочнаяЗадолженностьПоИсполнительнымЛистам)
    |                       КОГДА ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВозвратИзлишнеВыплаченныхСуммВследствиеСчетныхОшибок)
    |                           ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Типовой.КраткосрочнаяЗадолженностьПоВыплаченнойЗаработнойПлате)
    |                       КОГДА ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВознаграждениеПлатежногоАгента)
    |                               ИЛИ ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВознаграждениеПлатежногоАгентаКонтрагенты)
    |                           ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПрочаяКраткосрочнаяКредиторскаяЗадолженность)
    |                       КОГДА ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.НачисленоПроцентовПоЗайму)
    |                           ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Типовой.ДоходыПоВознаграждениям)
    |                       КОГДА ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПогашениеЗаймов)
    |                           ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Типовой.КраткосрочнаяЗадолженностьПоПредоставленнымРаботникамЗаймам)
    |                       КОГДА ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.Профвзносы)
    |                           ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПрочаяКраткосрочнаяКредиторскаяЗадолженность)
    |                       КОГДА ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПроцентыПоЗайму)
    |                           ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Типовой.КраткосрочныеВознагражденияКПолучениюРаботникам)
    |                       КОГДА ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.УдержаниеНеизрасходованныхПодотчетныхСумм)
    |                           ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Типовой.КраткосрочнаяЗадолженностьПодотчетныхЛиц)
    |                       КОГДА ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ДобровольныеВзносыВНПФ)
    |                           ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Типовой.ОбязательстваПоПенсионнымОтчислениям)
    |                       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПрочаяКраткосрочнаяЗадолженностьРаботников)
    |                   КОНЕЦ КАК ПланСчетов.Типовой).СчетНУ
    |       ИНАЧЕ ВЫБОР
    |               КОГДА ВТТаблицаУдержаннаяЗарплата.СчетУчета <> ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка)
    |                   ТОГДА ВТТаблицаУдержаннаяЗарплата.СчетУчета
    |               КОГДА ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.АлиментыПрочиеИсполнительныеЛисты)
    |                       ИЛИ ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.АлиментыПрочиеИсполнительныеЛистыКонтрагенты)
    |                   ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ЗадолженностьПоИсполнительнымЛистам)
    |               КОГДА ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВозвратИзлишнеВыплаченныхСуммВследствиеСчетныхОшибок)
    |                   ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ВзаиморасчетыСРаботниками)
    |               КОГДА ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВознаграждениеПлатежногоАгента)
    |                       ИЛИ ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВознаграждениеПлатежногоАгентаКонтрагенты)
    |                   ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПоступлениеИВыбытиеИмуществаработУслугПрав)
    |               КОГДА ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.НачисленоПроцентовПоЗайму)
    |                   ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПрочиеДоходы)
    |               КОГДА ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПогашениеЗаймов)
    |                   ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Налоговый.КредитыИЗаймыВыданные)
    |               КОГДА ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.Профвзносы)
    |                   ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПоступлениеИВыбытиеИмуществаработУслугПрав)
    |               КОГДА ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПроцентыПоЗайму)
    |                   ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Налоговый.КредитыИЗаймыПолученные)
    |               КОГДА ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.УдержаниеНеизрасходованныхПодотчетныхСумм)
    |                   ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ЗадолженностьПодотчетныхЛиц)
    |               КОГДА ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ДобровольныеВзносыВНПФ)
    |                   ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ОбязательстваПоПенсионнымОтчислениям)
    |               ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ЗадолженностьПодотчетныхЛиц)
    |           КОНЕЦ
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.АлиментыПрочиеИсполнительныеЛисты)
    |               ИЛИ ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.АлиментыПрочиеИсполнительныеЛистыКонтрагенты)
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
    |       КОГДА ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВозвратИзлишнеВыплаченныхСуммВследствиеСчетныхОшибок)
    |               И НЕ &ВедениеУчетаПоСотрудникам
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
    |       КОГДА ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВознаграждениеПлатежногоАгента)
    |               ИЛИ ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВознаграждениеПлатежногоАгентаКонтрагенты)
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
    |       КОГДА ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.НачисленоПроцентовПоЗайму)
    |           ТОГДА ВЫБОР
    |                   КОГДА ВТТаблицаУдержаннаяЗарплата.СчетУчета <> ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка)
    |                           И ТИПЗНАЧЕНИЯ(ВТТаблицаУдержаннаяЗарплата.Субконто1) = ТИП(Справочник.Доходы)
    |                       ТОГДА ВТТаблицаУдержаннаяЗарплата.Субконто1
    |                   ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Доходы.ПустаяСсылка)
    |               КОНЕЦ
    |       КОГДА ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПогашениеЗаймов)
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
    |       КОГДА ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.Профвзносы)
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
    |       КОГДА ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПроцентыПоЗайму)
    |               И НЕ &ВедениеУчетаПоСотрудникам
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
    |       КОГДА ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.УдержаниеНеизрасходованныхПодотчетныхСумм)
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
    |       КОГДА ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ДобровольныеВзносыВНПФ)
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.ОбязательныеПенсионныеВзносы)
    |       ИНАЧЕ ВЫБОР
    |               КОГДА &ВедениеУчетаПоСотрудникам
    |                   ТОГДА НЕОПРЕДЕЛЕНО
    |               ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
    |           КОНЕЦ
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВознаграждениеПлатежногоАгента)
    |               ИЛИ ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВознаграждениеПлатежногоАгентаКонтрагенты)
    |               ИЛИ ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПогашениеЗаймов)
    |               ИЛИ ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПроцентыПоЗайму)
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
    |       КОГДА ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.Профвзносы)
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
    |       КОГДА ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ДобровольныеВзносыВНПФ)
    |           ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФОнды.Налог)
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаУдержаннаяЗарплата.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.УдержаниеНеизрасходованныхПодотчетныхСумм)
    |           ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЗадолженностиПодотчетныхЛиц.Прочие)
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ВТТаблицаУдержаннаяЗарплата.КонтрагентОтправитель,
    |   ВТТаблицаУдержаннаяЗарплата.РаботникОрганизации
    |ИЗ
    |   ВТТаблицаУдержаннаяЗарплата КАК ВТТаблицаУдержаннаяЗарплата
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
	//Сухомлинов++  киб_Участок
    |   ВТТаблицаЗарплатаИВзносы.киб_Участок,
	//Сухомлинов--
    |   ВТТаблицаЗарплатаИВзносы.Ссылка,
    |   ВТТаблицаЗарплатаИВзносы.НомерСтроки,
    |   ВТТаблицаЗарплатаИВзносы.Подразделение,
    |   ВТТаблицаЗарплатаИВзносы.ВидОперации,
    |   ВТТаблицаЗарплатаИВзносы.ФизическоеЛицо,
    |   ВТТаблицаЗарплатаИВзносы.СтруктурноеПодразделение,
    |   ВТТаблицаЗарплатаИВзносы.Резерв,
    |   ВТТаблицаЗарплатаИВзносы.Контрагент,
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
	// Дорофеева А. 14.01.2025 Кибернетика
	//|   ЗНАЧЕНИЕ(ПланСчетов.Типовой.КраткосрочныеОценочныеОбязательстваПоВознаграждениямРаботникам),
	//|   ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка),
	//|   ВЫБОР
	//|       КОГДА НЕ &ВедениеУчетаПоСотрудникам
	//|           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	//|       ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|   КОНЕЦ, 
	//|   НЕОПРЕДЕЛЕНО,
	|   ВЫБОР 
	|		КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СчетБУ <> ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка) 
	|			ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СчетБУ 
	| 	ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы) 
	|	КОНЕЦ,
    |   ВЫБОР 
	|		КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СчетБУ <> ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка) 
	//Сухомлинов++
	//|			ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1 
	|	ТОГДА ВЫБОР
	|			КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1 ССЫЛКА Справочник.СтатьиЗатрат
	|				ТОГДА ЕСТЬNULL(киб_СоответствиеСпособовОтраженияНачисленийИСтатейЗатратСрезПоследних.СтатьяЗатрат, ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1)
	|			ИНАЧЕ ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1
	|		КОНЕЦ
	 //Сухомлинов--
	| 	ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка) 
	|	КОНЕЦ,
    |   ВЫБОР 
	|		КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СчетБУ <> ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка) 
	//Сухомлинов++
	//|			ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2 
	|	ТОГДА ВЫБОР
	|			КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2 ССЫЛКА Справочник.СтатьиЗатрат
	|				ТОГДА ЕСТЬNULL(киб_СоответствиеСпособовОтраженияНачисленийИСтатейЗатратСрезПоследних.СтатьяЗатрат, ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2)
	|			ИНАЧЕ ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2
	|		КОНЕЦ
	 //Сухомлинов-- 
	| 	ИНАЧЕ ВТТаблицаЗарплатаИВзносы.Подразделение 
	|	КОНЕЦ,
	|   ВЫБОР 
	|		КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СчетБУ <> ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка) 
	//Сухомлинов++
	//|			ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3 
	|	ТОГДА ВЫБОР
	|			КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3 ССЫЛКА Справочник.СтатьиЗатрат
	|				ТОГДА ЕСТЬNULL(киб_СоответствиеСпособовОтраженияНачисленийИСтатейЗатратСрезПоследних.СтатьяЗатрат, ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3)
	|			ИНАЧЕ ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3
	|		КОНЕЦ
	 //Сухомлинов-- 
	| 	ИНАЧЕ НЕОПРЕДЕЛЕНО 
	|	КОНЕЦ,
	//*********************
    |   ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПрочиеРасходы),
    |   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ВТТаблицаЗарплатаИВзносы.Сумма,
    |   ЗНАЧЕНИЕ(ПланСчетов.Типовой.КраткосрочнаяЗадолженностьПоОплатеТруда),
    |   ВЫБОР
    |       КОГДА НЕ &ВедениеУчетаПоСотрудникам
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ВзаиморасчетыСРаботниками),
    |   ВЫБОР
    |       КОГДА НЕ &ВедениеУчетаПоСотрудникам
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка),
    |   НЕОПРЕДЕЛЕНО,
	// Дорофеева А. 14.01.2025 Кибернетика
	//|   ВЫРАЗИТЬ(ВТТаблицаЗарплатаИВзносы.Резерв КАК Справочник.Резервы).СтатьяЗатрат,
	|	ВЫБОР
	|		КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
	//Сухомлинов++
	//|			ТОГДА ВЫБОР
	//|				КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1 ССЫЛКА Справочник.СтатьиЗатрат
	//|					ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1
	//|				КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2 ССЫЛКА Справочник.СтатьиЗатрат
	//|					ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2
	//|				КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3 ССЫЛКА Справочник.СтатьиЗатрат
	//|					ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3
	//|				ИНАЧЕ ВЫРАЗИТЬ(ВТТаблицаЗарплатаИВзносы.Резерв КАК Справочник.Резервы).СтатьяЗатрат
	//|			КОНЕЦ
	|			ТОГДА ЕСТЬNULL(киб_СоответствиеСпособовОтраженияНачисленийИСтатейЗатратСрезПоследних.СтатьяЗатрат,ВЫБОР
	|				КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1 ССЫЛКА Справочник.СтатьиЗатрат
	|					ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1
	|				КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2 ССЫЛКА Справочник.СтатьиЗатрат
	|					ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2
	|				КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3 ССЫЛКА Справочник.СтатьиЗатрат
	|					ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3
	|				ИНАЧЕ ВЫРАЗИТЬ(ВТТаблицаЗарплатаИВзносы.Резерв КАК Справочник.Резервы).СтатьяЗатрат
	|			КОНЕЦ) 
	//Сухомлинов--
	|		ИНАЧЕ ВЫРАЗИТЬ(ВТТаблицаЗарплатаИВзносы.Резерв КАК Справочник.Резервы).СтатьяЗатрат
	|	КОНЕЦ,
    //*********************
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО
    |ИЗ
    |   ВТТаблицаЗарплатаИВзносы КАК ВТТаблицаЗарплатаИВзносы
	//Сухомлинов++
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.киб_СоответствиеСпособовОтраженияНачисленийИСтатейЗатрат.СрезПоследних(&ПериодРегистрации, ) КАК киб_СоответствиеСпособовОтраженияНачисленийИСтатейЗатратСрезПоследних
	|	ПО (ВЫБОР
	|			КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
	|					И ВТТаблицаЗарплатаИВзносы.киб_Начисление <> ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ПустаяСсылка)
	|				ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете = киб_СоответствиеСпособовОтраженияНачисленийИСтатейЗатратСрезПоследних.СпособОтражения
	|						И ВТТаблицаЗарплатаИВзносы.киб_Начисление = киб_СоответствиеСпособовОтраженияНачисленийИСтатейЗатратСрезПоследних.Начисление
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ)
	//Сухомлинов--		
    |ГДЕ
	|	(ВТТаблицаЗарплатаИВзносы.ВидОперации В (&МассивВидыОперацийРезервы)
	|		ИЛИ НЕ ВТТаблицаЗарплатаИВзносы.РезервОплатыТруда = ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка))
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
	//Сухомлинов++  киб_Участок
    |   ВТТаблицаЗарплатаИВзносы.киб_Участок,
	//Сухомлинов--
    |   ВТТаблицаЗарплатаИВзносы.Ссылка,
    |   ВТТаблицаЗарплатаИВзносы.НомерСтроки,
    |   ВТТаблицаЗарплатаИВзносы.Подразделение,
    |   ВТТаблицаЗарплатаИВзносы.ВидОперации,
    |   ВТТаблицаЗарплатаИВзносы.ФизическоеЛицо,
    |   ВТТаблицаЗарплатаИВзносы.СтруктурноеПодразделение,
    |   ВТТаблицаЗарплатаИВзносы.Резерв,
    |   ВТТаблицаЗарплатаИВзносы.Контрагент,
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(ПланСчетов.Налоговый.КраткосрочныеОценочныеОбязательстваПоВознаграждениямРаботникам),
    |   ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ВТТаблицаЗарплатаИВзносы.Сумма,
    |   ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПрочиеРасходы),
    |   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ВР),
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ВР),
    |   НЕОПРЕДЕЛЕНО,
    |   ВЫБОР 
	|		КОГДА ВЫРАЗИТЬ(ВТТаблицаЗарплатаИВзносы.Резерв КАК Справочник.Резервы).СтатьяЗатрат = ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка) 
	|			ТОГДА НЕОПРЕДЕЛЕНО 
	|		ИНАЧЕ ВЫРАЗИТЬ(ВТТаблицаЗарплатаИВзносы.Резерв КАК Справочник.Резервы).СтатьяЗатрат 
	|	КОНЕЦ,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО
    |ИЗ
    |   ВТТаблицаЗарплатаИВзносы КАК ВТТаблицаЗарплатаИВзносы
    |ГДЕ
    |   &ВедениеУчетаВременныхРазницБалансовымМетодом
	|	И (ВТТаблицаЗарплатаИВзносы.ВидОперации В (&МассивВидыОперацийРезервы)
	|		ИЛИ НЕ ВТТаблицаЗарплатаИВзносы.РезервОплатыТруда = ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка))
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
	//Сухомлинов++  киб_Участок
    |   ВТТаблицаЗарплатаИВзносы.киб_Участок,
	//Сухомлинов--
    |   ВТТаблицаЗарплатаИВзносы.Ссылка,
    |   ВТТаблицаЗарплатаИВзносы.НомерСтроки,
    |   ВТТаблицаЗарплатаИВзносы.Подразделение,
    |   ВТТаблицаЗарплатаИВзносы.ВидОперации,
    |   ВТТаблицаЗарплатаИВзносы.ФизическоеЛицо,
    |   ВТТаблицаЗарплатаИВзносы.СтруктурноеПодразделение,
    |   ВТТаблицаЗарплатаИВзносы.Резерв,
    |   ВТТаблицаЗарплатаИВзносы.Контрагент,
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.Налог),
    |   ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
	// Дорофеева А. 14.01.2025 Кибернетика 
	//|   ЗНАЧЕНИЕ(ПланСчетов.Типовой.КраткосрочныеОценочныеОбязательстваПоВознаграждениямРаботникам),
	//|   ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка),
	//|   ВЫБОР
	//|       КОГДА НЕ &ВедениеУчетаПоСотрудникам
	//|           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	//|       ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|   КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
	|			ТОГДА ВЫБОР
	|				КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СчетБУ <> ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка)
	|					ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СчетБУ
	|				ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы)
	|			КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
	|			ТОГДА ВЫБОР
	|				КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1 ССЫЛКА Справочник.СтатьиЗатрат
	|					ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.СоциальныйНалог)
	|				ИНАЧЕ ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1
	|			КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.СоциальныйНалог)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
	|			ТОГДА ВЫБОР
	|				КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2 ССЫЛКА Справочник.ПодразделенияОрганизаций
	|					ТОГДА ВТТаблицаЗарплатаИВзносы.Подразделение
	|				ИНАЧЕ ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2
	|			КОНЕЦ
	|		ИНАЧЕ ВТТаблицаЗарплатаИВзносы.Подразделение
	|	КОНЕЦ,
	//*****************
    |   НЕОПРЕДЕЛЕНО, 
    |   ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПрочиеРасходы),
    |   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ВТТаблицаЗарплатаИВзносы.СН,
    |   ВЫБОР
    |       КОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ <> ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка)
    |           ТОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.СоциальныйНалог)
    |   КОНЕЦ,
    |   ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.СоциальныйНалог),
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФОнды.Налог),
    |   ВЫБОР
    |       КОГДА НЕ &ВедениеУчетаПоСотрудникам
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ <> ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка)
    |               И НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяСсылка)
    |           ТОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомНУ
    |       КОГДА ВЫРАЗИТЬ(ВЫБОР
    |                   КОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ <> ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка)
    |                       ТОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ
    |                   ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.СоциальныйНалог)
    |               КОНЕЦ КАК ПланСчетов.Типовой).СчетНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяССылка)
    |           ТОГДА ВЫРАЗИТЬ(ВЫБОР
    |                       КОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ <> ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка)
    |                           ТОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ
    |                       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.СоциальныйНалог)
    |                   КОНЕЦ КАК ПланСчетов.Типовой).СчетНУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПрочиеНалоги)
    |   КОНЕЦ,
    |   ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.СоциальныйНалог),
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФОнды.Налог),
    |   ВЫБОР
    |       КОГДА НЕ &ВедениеУчетаПоСотрудникам
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка),
    |   НалогиСборыОтчисления.Ссылка,
    |   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.СоциальныйНалог),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО
    |ИЗ
    |   ВТТаблицаЗарплатаИВзносы КАК ВТТаблицаЗарплатаИВзносы
    |       ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НалогиСборыОтчисления КАК НалогиСборыОтчисления
    |       ПО (НалогиСборыОтчисления.Ссылка = ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.СоциальныйНалог))
    |ГДЕ
	|	(ВТТаблицаЗарплатаИВзносы.ВидОперации В (&МассивВидыОперацийРезервы)
	|		ИЛИ НЕ ВТТаблицаЗарплатаИВзносы.РезервОплатыТруда = ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка))
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
	//Сухомлинов++  киб_Участок
    |   ВТТаблицаЗарплатаИВзносы.киб_Участок,
	//Сухомлинов--
    |   ВТТаблицаЗарплатаИВзносы.Ссылка,
    |   ВТТаблицаЗарплатаИВзносы.НомерСтроки,
    |   ВТТаблицаЗарплатаИВзносы.Подразделение,
    |   ВТТаблицаЗарплатаИВзносы.ВидОперации,
    |   ВТТаблицаЗарплатаИВзносы.ФизическоеЛицо,
    |   ВТТаблицаЗарплатаИВзносы.СтруктурноеПодразделение,
    |   ВТТаблицаЗарплатаИВзносы.Резерв,
    |   ВТТаблицаЗарплатаИВзносы.Контрагент,
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.Налог),
    |   ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(ПланСчетов.Налоговый.КраткосрочныеОценочныеОбязательстваПоВознаграждениямРаботникам),
    |   ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ВТТаблицаЗарплатаИВзносы.СН,
    |   ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПрочиеРасходы),
    |   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ВР),
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ВР),
    |   НалогиСборыОтчисления.Ссылка,
    |   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.СоциальныйНалог),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО
    |ИЗ
    |   ВТТаблицаЗарплатаИВзносы КАК ВТТаблицаЗарплатаИВзносы
    |       ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НалогиСборыОтчисления КАК НалогиСборыОтчисления
    |       ПО (НалогиСборыОтчисления.Ссылка = ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.СоциальныйНалог))
    |ГДЕ
    |   &ВедениеУчетаВременныхРазницБалансовымМетодом
	|	И (ВТТаблицаЗарплатаИВзносы.ВидОперации В (&МассивВидыОперацийРезервы)
	|			ИЛИ НЕ ВТТаблицаЗарплатаИВзносы.РезервОплатыТруда = ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка))
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
	//Сухомлинов++  киб_Участок
    |   ВТТаблицаЗарплатаИВзносы.киб_Участок,
	//Сухомлинов--
    |   ВТТаблицаЗарплатаИВзносы.Ссылка,
    |   ВТТаблицаЗарплатаИВзносы.НомерСтроки,
    |   ВТТаблицаЗарплатаИВзносы.Подразделение,
    |   ВТТаблицаЗарплатаИВзносы.ВидОперации,
    |   ВТТаблицаЗарплатаИВзносы.ФизическоеЛицо,
    |   ВТТаблицаЗарплатаИВзносы.СтруктурноеПодразделение,
    |   ВТТаблицаЗарплатаИВзносы.Резерв,
    |   ВТТаблицаЗарплатаИВзносы.Контрагент,
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.Налог),
    |   ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
    // Дорофеева А. 14.01.2025 Кибернетика 
	//|   ЗНАЧЕНИЕ(ПланСчетов.Типовой.КраткосрочныеОценочныеОбязательстваПоВознаграждениямРаботникам),
	//|   ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка),
	//|   ВЫБОР
	//|       КОГДА НЕ &ВедениеУчетаПоСотрудникам
	//|           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	//|       ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|   КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
	|			ТОГДА ВЫБОР
	|				КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СчетБУ <> ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка)
	|					ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СчетБУ
	|				ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы)
	|			КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
	|			ТОГДА ВЫБОР
	|				КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1 ССЫЛКА Справочник.СтатьиЗатрат
	|					ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.СоциальныеОтчисления)
	|				ИНАЧЕ ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1
	|			КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.СоциальныеОтчисления)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
	|			ТОГДА ВЫБОР
	|				КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2 ССЫЛКА Справочник.ПодразделенияОрганизаций
	|					ТОГДА ВТТаблицаЗарплатаИВзносы.Подразделение
	|				ИНАЧЕ ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2
	|			КОНЕЦ
	|		ИНАЧЕ ВТТаблицаЗарплатаИВзносы.Подразделение
	|	КОНЕЦ,
	//*****************
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПрочиеРасходы),
    |   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ВТТаблицаЗарплатаИВзносы.СО,
    |   ВЫБОР
    |       КОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ <> ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка)
    |           ТОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.ОбязательстваПоСоциальномуСтрахованию)
    |   КОНЕЦ,
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФОнды.Налог),
    |   ВЫБОР
    |       КОГДА НЕ &ВедениеУчетаПоСотрудникам
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   НЕОПРЕДЕЛЕНО,
    |   ВЫБОР
    |       КОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ <> ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка)
    |               И НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяСсылка)
    |           ТОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомНУ
    |       КОГДА ВЫРАЗИТЬ(ВЫБОР
    |                   КОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ <> ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка)
    |                       ТОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ
    |                   ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.ОбязательстваПоСоциальномуСтрахованию)
    |               КОНЕЦ КАК ПланСчетов.Типовой).СчетНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяССылка)
    |           ТОГДА ВЫРАЗИТЬ(ВЫБОР
    |                       КОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ <> ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка)
    |                           ТОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ
    |                       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.ОбязательстваПоСоциальномуСтрахованию)
    |                   КОНЕЦ КАК ПланСчетов.Типовой).СчетНУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ОбязательстваПоСоциальномуСтрахованию)
    |   КОНЕЦ,
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФОнды.Налог),
    |   ВЫБОР
    |       КОГДА НЕ &ВедениеУчетаПоСотрудникам
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка),
    |   НалогиСборыОтчисления.Ссылка,
    |   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.СоциальныеОтчисления),
    |   NULL,
    |   НЕОПРЕДЕЛЕНО
    |ИЗ
    |   ВТТаблицаЗарплатаИВзносы КАК ВТТаблицаЗарплатаИВзносы
    |       ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НалогиСборыОтчисления КАК НалогиСборыОтчисления
    |       ПО (НалогиСборыОтчисления.Ссылка = ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.ОбязательныеСоциальныеОтчисления))
    |ГДЕ
	|	(ВТТаблицаЗарплатаИВзносы.ВидОперации В (&МассивВидыОперацийРезервы)
	|		ИЛИ НЕ ВТТаблицаЗарплатаИВзносы.РезервОплатыТруда = ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка))
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
	//Сухомлинов++  киб_Участок
    |   ВТТаблицаЗарплатаИВзносы.киб_Участок,
	//Сухомлинов--
    |   ВТТаблицаЗарплатаИВзносы.Ссылка,
    |   ВТТаблицаЗарплатаИВзносы.НомерСтроки,
    |   ВТТаблицаЗарплатаИВзносы.Подразделение,
    |   ВТТаблицаЗарплатаИВзносы.ВидОперации,
    |   ВТТаблицаЗарплатаИВзносы.ФизическоеЛицо,
    |   ВТТаблицаЗарплатаИВзносы.СтруктурноеПодразделение,
    |   ВТТаблицаЗарплатаИВзносы.Резерв,
    |   ВТТаблицаЗарплатаИВзносы.Контрагент,
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.Налог),
    |   ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(ПланСчетов.Налоговый.КраткосрочныеОценочныеОбязательстваПоВознаграждениямРаботникам),
    |   ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ВТТаблицаЗарплатаИВзносы.СО,
    |   ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПрочиеРасходы),
    |   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ВР),
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ВР),
    |   НалогиСборыОтчисления.Ссылка,
    |   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.СоциальныеОтчисления),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО
    |ИЗ
    |   ВТТаблицаЗарплатаИВзносы КАК ВТТаблицаЗарплатаИВзносы
    |       ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НалогиСборыОтчисления КАК НалогиСборыОтчисления
    |       ПО (НалогиСборыОтчисления.Ссылка = ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.ОбязательныеСоциальныеОтчисления))
    |ГДЕ
    |   &ВедениеУчетаВременныхРазницБалансовымМетодом
	|	И (ВТТаблицаЗарплатаИВзносы.ВидОперации В (&МассивВидыОперацийРезервы)
	|			ИЛИ НЕ ВТТаблицаЗарплатаИВзносы.РезервОплатыТруда = ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка))
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
	//Сухомлинов++  киб_Участок
    |   ВТТаблицаЗарплатаИВзносы.киб_Участок,
	//Сухомлинов--
    |   ВТТаблицаЗарплатаИВзносы.Ссылка,
    |   ВТТаблицаЗарплатаИВзносы.НомерСтроки,
    |   ВТТаблицаЗарплатаИВзносы.Подразделение,
    |   ВТТаблицаЗарплатаИВзносы.ВидОперации,
    |   ВТТаблицаЗарплатаИВзносы.ФизическоеЛицо,
    |   ВТТаблицаЗарплатаИВзносы.СтруктурноеПодразделение,
    |   ВТТаблицаЗарплатаИВзносы.Резерв,
    |   ВТТаблицаЗарплатаИВзносы.Контрагент,
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.Налог),
    |   ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
    // Дорофеева А. 14.01.2025 Кибернетика 
	//|   ЗНАЧЕНИЕ(ПланСчетов.Типовой.КраткосрочныеОценочныеОбязательстваПоВознаграждениямРаботникам),
	//|   ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка),
	//|   ВЫБОР
	//|       КОГДА НЕ &ВедениеУчетаПоСотрудникам
	//|           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	//|       ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|   КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
	|			ТОГДА ВЫБОР
	|				КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СчетБУ <> ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка)
	|					ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СчетБУ
	|				ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы)
	|			КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
	|			ТОГДА ВЫБОР
	|				КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1 ССЫЛКА Справочник.СтатьиЗатрат
	|					ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ОбязательныеПрофессиональныеПенсионныеВзносы)
	|				ИНАЧЕ ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1
	|			КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ОбязательныеПрофессиональныеПенсионныеВзносы)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
	|			ТОГДА ВЫБОР
	|				КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2 ССЫЛКА Справочник.ПодразделенияОрганизаций
	|					ТОГДА ВТТаблицаЗарплатаИВзносы.Подразделение
	|				ИНАЧЕ ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2
	|			КОНЕЦ
	|		ИНАЧЕ ВТТаблицаЗарплатаИВзносы.Подразделение
	|	КОНЕЦ,
	//*****************
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПрочиеРасходы),
    |   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ВТТаблицаЗарплатаИВзносы.ОППВ,
    |   ВЫБОР
    |       КОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ <> ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка)
    |           ТОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.ОбязательстваПоПенсионнымОтчислениям)
    |   КОНЕЦ,
    |   ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.ОбязательныеПрофессиональныеПенсионныеВзносы),
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФОнды.Налог),
    |   ВЫБОР
    |       КОГДА НЕ &ВедениеУчетаПоСотрудникам
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ <> ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка)
    |               И НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяСсылка)
    |           ТОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомНУ
    |       КОГДА ВЫРАЗИТЬ(ВЫБОР
    |                   КОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ <> ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка)
    |                       ТОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ
    |                   ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.ОбязательстваПоПенсионнымОтчислениям)
    |               КОНЕЦ КАК ПланСчетов.Типовой).СчетНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяССылка)
    |           ТОГДА ВЫРАЗИТЬ(ВЫБОР
    |                       КОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ <> ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка)
    |                           ТОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ
    |                       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.ОбязательстваПоПенсионнымОтчислениям)
    |                   КОНЕЦ КАК ПланСчетов.Типовой).СчетНУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ОбязательстваПоПенсионнымОтчислениям)
    |   КОНЕЦ,
    |   ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.ОбязательныеПрофессиональныеПенсионныеВзносы),
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФОнды.Налог),
    |   ВЫБОР
    |       КОГДА НЕ &ВедениеУчетаПоСотрудникам
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка),
    |   НалогиСборыОтчисления.Ссылка,
    |   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ОбязательныеПрофессиональныеПенсионныеВзносы),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО
    |ИЗ
    |   ВТТаблицаЗарплатаИВзносы КАК ВТТаблицаЗарплатаИВзносы
    |       ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НалогиСборыОтчисления КАК НалогиСборыОтчисления
    |       ПО (НалогиСборыОтчисления.Ссылка = ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.ОбязательныеПрофессиональныеПенсионныеВзносы))
    |ГДЕ
	|	(ВТТаблицаЗарплатаИВзносы.ВидОперации В (&МассивВидыОперацийРезервы)
	|		ИЛИ НЕ ВТТаблицаЗарплатаИВзносы.РезервОплатыТруда = ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка))
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
	//Сухомлинов++  киб_Участок
    |   ВТТаблицаЗарплатаИВзносы.киб_Участок,
	//Сухомлинов--
    |   ВТТаблицаЗарплатаИВзносы.Ссылка,
    |   ВТТаблицаЗарплатаИВзносы.НомерСтроки,
    |   ВТТаблицаЗарплатаИВзносы.Подразделение,
    |   ВТТаблицаЗарплатаИВзносы.ВидОперации,
    |   ВТТаблицаЗарплатаИВзносы.ФизическоеЛицо,
    |   ВТТаблицаЗарплатаИВзносы.СтруктурноеПодразделение,
    |   ВТТаблицаЗарплатаИВзносы.Резерв,
    |   ВТТаблицаЗарплатаИВзносы.Контрагент,
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.Налог),
    |   ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(ПланСчетов.Налоговый.КраткосрочныеОценочныеОбязательстваПоВознаграждениямРаботникам),
    |   ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ВТТаблицаЗарплатаИВзносы.ОППВ,
    |   ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПрочиеРасходы),
    |   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ВР),
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ВР),
    |   НалогиСборыОтчисления.Ссылка,
    |   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ОбязательныеПрофессиональныеПенсионныеВзносы),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО
    |ИЗ
    |   ВТТаблицаЗарплатаИВзносы КАК ВТТаблицаЗарплатаИВзносы
    |       ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НалогиСборыОтчисления КАК НалогиСборыОтчисления
    |       ПО (НалогиСборыОтчисления.Ссылка = ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.ОбязательныеПрофессиональныеПенсионныеВзносы))
    |ГДЕ
    |   &ВедениеУчетаВременныхРазницБалансовымМетодом
	|	И (ВТТаблицаЗарплатаИВзносы.ВидОперации В (&МассивВидыОперацийРезервы)
	|			ИЛИ НЕ ВТТаблицаЗарплатаИВзносы.РезервОплатыТруда = ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка))
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
	//Сухомлинов++  киб_Участок
    |   ВТТаблицаЗарплатаИВзносы.киб_Участок,
	//Сухомлинов--
    |   ВТТаблицаЗарплатаИВзносы.Ссылка,
    |   ВТТаблицаЗарплатаИВзносы.НомерСтроки,
    |   ВТТаблицаЗарплатаИВзносы.Подразделение,
    |   ВТТаблицаЗарплатаИВзносы.ВидОперации,
    |   ВТТаблицаЗарплатаИВзносы.ФизическоеЛицо,
    |   ВТТаблицаЗарплатаИВзносы.СтруктурноеПодразделение,
    |   ВТТаблицаЗарплатаИВзносы.Резерв,
    |   ВТТаблицаЗарплатаИВзносы.Контрагент,
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.Налог),
    |   ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
    // Дорофеева А. 14.01.2025 Кибернетика 
	//|   ЗНАЧЕНИЕ(ПланСчетов.Типовой.КраткосрочныеОценочныеОбязательстваПоВознаграждениямРаботникам),
	//|   ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка),
	//|   ВЫБОР
	//|       КОГДА НЕ &ВедениеУчетаПоСотрудникам
	//|           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	//|       ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|   КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
	|			ТОГДА ВЫБОР
	|				КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СчетБУ <> ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка)
	|					ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СчетБУ
	|				ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы)
	|			КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
	|			ТОГДА ВЫБОР
	|				КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1 ССЫЛКА Справочник.СтатьиЗатрат
	|					ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ОбязательныеПенсионныеВзносыРаботодателя)
	|				ИНАЧЕ ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1
	|			КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ОбязательныеПенсионныеВзносыРаботодателя)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
	|			ТОГДА ВЫБОР
	|				КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2 ССЫЛКА Справочник.ПодразделенияОрганизаций
	|					ТОГДА ВТТаблицаЗарплатаИВзносы.Подразделение
	|				ИНАЧЕ ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2
	|			КОНЕЦ
	|		ИНАЧЕ ВТТаблицаЗарплатаИВзносы.Подразделение
	|	КОНЕЦ,
	//*****************
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПрочиеРасходы),
    |   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ВТТаблицаЗарплатаИВзносы.ОПВР,
    |   ВЫБОР
    |       КОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ <> ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка)
    |           ТОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.ОбязательстваПоОбязательнымПенсионнымВзносамРаботодателя)
    |   КОНЕЦ,
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФОнды.Налог),
    |   ВЫБОР
    |       КОГДА НЕ &ВедениеУчетаПоСотрудникам
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   НЕОПРЕДЕЛЕНО,
    |   ВЫБОР
    |       КОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ <> ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка)
    |               И НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяСсылка)
    |           ТОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомНУ
    |       КОГДА ВЫРАЗИТЬ(ВЫБОР
    |                   КОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ <> ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка)
    |                       ТОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ
    |                   ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.ОбязательстваПоОбязательнымПенсионнымВзносамРаботодателя)
    |               КОНЕЦ КАК ПланСчетов.Типовой).СчетНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяССылка)
    |           ТОГДА ВЫРАЗИТЬ(ВЫБОР
    |                       КОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ <> ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка)
    |                           ТОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ
    |                       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.ОбязательстваПоОбязательнымПенсионнымВзносамРаботодателя)
    |                   КОНЕЦ КАК ПланСчетов.Типовой).СчетНУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ОбязательстваПоОбязательнымПенсионнымВзносамРаботодателя)
    |   КОНЕЦ,
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФОнды.Налог),
    |   ВЫБОР
    |       КОГДА НЕ &ВедениеУчетаПоСотрудникам
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка),
    |   НалогиСборыОтчисления.Ссылка,
    |   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ОбязательныеПенсионныеВзносыРаботодателя),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО
    |ИЗ
    |   ВТТаблицаЗарплатаИВзносы КАК ВТТаблицаЗарплатаИВзносы
    |       ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НалогиСборыОтчисления КАК НалогиСборыОтчисления
    |       ПО (НалогиСборыОтчисления.Ссылка = ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.ОбязательныеПенсионныеВзносыРаботодателя))
    |ГДЕ
	|	(ВТТаблицаЗарплатаИВзносы.ВидОперации В (&МассивВидыОперацийРезервы)
	|		ИЛИ НЕ ВТТаблицаЗарплатаИВзносы.РезервОплатыТруда = ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка))
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
	//Сухомлинов++  киб_Участок
    |   ВТТаблицаЗарплатаИВзносы.киб_Участок,
	//Сухомлинов--
    |   ВТТаблицаЗарплатаИВзносы.Ссылка,
    |   ВТТаблицаЗарплатаИВзносы.НомерСтроки,
    |   ВТТаблицаЗарплатаИВзносы.Подразделение,
    |   ВТТаблицаЗарплатаИВзносы.ВидОперации,
    |   ВТТаблицаЗарплатаИВзносы.ФизическоеЛицо,
    |   ВТТаблицаЗарплатаИВзносы.СтруктурноеПодразделение,
    |   ВТТаблицаЗарплатаИВзносы.Резерв,
    |   ВТТаблицаЗарплатаИВзносы.Контрагент,
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.Налог),
    |   ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(ПланСчетов.Налоговый.КраткосрочныеОценочныеОбязательстваПоВознаграждениямРаботникам),
    |   ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ВТТаблицаЗарплатаИВзносы.ОПВР,
    |   ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПрочиеРасходы),
    |   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ВР),
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ВР),
    |   НалогиСборыОтчисления.Ссылка,
    |   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ОбязательныеПенсионныеВзносыРаботодателя),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО
    |ИЗ
    |   ВТТаблицаЗарплатаИВзносы КАК ВТТаблицаЗарплатаИВзносы
    |       ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НалогиСборыОтчисления КАК НалогиСборыОтчисления
    |       ПО (НалогиСборыОтчисления.Ссылка = ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.ОбязательныеПенсионныеВзносыРаботодателя))
    |ГДЕ
    |   &ВедениеУчетаВременныхРазницБалансовымМетодом
	|	И (ВТТаблицаЗарплатаИВзносы.ВидОперации В (&МассивВидыОперацийРезервы)
	|		ИЛИ НЕ ВТТаблицаЗарплатаИВзносы.РезервОплатыТруда = ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка))
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
	//Сухомлинов++  киб_Участок
    |   ВТТаблицаЗарплатаИВзносы.киб_Участок,
	//Сухомлинов--
    |   ВТТаблицаЗарплатаИВзносы.Ссылка,
    |   ВТТаблицаЗарплатаИВзносы.НомерСтроки,
    |   ВТТаблицаЗарплатаИВзносы.Подразделение,
    |   ВТТаблицаЗарплатаИВзносы.ВидОперации,
    |   ВТТаблицаЗарплатаИВзносы.ФизическоеЛицо,
    |   ВТТаблицаЗарплатаИВзносы.СтруктурноеПодразделение,
    |   ВТТаблицаЗарплатаИВзносы.Резерв,
    |   ВТТаблицаЗарплатаИВзносы.Контрагент,
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.Налог),
    |   ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
    // Дорофеева А. 14.01.2025 Кибернетика 
	//|   ЗНАЧЕНИЕ(ПланСчетов.Типовой.КраткосрочныеОценочныеОбязательстваПоВознаграждениямРаботникам),
	//|   ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка),
	//|   ВЫБОР
	//|       КОГДА НЕ &ВедениеУчетаПоСотрудникам
	//|           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	//|       ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|   КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
	|			ТОГДА ВЫБОР
	|				КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СчетБУ <> ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка)
	|					ТОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СчетБУ
	|				ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы)
	|			КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
	|			ТОГДА ВЫБОР
	|				КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1 ССЫЛКА Справочник.СтатьиЗатрат
	|					ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ОтчисленияОСМС)
	|				ИНАЧЕ ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1
	|			КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ОтчисленияОСМС)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
	|			ТОГДА ВЫБОР
	|				КОГДА ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2 ССЫЛКА Справочник.ПодразделенияОрганизаций
	|					ТОГДА ВТТаблицаЗарплатаИВзносы.Подразделение
	|				ИНАЧЕ ВТТаблицаЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2
	|			КОНЕЦ
	|		ИНАЧЕ ВТТаблицаЗарплатаИВзносы.Подразделение
	|	КОНЕЦ,
	//*****************
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПрочиеРасходы),
    |   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ВТТаблицаЗарплатаИВзносы.ООСМС,
    |   ВЫБОР
    |       КОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ <> ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка)
    |           ТОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.ОбязательстваПоОтчислениямОСМС)
    |   КОНЕЦ,
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФОнды.Налог),
    |   ВЫБОР
    |       КОГДА НЕ &ВедениеУчетаПоСотрудникам
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   НЕОПРЕДЕЛЕНО,
    |   ВЫБОР
    |       КОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ <> ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка)
    |               И НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяСсылка)
    |           ТОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомНУ
    |       КОГДА ВЫРАЗИТЬ(ВЫБОР
    |                   КОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ <> ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка)
    |                       ТОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ
    |                   ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.ОбязательстваПоОтчислениямОСМС)
    |               КОНЕЦ КАК ПланСчетов.Типовой).СчетНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяССылка)
    |           ТОГДА ВЫРАЗИТЬ(ВЫБОР
    |                       КОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ <> ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка)
    |                           ТОГДА НалогиСборыОтчисления.СчетУчетаРасчетовСКонтрагентомБУ
    |                       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.ОбязательстваПоОтчислениямОСМС)
    |                   КОНЕЦ КАК ПланСчетов.Типовой).СчетНУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ОбязательстваПоОтчислениямОСМС)
    |   КОНЕЦ,
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФОнды.Налог),
    |   ВЫБОР
    |       КОГДА НЕ &ВедениеУчетаПоСотрудникам
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка),
    |   НалогиСборыОтчисления.Ссылка,
    |   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ОтчисленияОСМС),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО
    |ИЗ
    |   ВТТаблицаЗарплатаИВзносы КАК ВТТаблицаЗарплатаИВзносы
    |       ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НалогиСборыОтчисления КАК НалогиСборыОтчисления
    |       ПО (НалогиСборыОтчисления.Ссылка = ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.ОтчисленияОбязательноеСоциальноеМедицинскоеСтрахование))
    |ГДЕ
	|	(ВТТаблицаЗарплатаИВзносы.ВидОперации В (&МассивВидыОперацийРезервы)
	|		ИЛИ НЕ ВТТаблицаЗарплатаИВзносы.РезервОплатыТруда = ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка))
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
	//Сухомлинов++  киб_Участок
    |   ВТТаблицаЗарплатаИВзносы.киб_Участок,
	//Сухомлинов--
    |   ВТТаблицаЗарплатаИВзносы.Ссылка,
    |   ВТТаблицаЗарплатаИВзносы.НомерСтроки,
    |   ВТТаблицаЗарплатаИВзносы.Подразделение,
    |   ВТТаблицаЗарплатаИВзносы.ВидОперации,
    |   ВТТаблицаЗарплатаИВзносы.ФизическоеЛицо,
    |   ВТТаблицаЗарплатаИВзносы.СтруктурноеПодразделение,
    |   ВТТаблицаЗарплатаИВзносы.Резерв,
    |   ВТТаблицаЗарплатаИВзносы.Контрагент,
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.Налог),
    |   ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(ПланСчетов.Налоговый.КраткосрочныеОценочныеОбязательстваПоВознаграждениямРаботникам),
    |   ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ВТТаблицаЗарплатаИВзносы.ООСМС,
    |   ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПустаяСсылка),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПрочиеРасходы),
    |   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ВР),
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ВР),
    |   НалогиСборыОтчисления.Ссылка,
    |   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ОтчисленияОСМС),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО
    |ИЗ
    |   ВТТаблицаЗарплатаИВзносы КАК ВТТаблицаЗарплатаИВзносы
    |       ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НалогиСборыОтчисления КАК НалогиСборыОтчисления
    |       ПО (НалогиСборыОтчисления.Ссылка = ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.ОтчисленияОбязательноеСоциальноеМедицинскоеСтрахование))
    |ГДЕ
    |   &ВедениеУчетаВременныхРазницБалансовымМетодом
	|	И (ВТТаблицаЗарплатаИВзносы.ВидОперации В (&МассивВидыОперацийРезервы)
	|		ИЛИ НЕ ВТТаблицаЗарплатаИВзносы.РезервОплатыТруда = ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка))
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
	//Сухомлинов++  киб_Участок
    |   ВТТаблицаОтражениеВУчете.киб_Участок КАК киб_Участок,
	//Сухомлинов--
    |   ВТТаблицаОтражениеВУчете.Ссылка КАК Ссылка,
    |   ВТТаблицаОтражениеВУчете.НомерСтроки КАК НомерСтроки,
    |   ВТТаблицаОтражениеВУчете.Подразделение КАК Подразделение,
    |   ВТТаблицаОтражениеВУчете.ВидОперации КАК ВидОперации,
    |   ВТТаблицаОтражениеВУчете.ФизическоеЛицо КАК ФизическоеЛицо,
    |   ВТТаблицаОтражениеВУчете.СтруктурноеПодразделение КАК СтруктурноеПодразделение,
    |   ВТТаблицаОтражениеВУчете.Резерв КАК Резерв,
    |   ВТТаблицаОтражениеВУчете.Контрагент КАК Контрагент,
    |   ВТТаблицаОтражениеВУчете.ВидПлатежа КАК ВидПлатежа,
    |   ВТТаблицаОтражениеВУчете.СчетДт КАК СчетДт,
    |   ВТТаблицаОтражениеВУчете.СубконтоДт1 КАК СубконтоДт1,
    |   ВТТаблицаОтражениеВУчете.СубконтоДт2 КАК СубконтоДт2,
    |   ВТТаблицаОтражениеВУчете.СубконтоДт3 КАК СубконтоДт3,
    |   ВТТаблицаОтражениеВУчете.СчетДтНУ КАК СчетДтНУ,
    |   ВТТаблицаОтражениеВУчете.СубконтоДтНУ1 КАК СубконтоДтНУ1,
    |   ВТТаблицаОтражениеВУчете.СубконтоДтНУ2 КАК СубконтоДтНУ2,
    |   ВТТаблицаОтражениеВУчете.СубконтоДтНУ3 КАК СубконтоДтНУ3,
    |   ВТТаблицаОтражениеВУчете.Сумма КАК Сумма,
    |   ВТТаблицаОтражениеВУчете.СчетКт КАК СчетКт,
    |   ВТТаблицаОтражениеВУчете.СубконтоКт1 КАК СубконтоКт1,
    |   ВТТаблицаОтражениеВУчете.СубконтоКт2 КАК СубконтоКт2,
    |   ВТТаблицаОтражениеВУчете.СубконтоКт3 КАК СубконтоКт3,
    |   ВТТаблицаОтражениеВУчете.СчетКтНУ КАК СчетКтНУ,
    |   ВТТаблицаОтражениеВУчете.СубконтоКтНУ1 КАК СубконтоКтНУ1,
    |   ВТТаблицаОтражениеВУчете.СубконтоКтНУ2 КАК СубконтоКтНУ2,
    |   ВТТаблицаОтражениеВУчете.СубконтоКтНУ3 КАК СубконтоКтНУ3,
    |   ВТТаблицаОтражениеВУчете.ВидУчетаДт КАК ВидУчетаДт,
    |   ВТТаблицаОтражениеВУчете.ВидУчетаКт КАК ВидУчетаКт,
    |   ВТТаблицаОтражениеВУчете.ВидНалогаОтчисления КАК ВидНалогаОтчисления,
    |   ВТТаблицаОтражениеВУчете.СтатьяЗатрат КАК СтатьяЗатрат,
    |   ВТТаблицаОтражениеВУчете.ПодразделениеБУ КАК ПодразделениеБУ,
    |   ВТТаблицаОтражениеВУчете.ПодразделениеНУ КАК ПодразделениеНУ,
    |   ВТТаблицаОтражениеВУчете.КонтрагентОтправитель КАК КонтрагентОтправитель,
    |   ВТТаблицаОтражениеВУчете.РаботникОрганизации КАК РаботникОрганизации
    |ПОМЕСТИТЬ ТаблицаОтражениеВУчете
    |ИЗ
    |   ВТТаблицаОтражениеВУчете КАК ВТТаблицаОтражениеВУчете
    |ГДЕ
    |   ВТТаблицаОтражениеВУчете.Сумма <> 0
    |
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
	//Сухомлинов++  киб_Участок
    |   ТаблицаОтражениеВУчете.киб_Участок КАК киб_Участок,
	//Сухомлинов--
    |   ТаблицаОтражениеВУчете.Ссылка КАК Ссылка,
    |   ТаблицаОтражениеВУчете.НомерСтроки КАК НомерСтроки,
    |   ТаблицаОтражениеВУчете.Подразделение КАК Подразделение,
    |   ТаблицаОтражениеВУчете.ВидОперации КАК ВидОперации,
    |   ТаблицаОтражениеВУчете.ФизическоеЛицо КАК ФизическоеЛицо,
    |   ВЫБОР
    |       КОГДА &ПоддержкаРаботыСоСтруктурнымиПодразделениями
    |               И ТаблицаОтражениеВУчете.СтруктурноеПодразделение.ЯвляетсяСтруктурнымПодразделением
    |           ТОГДА ТаблицаОтражениеВУчете.СтруктурноеПодразделение
    |       ИНАЧЕ &ПустоеПодразделение
    |   КОНЕЦ КАК СтруктурноеПодразделение,
    |   ТаблицаОтражениеВУчете.Резерв КАК Резерв,
    |   ТаблицаОтражениеВУчете.Контрагент КАК Контрагент,
    |   ТаблицаОтражениеВУчете.ВидПлатежа КАК ВидПлатежа,
    |   ТаблицаОтражениеВУчете.СчетДт КАК СчетДт,
    |   ТаблицаОтражениеВУчете.СубконтоДт1 КАК СубконтоДт1,
    |   ТаблицаОтражениеВУчете.СубконтоДт2 КАК СубконтоДт2,
    |   ТаблицаОтражениеВУчете.СубконтоДт3 КАК СубконтоДт3,
    |   ТаблицаОтражениеВУчете.СчетДтНУ КАК СчетДтНУ,
    |   ТаблицаОтражениеВУчете.СубконтоДтНУ1 КАК СубконтоДтНУ1,
    |   ТаблицаОтражениеВУчете.СубконтоДтНУ2 КАК СубконтоДтНУ2,
    |   ТаблицаОтражениеВУчете.СубконтоДтНУ3 КАК СубконтоДтНУ3,
    |   ТаблицаОтражениеВУчете.Сумма КАК Сумма,
    |   ТаблицаОтражениеВУчете.СчетКт КАК СчетКт,
    |   ТаблицаОтражениеВУчете.СубконтоКт1 КАК СубконтоКт1,
    |   ТаблицаОтражениеВУчете.СубконтоКт2 КАК СубконтоКт2,
    |   ТаблицаОтражениеВУчете.СубконтоКт3 КАК СубконтоКт3,
    |   ТаблицаОтражениеВУчете.СчетКтНУ КАК СчетКтНУ,
    |   ТаблицаОтражениеВУчете.СубконтоКтНУ1 КАК СубконтоКтНУ1,
    |   ТаблицаОтражениеВУчете.СубконтоКтНУ2 КАК СубконтоКтНУ2,
    |   ТаблицаОтражениеВУчете.СубконтоКтНУ3 КАК СубконтоКтНУ3,
    |   ТаблицаОтражениеВУчете.ВидУчетаДт КАК ВидУчетаДт,
    |   ТаблицаОтражениеВУчете.ВидУчетаКт КАК ВидУчетаКт,
    |   ТаблицаОтражениеВУчете.ВидНалогаОтчисления КАК ВидНалогаОтчисления,
    |   ТаблицаОтражениеВУчете.СтатьяЗатрат КАК СтатьяЗатрат,
    |   ТаблицаОтражениеВУчете.ПодразделениеБУ КАК ПодразделениеБУ,
    |   ТаблицаОтражениеВУчете.ПодразделениеНУ КАК ПодразделениеНУ,
    |   ТаблицаОтражениеВУчете.КонтрагентОтправитель КАК КонтрагентОтправитель,
    |   ТаблицаОтражениеВУчете.РаботникОрганизации КАК РаботникОрганизации
    |ПОМЕСТИТЬ ИтогТаблицаОтраженияВУчете
    |ИЗ
    |   ТаблицаОтражениеВУчете КАК ТаблицаОтражениеВУчете" + ОбщегоНазначенияБКВызовСервера.ТекстРазделителяЗапросовПакета();
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВременныеТаблицыДокументаОтражениеОценочныхОбязательств()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
    |   ДокументыКОтражению.Ссылка КАК Ссылка,
    |   ДокументыКОтражению.Организация КАК Организация,
    |   ОценочныеОбязательства.НомерСтроки КАК НомерСтроки,
    |   ОценочныеОбязательства.Подразделение КАК Подразделение,
    |   ОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете КАК СпособОтраженияЗарплатыВБухучете,
    |   ОценочныеОбязательства.ФизическоеЛицо КАК ФизическоеЛицо,
    |   СУММА(ОценочныеОбязательства.СуммаРезерва) КАК Сумма,
    |   СУММА(ОценочныеОбязательства.СуммаРезерваСН) КАК СН,
    |   СУММА(ОценочныеОбязательства.СуммаРезерваСО) КАК СО,
    |   СУММА(ОценочныеОбязательства.СуммаРезерваОППВ) КАК ОППВ,
    |   СУММА(ОценочныеОбязательства.СуммаРезерваОПВР) КАК ОПВР,
    |   СУММА(ОценочныеОбязательства.СуммаРезерваОтчисленияОСМС) КАК ООСМС,
    |   ДокументыКОтражению.Резерв КАК Резерв,
    |   ОценочныеОбязательства.СтруктурноеПодразделение КАК СтруктурноеПодразделение
    |ПОМЕСТИТЬ ВТТаблицаОценочныеОбязательства
    |ИЗ
    |   Документ.ОтражениеЗарплатыВБухучете.ОценочныеОбязательства КАК ОценочныеОбязательства
    |       ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКОтражению КАК ДокументыКОтражению
    |       ПО ОценочныеОбязательства.Ссылка = ДокументыКОтражению.Ссылка
    |ГДЕ
    |   ДокументыКОтражению.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОтражениеЗарплатыВБухучете.ОтражениеОценочныхОбязательств)
    |
    |СГРУППИРОВАТЬ ПО
    |   ОценочныеОбязательства.Подразделение,
    |   ОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете,
    |   ДокументыКОтражению.Ссылка,
    |   ДокументыКОтражению.Организация,
    |   ОценочныеОбязательства.НомерСтроки,
    |   ОценочныеОбязательства.ФизическоеЛицо,
    |   ДокументыКОтражению.Резерв,
    |   ОценочныеОбязательства.СтруктурноеПодразделение
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |   ВТТаблицаОценочныеОбязательства.Ссылка КАК Ссылка,
    |   ВТТаблицаОценочныеОбязательства.НомерСтроки КАК НомерСтроки,
    |   ВТТаблицаОценочныеОбязательства.Подразделение КАК Подразделение,
    |   ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПустаяСсылка) КАК ВидОперации,
    |   ВТТаблицаОценочныеОбязательства.ФизическоеЛицо КАК ФизическоеЛицо,
    |   ВТТаблицаОценочныеОбязательства.СтруктурноеПодразделение КАК СтруктурноеПодразделение,
    |   ВТТаблицаОценочныеОбязательства.Резерв КАК Резерв,
    |   ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Контрагент,
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.ПустаяСсылка) КАК ВидПлатежа,
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |           ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1
    |       ИНАЧЕ ВТТаблицаОценочныеОбязательства.Подразделение
    |   КОНЕЦ КАК ПодразделениеБУ,
    |   ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК ПодразделениеНУ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы)
    |   КОНЕЦ КАК СчетДт,
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка)
    |   КОНЕЦ КАК СубконтоДт1,
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
    |   КОНЕЦ КАК СубконтоДт2,
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ КАК СубконтоДт3,
    |   НЕОПРЕДЕЛЕНО КАК СчетДтНУ,
    |   НЕОПРЕДЕЛЕНО КАК СубконтоДтНУ1,
    |   НЕОПРЕДЕЛЕНО КАК СубконтоДтНУ2,
    |   НЕОПРЕДЕЛЕНО КАК СубконтоДтНУ3,
    |   ВТТаблицаОценочныеОбязательства.Сумма КАК Сумма,
    |   ЗНАЧЕНИЕ(ПланСчетов.Типовой.КраткосрочныеОценочныеОбязательстваПоВознаграждениямРаботникам) КАК СчетКт,
    |   ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка) КАК СубконтоКт1,
    |   ВЫБОР
    |       КОГДА НЕ &ВедениеУчетаПоСотрудникам
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ КАК СубконтоКт2,
    |   НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
    |   НЕОПРЕДЕЛЕНО КАК СчетКтНУ,
    |   НЕОПРЕДЕЛЕНО КАК СубконтоКтНУ1,
    |   НЕОПРЕДЕЛЕНО КАК СубконтоКтНУ2,
    |   НЕОПРЕДЕЛЕНО КАК СубконтоКтНУ3,
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка) КАК ВидУчетаДт,
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка) КАК ВидУчетаКт,
    |   НЕОПРЕДЕЛЕНО КАК ВидНалогаОтчисления,
    |   ВЫБОР 
	|		КОГДА ВЫРАЗИТЬ(ВТТаблицаОценочныеОбязательства.Резерв КАК Справочник.Резервы).СтатьяЗатрат = ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка) 
	|			ТОГДА НЕОПРЕДЕЛЕНО 
	|		ИНАЧЕ ВЫРАЗИТЬ(ВТТаблицаОценочныеОбязательства.Резерв КАК Справочник.Резервы).СтатьяЗатрат 
	|	КОНЕЦ КАК СтатьяЗатрат
    |ПОМЕСТИТЬ ВТОтражениеОценочныеОбязательства
    |ИЗ
    |   ВТТаблицаОценочныеОбязательства КАК ВТТаблицаОценочныеОбязательства
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |   ВТТаблицаОценочныеОбязательства.Ссылка,
    |   ВТТаблицаОценочныеОбязательства.НомерСтроки,
    |   ВТТаблицаОценочныеОбязательства.Подразделение,
    |   ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПустаяСсылка),
    |   ВТТаблицаОценочныеОбязательства.ФизическоеЛицо,
    |   ВТТаблицаОценочныеОбязательства.СтруктурноеПодразделение,
    |   ВТТаблицаОценочныеОбязательства.Резерв,
    |   ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.ПустаяСсылка),
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |           ТОГДА ВЫБОР
    |                   КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1
    |                   КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2
    |                   КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3
    |                   ИНАЧЕ ВТТаблицаОценочныеОбязательства.Подразделение
    |               КОНЕЦ
    |       ИНАЧЕ ВТТаблицаОценочныеОбязательства.Подразделение
    |   КОНЕЦ,
    |   ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ВТТаблицаОценочныеОбязательства.СО,
    |   ЗНАЧЕНИЕ(ПланСчетов.Типовой.КраткосрочныеОценочныеОбязательстваПоВознаграждениямРаботникам),
    |   ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка),
    |   ВЫБОР
    |       КОГДА НЕ &ВедениеУчетаПоСотрудникам
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка),
    |   НалогиСборыОтчисления.Ссылка,
    |   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.СоциальныеОтчисления)
    |ИЗ
    |   ВТТаблицаОценочныеОбязательства КАК ВТТаблицаОценочныеОбязательства
    |       ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НалогиСборыОтчисления КАК НалогиСборыОтчисления
    |       ПО (НалогиСборыОтчисления.Ссылка = ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.ОбязательныеСоциальныеОтчисления))
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |   ВТТаблицаОценочныеОбязательства.Ссылка,
    |   ВТТаблицаОценочныеОбязательства.НомерСтроки,
    |   ВТТаблицаОценочныеОбязательства.Подразделение,
    |   ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПустаяСсылка),
    |   ВТТаблицаОценочныеОбязательства.ФизическоеЛицо,
    |   ВТТаблицаОценочныеОбязательства.СтруктурноеПодразделение,
    |   ВТТаблицаОценочныеОбязательства.Резерв,
    |   ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.ПустаяСсылка),
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |           ТОГДА ВЫБОР
    |                   КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1
    |                   КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2
    |                   КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3
    |                   ИНАЧЕ ВТТаблицаОценочныеОбязательства.Подразделение
    |               КОНЕЦ
    |       ИНАЧЕ ВТТаблицаОценочныеОбязательства.Подразделение
    |   КОНЕЦ,
    |   ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ВТТаблицаОценочныеОбязательства.СН,
    |   ЗНАЧЕНИЕ(ПланСчетов.Типовой.КраткосрочныеОценочныеОбязательстваПоВознаграждениямРаботникам),
    |   ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка),
    |   ВЫБОР
    |       КОГДА НЕ &ВедениеУчетаПоСотрудникам
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка),
    |   НалогиСборыОтчисления.Ссылка,
    |   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.СоциальныйНалог)
    |ИЗ
    |   ВТТаблицаОценочныеОбязательства КАК ВТТаблицаОценочныеОбязательства
    |       ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НалогиСборыОтчисления КАК НалогиСборыОтчисления
    |       ПО (НалогиСборыОтчисления.Ссылка = ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.СоциальныйНалог))
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |   ВТТаблицаОценочныеОбязательства.Ссылка,
    |   ВТТаблицаОценочныеОбязательства.НомерСтроки,
    |   ВТТаблицаОценочныеОбязательства.Подразделение,
    |   ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПустаяСсылка),
    |   ВТТаблицаОценочныеОбязательства.ФизическоеЛицо,
    |   ВТТаблицаОценочныеОбязательства.СтруктурноеПодразделение,
    |   ВТТаблицаОценочныеОбязательства.Резерв,
    |   ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.ПустаяСсылка),
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |           ТОГДА ВЫБОР
    |                   КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1
    |                   КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2
    |                   КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3
    |                   ИНАЧЕ ВТТаблицаОценочныеОбязательства.Подразделение
    |               КОНЕЦ
    |       ИНАЧЕ ВТТаблицаОценочныеОбязательства.Подразделение
    |   КОНЕЦ,
    |   ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ВТТаблицаОценочныеОбязательства.ОППВ,
    |   ЗНАЧЕНИЕ(ПланСчетов.Типовой.КраткосрочныеОценочныеОбязательстваПоВознаграждениямРаботникам),
    |   ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка),
    |   ВЫБОР
    |       КОГДА НЕ &ВедениеУчетаПоСотрудникам
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка),
    |   НалогиСборыОтчисления.Ссылка,
    |   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ОбязательныеПрофессиональныеПенсионныеВзносы)
    |ИЗ
    |   ВТТаблицаОценочныеОбязательства КАК ВТТаблицаОценочныеОбязательства
    |       ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НалогиСборыОтчисления КАК НалогиСборыОтчисления
    |       ПО (НалогиСборыОтчисления.Ссылка = ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.ОбязательныеПрофессиональныеПенсионныеВзносы))
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |   ВТТаблицаОценочныеОбязательства.Ссылка,
    |   ВТТаблицаОценочныеОбязательства.НомерСтроки,
    |   ВТТаблицаОценочныеОбязательства.Подразделение,
    |   ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПустаяСсылка),
    |   ВТТаблицаОценочныеОбязательства.ФизическоеЛицо,
    |   ВТТаблицаОценочныеОбязательства.СтруктурноеПодразделение,
    |   ВТТаблицаОценочныеОбязательства.Резерв,
    |   ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.ПустаяСсылка),
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |           ТОГДА ВЫБОР
    |                   КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1
    |                   КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2
    |                   КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3
    |                   ИНАЧЕ ВТТаблицаОценочныеОбязательства.Подразделение
    |               КОНЕЦ
    |       ИНАЧЕ ВТТаблицаОценочныеОбязательства.Подразделение
    |   КОНЕЦ,
    |   ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ВТТаблицаОценочныеОбязательства.ОПВР,
    |   ЗНАЧЕНИЕ(ПланСчетов.Типовой.КраткосрочныеОценочныеОбязательстваПоВознаграждениямРаботникам),
    |   ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка),
    |   ВЫБОР
    |       КОГДА НЕ &ВедениеУчетаПоСотрудникам
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка),
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ОбязательныеПенсионныеВзносыРаботодателя)
    |ИЗ
    |   ВТТаблицаОценочныеОбязательства КАК ВТТаблицаОценочныеОбязательства
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |   ВТТаблицаОценочныеОбязательства.Ссылка,
    |   ВТТаблицаОценочныеОбязательства.НомерСтроки,
    |   ВТТаблицаОценочныеОбязательства.Подразделение,
    |   ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПустаяСсылка),
    |   ВТТаблицаОценочныеОбязательства.ФизическоеЛицо,
    |   ВТТаблицаОценочныеОбязательства.СтруктурноеПодразделение,
    |   ВТТаблицаОценочныеОбязательства.Резерв,
    |   ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.ПустаяСсылка),
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |           ТОГДА ВЫБОР
    |                   КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1
    |                   КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2
    |                   КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3
    |                   ИНАЧЕ ВТТаблицаОценочныеОбязательства.Подразделение
    |               КОНЕЦ
    |       ИНАЧЕ ВТТаблицаОценочныеОбязательства.Подразделение
    |   КОНЕЦ,
    |   ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ВТТаблицаОценочныеОбязательства.ООСМС,
    |   ЗНАЧЕНИЕ(ПланСчетов.Типовой.КраткосрочныеОценочныеОбязательстваПоВознаграждениямРаботникам),
    |   ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка),
    |   ВЫБОР
    |       КОГДА НЕ &ВедениеУчетаПоСотрудникам
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка),
    |   НалогиСборыОтчисления.Ссылка,
    |   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ОтчисленияОСМС)
    |ИЗ
    |   ВТТаблицаОценочныеОбязательства КАК ВТТаблицаОценочныеОбязательства
    |       ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НалогиСборыОтчисления КАК НалогиСборыОтчисления
    |       ПО (НалогиСборыОтчисления.Ссылка = ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.ОтчисленияОбязательноеСоциальноеМедицинскоеСтрахование))
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |   ВТТаблицаОценочныеОбязательства.Ссылка КАК Ссылка,
    |   ВТТаблицаОценочныеОбязательства.НомерСтроки КАК НомерСтроки,
    |   ВТТаблицаОценочныеОбязательства.Подразделение КАК Подразделение,
    |   ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПустаяСсылка) КАК ВидОперации,
    |   ВТТаблицаОценочныеОбязательства.ФизическоеЛицо КАК ФизическоеЛицо,
    |   ВТТаблицаОценочныеОбязательства.СтруктурноеПодразделение КАК СтруктурноеПодразделение,
    |   ВТТаблицаОценочныеОбязательства.Резерв КАК Резерв,
    |   ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Контрагент,
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.ПустаяСсылка) КАК ВидПлатежа,
    |   ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК ПодразделениеБУ,
    |   ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК ПодразделениеНУ,
    |   НЕОПРЕДЕЛЕНО КАК СчетДт,
    |   НЕОПРЕДЕЛЕНО КАК СубконтоДт1,
    |   НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
    |   НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
    |   ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПрочиеРасходы) КАК СчетДтНУ,
    |   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка) КАК СубконтоДтНУ1,
    |   НЕОПРЕДЕЛЕНО КАК СубконтоДтНУ2,
    |   НЕОПРЕДЕЛЕНО КАК СубконтоДтНУ3,
    |   ВТТаблицаОценочныеОбязательства.Сумма КАК Сумма,
    |   НЕОПРЕДЕЛЕНО КАК СчетКт,
    |   НЕОПРЕДЕЛЕНО КАК СубконтоКт1,
    |   НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
    |   НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
    |   ЗНАЧЕНИЕ(ПланСчетов.Налоговый.КраткосрочныеОценочныеОбязательстваПоВознаграждениямРаботникам) КАК СчетКтНУ,
    |   ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка) КАК СубконтоКтНУ1,
    |   НЕОПРЕДЕЛЕНО КАК СубконтоКтНУ2,
    |   НЕОПРЕДЕЛЕНО КАК СубконтоКтНУ3,
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ВР) КАК ВидУчетаДт,
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ВР) КАК ВидУчетаКт,
    |   НЕОПРЕДЕЛЕНО КАК ВидНалогаОтчисления,
    |   ВЫБОР 
	|		КОГДА ВЫРАЗИТЬ(ВТТаблицаОценочныеОбязательства.Резерв КАК Справочник.Резервы).СтатьяЗатрат = ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка) 
	|			ТОГДА НЕОПРЕДЕЛЕНО 
	|		ИНАЧЕ ВЫРАЗИТЬ(ВТТаблицаОценочныеОбязательства.Резерв КАК Справочник.Резервы).СтатьяЗатрат 
	|	КОНЕЦ КАК СтатьяЗатрат
    |ПОМЕСТИТЬ ВТОтражениеВременнаяРазница
    |ИЗ
    |   ВТТаблицаОценочныеОбязательства КАК ВТТаблицаОценочныеОбязательства
    |ГДЕ
    |   &ВедениеУчетаВременныхРазницБалансовымМетодом
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |   ВТТаблицаОценочныеОбязательства.Ссылка,
    |   ВТТаблицаОценочныеОбязательства.НомерСтроки,
    |   ВТТаблицаОценочныеОбязательства.Подразделение,
    |   ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПустаяСсылка),
    |   ВТТаблицаОценочныеОбязательства.ФизическоеЛицо,
    |   ВТТаблицаОценочныеОбязательства.СтруктурноеПодразделение,
    |   ВТТаблицаОценочныеОбязательства.Резерв,
    |   ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПрочиеРасходы),
    |   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.СоциальныеОтчисления),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ВТТаблицаОценочныеОбязательства.СО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(ПланСчетов.Налоговый.КраткосрочныеОценочныеОбязательстваПоВознаграждениямРаботникам),
    |   ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ВР),
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ВР),
    |   НалогиСборыОтчисления.Ссылка,
    |   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.СоциальныеОтчисления)
    |ИЗ
    |   ВТТаблицаОценочныеОбязательства КАК ВТТаблицаОценочныеОбязательства
    |       ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НалогиСборыОтчисления КАК НалогиСборыОтчисления
    |       ПО (НалогиСборыОтчисления.Ссылка = ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.ОбязательныеСоциальныеОтчисления))
    |ГДЕ
    |   &ВедениеУчетаВременныхРазницБалансовымМетодом
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |   ВТТаблицаОценочныеОбязательства.Ссылка,
    |   ВТТаблицаОценочныеОбязательства.НомерСтроки,
    |   ВТТаблицаОценочныеОбязательства.Подразделение,
    |   ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПустаяСсылка),
    |   ВТТаблицаОценочныеОбязательства.ФизическоеЛицо,
    |   ВТТаблицаОценочныеОбязательства.СтруктурноеПодразделение,
    |   ВТТаблицаОценочныеОбязательства.Резерв,
    |   ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПрочиеРасходы),
    |   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.СоциальныйНалог),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ВТТаблицаОценочныеОбязательства.СН,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(ПланСчетов.Налоговый.КраткосрочныеОценочныеОбязательстваПоВознаграждениямРаботникам),
    |   ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ВР),
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ВР),
    |   НалогиСборыОтчисления.Ссылка,
    |   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.СоциальныйНалог)
    |ИЗ
    |   ВТТаблицаОценочныеОбязательства КАК ВТТаблицаОценочныеОбязательства
    |       ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НалогиСборыОтчисления КАК НалогиСборыОтчисления
    |       ПО (НалогиСборыОтчисления.Ссылка = ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.СоциальныйНалог))
    |ГДЕ
    |   &ВедениеУчетаВременныхРазницБалансовымМетодом
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |   ВТТаблицаОценочныеОбязательства.Ссылка,
    |   ВТТаблицаОценочныеОбязательства.НомерСтроки,
    |   ВТТаблицаОценочныеОбязательства.Подразделение,
    |   ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПустаяСсылка),
    |   ВТТаблицаОценочныеОбязательства.ФизическоеЛицо,
    |   ВТТаблицаОценочныеОбязательства.СтруктурноеПодразделение,
    |   ВТТаблицаОценочныеОбязательства.Резерв,
    |   ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПрочиеРасходы),
    |   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ОбязательныеПрофессиональныеПенсионныеВзносы),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ВТТаблицаОценочныеОбязательства.ОППВ,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(ПланСчетов.Налоговый.КраткосрочныеОценочныеОбязательстваПоВознаграждениямРаботникам),
    |   ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ВР),
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ВР),
    |   НалогиСборыОтчисления.Ссылка,
    |   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ОбязательныеПрофессиональныеПенсионныеВзносы)
    |ИЗ
    |   ВТТаблицаОценочныеОбязательства КАК ВТТаблицаОценочныеОбязательства
    |       ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НалогиСборыОтчисления КАК НалогиСборыОтчисления
    |       ПО (НалогиСборыОтчисления.Ссылка = ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.ОбязательныеПрофессиональныеПенсионныеВзносы))
    |ГДЕ
    |   &ВедениеУчетаВременныхРазницБалансовымМетодом
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |   ВТТаблицаОценочныеОбязательства.Ссылка,
    |   ВТТаблицаОценочныеОбязательства.НомерСтроки,
    |   ВТТаблицаОценочныеОбязательства.Подразделение,
    |   ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПустаяСсылка),
    |   ВТТаблицаОценочныеОбязательства.ФизическоеЛицо,
    |   ВТТаблицаОценочныеОбязательства.СтруктурноеПодразделение,
    |   ВТТаблицаОценочныеОбязательства.Резерв,
    |   ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПрочиеРасходы),
    |   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ОбязательныеПенсионныеВзносыРаботодателя),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ВТТаблицаОценочныеОбязательства.ОПВР,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(ПланСчетов.Налоговый.КраткосрочныеОценочныеОбязательстваПоВознаграждениямРаботникам),
    |   ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ВР),
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ВР),
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ОбязательныеПенсионныеВзносыРаботодателя)
    |ИЗ
    |   ВТТаблицаОценочныеОбязательства КАК ВТТаблицаОценочныеОбязательства
    |ГДЕ
    |   &ВедениеУчетаВременныхРазницБалансовымМетодом
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |   ВТТаблицаОценочныеОбязательства.Ссылка,
    |   ВТТаблицаОценочныеОбязательства.НомерСтроки,
    |   ВТТаблицаОценочныеОбязательства.Подразделение,
    |   ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПустаяСсылка),
    |   ВТТаблицаОценочныеОбязательства.ФизическоеЛицо,
    |   ВТТаблицаОценочныеОбязательства.СтруктурноеПодразделение,
    |   ВТТаблицаОценочныеОбязательства.Резерв,
    |   ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПрочиеРасходы),
    |   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ОтчисленияОСМС),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ВТТаблицаОценочныеОбязательства.ООСМС,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ВЫБОР
    |       КОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.КраткосрочныеОценочныеОбязательстваПоВознаграждениямРаботникам) КАК ПланСчетов.Типовой).СчетНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяСсылка)
    |           ТОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.КраткосрочныеОценочныеОбязательстваПоВознаграждениямРаботникам) КАК ПланСчетов.Типовой).СчетНУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Налоговый.КраткосрочныеОценочныеОбязательстваПоВознаграждениямРаботникам)
    |   КОНЕЦ,
    |   ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ВР),
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ВР),
    |   НалогиСборыОтчисления.Ссылка,
    |   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ОтчисленияОСМС)
    |ИЗ
    |   ВТТаблицаОценочныеОбязательства КАК ВТТаблицаОценочныеОбязательства
    |       ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НалогиСборыОтчисления КАК НалогиСборыОтчисления
    |       ПО (НалогиСборыОтчисления.Ссылка = ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.ОтчисленияОбязательноеСоциальноеМедицинскоеСтрахование))
    |ГДЕ
    |   &ВедениеУчетаВременныхРазницБалансовымМетодом
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |   ВТТаблицаОценочныеОбязательства.Ссылка КАК Ссылка,
    |   ВТТаблицаОценочныеОбязательства.НомерСтроки КАК НомерСтроки,
    |   ВТТаблицаОценочныеОбязательства.Подразделение КАК Подразделение,
    |   ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПустаяСсылка) КАК ВидОперации,
    |   ВТТаблицаОценочныеОбязательства.ФизическоеЛицо КАК ФизическоеЛицо,
    |   ВТТаблицаОценочныеОбязательства.СтруктурноеПодразделение КАК СтруктурноеПодразделение,
    |   ВТТаблицаОценочныеОбязательства.Резерв КАК Резерв,
    |   ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Контрагент,
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.ПустаяСсылка) КАК ВидПлатежа,
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |           ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1
    |       ИНАЧЕ ВТТаблицаОценочныеОбязательства.Подразделение
    |   КОНЕЦ КАК ПодразделениеБУ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |           ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоНУ1
    |       ИНАЧЕ ВТТаблицаОценочныеОбязательства.Подразделение
    |   КОНЕЦ КАК ПодразделениеНУ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы)
    |   КОНЕЦ КАК СчетДт,
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка)
    |   КОНЕЦ КАК СубконтоДт1,
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
    |   КОНЕЦ КАК СубконтоДт2,
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ КАК СубконтоДт3,
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетНУ
    |       КОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы) КАК ПланСчетов.Типовой).СчетНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяСсылка)
    |           ТОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы) КАК ПланСчетов.Типовой).СчетНУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ОбщиеИАдминистративныеРасходы)
    |   КОНЕЦ КАК СчетДтНУ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоНУ1
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка)
    |   КОНЕЦ КАК СубконтоДтНУ1,
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоНУ2
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
    |   КОНЕЦ КАК СубконтоДтНУ2,
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоНУ3
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ КАК СубконтоДтНУ3,
    |   ВТТаблицаОценочныеОбязательства.Сумма КАК Сумма,
    |   ЗНАЧЕНИЕ(ПланСчетов.Типовой.КраткосрочныеОценочныеОбязательстваПоВознаграждениямРаботникам) КАК СчетКт,
    |   ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка) КАК СубконтоКт1,
    |   ВЫБОР
    |       КОГДА НЕ &ВедениеУчетаПоСотрудникам
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ КАК СубконтоКт2,
    |   НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
    |   ВЫБОР
    |       КОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПрочиеРасходы) КАК ПланСчетов.Типовой).СчетНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяСсылка)
    |           ТОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПрочиеРасходы) КАК ПланСчетов.Типовой).СчетНУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПрочиеРасходы)
    |   КОНЕЦ КАК СчетКтНУ,
    |   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка) КАК СубконтоКтНУ1,
    |   НЕОПРЕДЕЛЕНО КАК СубконтоКтНУ2,
    |   НЕОПРЕДЕЛЕНО КАК СубконтоКтНУ3,
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка) КАК ВидУчетаДт,
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка) КАК ВидУчетаКт,
    |   НЕОПРЕДЕЛЕНО КАК ВидНалогаОтчисления,
    |   ВЫБОР 
	|		КОГДА ВЫРАЗИТЬ(ВТТаблицаОценочныеОбязательства.Резерв КАК Справочник.Резервы).СтатьяЗатрат = ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка) 
	|			ТОГДА НЕОПРЕДЕЛЕНО 
	|		ИНАЧЕ ВЫРАЗИТЬ(ВТТаблицаОценочныеОбязательства.Резерв КАК Справочник.Резервы).СтатьяЗатрат 
	|	КОНЕЦ КАК СтатьяЗатрат
    |ПОМЕСТИТЬ ВТТаблицаОтражениеРезервовПоПроизводственнымСчетам
    |ИЗ
    |   ВТТаблицаОценочныеОбязательства КАК ВТТаблицаОценочныеОбязательства
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |   ВТТаблицаОценочныеОбязательства.Ссылка,
    |   ВТТаблицаОценочныеОбязательства.НомерСтроки,
    |   ВТТаблицаОценочныеОбязательства.Подразделение,
    |   ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПустаяСсылка),
    |   ВТТаблицаОценочныеОбязательства.ФизическоеЛицо,
    |   ВТТаблицаОценочныеОбязательства.СтруктурноеПодразделение,
    |   ВТТаблицаОценочныеОбязательства.Резерв,
    |   ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.ПустаяСсылка),
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |           ТОГДА ВЫБОР
    |                   КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1
    |                   КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2
    |                   КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3
    |                   ИНАЧЕ ВТТаблицаОценочныеОбязательства.Подразделение
    |               КОНЕЦ
    |       ИНАЧЕ ВТТаблицаОценочныеОбязательства.Подразделение
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |           ТОГДА ВЫБОР
    |                   КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоНУ1 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоНУ1
    |                   КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоНУ2 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоНУ2
    |                   КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоНУ3 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоНУ3
    |                   ИНАЧЕ ВТТаблицаОценочныеОбязательства.Подразделение
    |               КОНЕЦ
    |       ИНАЧЕ ВТТаблицаОценочныеОбязательства.Подразделение
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетНУ
    |       КОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы) КАК ПланСчетов.Типовой).СчетНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяСсылка)
    |           ТОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы) КАК ПланСчетов.Типовой).СчетНУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ОбщиеИАдминистративныеРасходы)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоНУ1
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоНУ2
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоНУ3
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   ВТТаблицаОценочныеОбязательства.СО,
    |   ЗНАЧЕНИЕ(ПланСчетов.Типовой.КраткосрочныеОценочныеОбязательстваПоВознаграждениямРаботникам),
    |   ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка),
    |   ВЫБОР
    |       КОГДА НЕ &ВедениеУчетаПоСотрудникам
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   НЕОПРЕДЕЛЕНО,
    |   ВЫБОР
    |       КОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПрочиеРасходы) КАК ПланСчетов.Типовой).СчетНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяСсылка)
    |           ТОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПрочиеРасходы) КАК ПланСчетов.Типовой).СчетНУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПрочиеРасходы)
    |   КОНЕЦ,
    |   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.СоциальныеОтчисления),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка),
    |   НалогиСборыОтчисления.Ссылка,
    |   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.СоциальныеОтчисления)
    |ИЗ
    |   ВТТаблицаОценочныеОбязательства КАК ВТТаблицаОценочныеОбязательства
    |       ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НалогиСборыОтчисления КАК НалогиСборыОтчисления
    |       ПО (НалогиСборыОтчисления.Ссылка = ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.ОбязательныеСоциальныеОтчисления))
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |   ВТТаблицаОценочныеОбязательства.Ссылка,
    |   ВТТаблицаОценочныеОбязательства.НомерСтроки,
    |   ВТТаблицаОценочныеОбязательства.Подразделение,
    |   ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПустаяСсылка),
    |   ВТТаблицаОценочныеОбязательства.ФизическоеЛицо,
    |   ВТТаблицаОценочныеОбязательства.СтруктурноеПодразделение,
    |   ВТТаблицаОценочныеОбязательства.Резерв,
    |   ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.ПустаяСсылка),
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |           ТОГДА ВЫБОР
    |                   КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1
    |                   КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2
    |                   КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3
    |                   ИНАЧЕ ВТТаблицаОценочныеОбязательства.Подразделение
    |               КОНЕЦ
    |       ИНАЧЕ ВТТаблицаОценочныеОбязательства.Подразделение
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |           ТОГДА ВЫБОР
    |                   КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоНУ1 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоНУ1
    |                   КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоНУ2 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоНУ2
    |                   КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоНУ3 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоНУ3
    |                   ИНАЧЕ ВТТаблицаОценочныеОбязательства.Подразделение
    |               КОНЕЦ
    |       ИНАЧЕ ВТТаблицаОценочныеОбязательства.Подразделение
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетНУ
    |       КОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы) КАК ПланСчетов.Типовой).СчетНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяСсылка)
    |           ТОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы) КАК ПланСчетов.Типовой).СчетНУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ОбщиеИАдминистративныеРасходы)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоНУ1
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоНУ2
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоНУ3
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   ВТТаблицаОценочныеОбязательства.СН,
    |   ЗНАЧЕНИЕ(ПланСчетов.Типовой.КраткосрочныеОценочныеОбязательстваПоВознаграждениямРаботникам),
    |   ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка),
    |   ВЫБОР
    |       КОГДА НЕ &ВедениеУчетаПоСотрудникам
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   НЕОПРЕДЕЛЕНО,
    |   ВЫБОР
    |       КОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПрочиеРасходы) КАК ПланСчетов.Типовой).СчетНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяСсылка)
    |           ТОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПрочиеРасходы) КАК ПланСчетов.Типовой).СчетНУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПрочиеРасходы)
    |   КОНЕЦ,
    |   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.СоциальныйНалог),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка),
    |   НалогиСборыОтчисления.Ссылка,
    |   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.СоциальныйНалог)
    |ИЗ
    |   ВТТаблицаОценочныеОбязательства КАК ВТТаблицаОценочныеОбязательства
    |       ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НалогиСборыОтчисления КАК НалогиСборыОтчисления
    |       ПО (НалогиСборыОтчисления.Ссылка = ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.СоциальныйНалог))
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |   ВТТаблицаОценочныеОбязательства.Ссылка,
    |   ВТТаблицаОценочныеОбязательства.НомерСтроки,
    |   ВТТаблицаОценочныеОбязательства.Подразделение,
    |   ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПустаяСсылка),
    |   ВТТаблицаОценочныеОбязательства.ФизическоеЛицо,
    |   ВТТаблицаОценочныеОбязательства.СтруктурноеПодразделение,
    |   ВТТаблицаОценочныеОбязательства.Резерв,
    |   ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.ПустаяСсылка),
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |           ТОГДА ВЫБОР
    |                   КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1
    |                   КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2
    |                   КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3
    |                   ИНАЧЕ ВТТаблицаОценочныеОбязательства.Подразделение
    |               КОНЕЦ
    |       ИНАЧЕ ВТТаблицаОценочныеОбязательства.Подразделение
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |           ТОГДА ВЫБОР
    |                   КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоНУ1 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоНУ1
    |                   КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоНУ2 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоНУ2
    |                   КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоНУ3 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоНУ3
    |                   ИНАЧЕ ВТТаблицаОценочныеОбязательства.Подразделение
    |               КОНЕЦ
    |       ИНАЧЕ ВТТаблицаОценочныеОбязательства.Подразделение
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетНУ
    |       КОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы) КАК ПланСчетов.Типовой).СчетНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяСсылка)
    |           ТОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы) КАК ПланСчетов.Типовой).СчетНУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ОбщиеИАдминистративныеРасходы)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоНУ1
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоНУ2
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоНУ3
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   ВТТаблицаОценочныеОбязательства.ОППВ,
    |   ЗНАЧЕНИЕ(ПланСчетов.Типовой.КраткосрочныеОценочныеОбязательстваПоВознаграждениямРаботникам),
    |   ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка),
    |   ВЫБОР
    |       КОГДА НЕ &ВедениеУчетаПоСотрудникам
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   НЕОПРЕДЕЛЕНО,
    |   ВЫБОР
    |       КОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПрочиеРасходы) КАК ПланСчетов.Типовой).СчетНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяСсылка)
    |           ТОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПрочиеРасходы) КАК ПланСчетов.Типовой).СчетНУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПрочиеРасходы)
    |   КОНЕЦ,
    |   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ОбязательныеПрофессиональныеПенсионныеВзносы),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка),
    |   НалогиСборыОтчисления.Ссылка,
    |   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ОбязательныеПрофессиональныеПенсионныеВзносы)
    |ИЗ
    |   ВТТаблицаОценочныеОбязательства КАК ВТТаблицаОценочныеОбязательства
    |       ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НалогиСборыОтчисления КАК НалогиСборыОтчисления
    |       ПО (НалогиСборыОтчисления.Ссылка = ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.ОбязательныеПрофессиональныеПенсионныеВзносы))
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |   ВТТаблицаОценочныеОбязательства.Ссылка,
    |   ВТТаблицаОценочныеОбязательства.НомерСтроки,
    |   ВТТаблицаОценочныеОбязательства.Подразделение,
    |   ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПустаяСсылка),
    |   ВТТаблицаОценочныеОбязательства.ФизическоеЛицо,
    |   ВТТаблицаОценочныеОбязательства.СтруктурноеПодразделение,
    |   ВТТаблицаОценочныеОбязательства.Резерв,
    |   ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.ПустаяСсылка),
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |           ТОГДА ВЫБОР
    |                   КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1
    |                   КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2
    |                   КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3
    |                   ИНАЧЕ ВТТаблицаОценочныеОбязательства.Подразделение
    |               КОНЕЦ
    |       ИНАЧЕ ВТТаблицаОценочныеОбязательства.Подразделение
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |           ТОГДА ВЫБОР
    |                   КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоНУ1 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоНУ1
    |                   КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоНУ2 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоНУ2
    |                   КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоНУ3 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоНУ3
    |                   ИНАЧЕ ВТТаблицаОценочныеОбязательства.Подразделение
    |               КОНЕЦ
    |       ИНАЧЕ ВТТаблицаОценочныеОбязательства.Подразделение
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетНУ
    |       КОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы) КАК ПланСчетов.Типовой).СчетНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяСсылка)
    |           ТОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы) КАК ПланСчетов.Типовой).СчетНУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ОбщиеИАдминистративныеРасходы)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоНУ1
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоНУ2
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоНУ3
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   ВТТаблицаОценочныеОбязательства.ОПВР,
    |   ЗНАЧЕНИЕ(ПланСчетов.Типовой.КраткосрочныеОценочныеОбязательстваПоВознаграждениямРаботникам),
    |   ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка),
    |   ВЫБОР
    |       КОГДА НЕ &ВедениеУчетаПоСотрудникам
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   НЕОПРЕДЕЛЕНО,
    |   ВЫБОР
    |       КОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПрочиеРасходы) КАК ПланСчетов.Типовой).СчетНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяСсылка)
    |           ТОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПрочиеРасходы) КАК ПланСчетов.Типовой).СчетНУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПрочиеРасходы)
    |   КОНЕЦ,
    |   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ОбязательныеПенсионныеВзносыРаботодателя),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка),
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ОбязательныеПенсионныеВзносыРаботодателя)
    |ИЗ
    |   ВТТаблицаОценочныеОбязательства КАК ВТТаблицаОценочныеОбязательства
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |   ВТТаблицаОценочныеОбязательства.Ссылка,
    |   ВТТаблицаОценочныеОбязательства.НомерСтроки,
    |   ВТТаблицаОценочныеОбязательства.Подразделение,
    |   ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПустаяСсылка),
    |   ВТТаблицаОценочныеОбязательства.ФизическоеЛицо,
    |   ВТТаблицаОценочныеОбязательства.СтруктурноеПодразделение,
    |   ВТТаблицаОценочныеОбязательства.Резерв,
    |   ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.ПустаяСсылка),
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |           ТОГДА ВЫБОР
    |                   КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1
    |                   КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2
    |                   КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3
    |                   ИНАЧЕ ВТТаблицаОценочныеОбязательства.Подразделение
    |               КОНЕЦ
    |       ИНАЧЕ ВТТаблицаОценочныеОбязательства.Подразделение
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |           ТОГДА ВЫБОР
    |                   КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоНУ1 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоНУ1
    |                   КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоНУ2 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоНУ2
    |                   КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоНУ3 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоНУ3
    |                   ИНАЧЕ ВТТаблицаОценочныеОбязательства.Подразделение
    |               КОНЕЦ
    |       ИНАЧЕ ВТТаблицаОценочныеОбязательства.Подразделение
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетНУ
    |       КОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы) КАК ПланСчетов.Типовой).СчетНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяСсылка)
    |           ТОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы) КАК ПланСчетов.Типовой).СчетНУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ОбщиеИАдминистративныеРасходы)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоНУ1
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоНУ2
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете.СубконтоНУ3
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   ВТТаблицаОценочныеОбязательства.ООСМС,
    |   ЗНАЧЕНИЕ(ПланСчетов.Типовой.КраткосрочныеОценочныеОбязательстваПоВознаграждениямРаботникам),
    |   ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка),
    |   ВЫБОР
    |       КОГДА НЕ &ВедениеУчетаПоСотрудникам
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   НЕОПРЕДЕЛЕНО,
    |   ВЫБОР
    |       КОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПрочиеРасходы) КАК ПланСчетов.Типовой).СчетНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяСсылка)
    |           ТОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПрочиеРасходы) КАК ПланСчетов.Типовой).СчетНУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПрочиеРасходы)
    |   КОНЕЦ,
    |   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ОтчисленияОСМС),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка),
    |   НалогиСборыОтчисления.Ссылка,
    |   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ОтчисленияОСМС)
    |ИЗ
    |   ВТТаблицаОценочныеОбязательства КАК ВТТаблицаОценочныеОбязательства
    |       ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НалогиСборыОтчисления КАК НалогиСборыОтчисления
    |       ПО (НалогиСборыОтчисления.Ссылка = ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.ОтчисленияОбязательноеСоциальноеМедицинскоеСтрахование))
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |   ВТТаблицаОтражениеРезервовПоПроизводственнымСчетам.Ссылка КАК Ссылка,
    |   ВТТаблицаОтражениеРезервовПоПроизводственнымСчетам.НомерСтроки КАК НомерСтроки,
    |   ВТТаблицаОтражениеРезервовПоПроизводственнымСчетам.Подразделение КАК Подразделение,
    |   ВТТаблицаОтражениеРезервовПоПроизводственнымСчетам.ВидОперации КАК ВидОперации,
    |   ВТТаблицаОтражениеРезервовПоПроизводственнымСчетам.ФизическоеЛицо КАК ФизическоеЛицо,
    |   ВТТаблицаОтражениеРезервовПоПроизводственнымСчетам.СтруктурноеПодразделение КАК СтруктурноеПодразделение,
    |   ВТТаблицаОтражениеРезервовПоПроизводственнымСчетам.Резерв КАК Резерв,
    |   ВТТаблицаОтражениеРезервовПоПроизводственнымСчетам.Контрагент КАК Контрагент,
    |   ВТТаблицаОтражениеРезервовПоПроизводственнымСчетам.ВидПлатежа КАК ВидПлатежа,
    |   ВТТаблицаОтражениеРезервовПоПроизводственнымСчетам.СчетДт КАК СчетДт,
    |   ВТТаблицаОтражениеРезервовПоПроизводственнымСчетам.СубконтоДт1 КАК СубконтоДт1,
    |   ВТТаблицаОтражениеРезервовПоПроизводственнымСчетам.СубконтоДт2 КАК СубконтоДт2,
    |   ВТТаблицаОтражениеРезервовПоПроизводственнымСчетам.СубконтоДт3 КАК СубконтоДт3,
    |   ВТТаблицаОтражениеРезервовПоПроизводственнымСчетам.СчетДтНУ КАК СчетДтНУ,
    |   ВТТаблицаОтражениеРезервовПоПроизводственнымСчетам.СубконтоДтНУ1 КАК СубконтоДтНУ1,
    |   ВТТаблицаОтражениеРезервовПоПроизводственнымСчетам.СубконтоДтНУ2 КАК СубконтоДтНУ2,
    |   ВТТаблицаОтражениеРезервовПоПроизводственнымСчетам.СубконтоДтНУ3 КАК СубконтоДтНУ3,
    |   ВТТаблицаОтражениеРезервовПоПроизводственнымСчетам.Сумма КАК Сумма,
    |   ВТТаблицаОтражениеРезервовПоПроизводственнымСчетам.СчетКт КАК СчетКт,
    |   ВТТаблицаОтражениеРезервовПоПроизводственнымСчетам.СубконтоКт1 КАК СубконтоКт1,
    |   ВТТаблицаОтражениеРезервовПоПроизводственнымСчетам.СубконтоКт2 КАК СубконтоКт2,
    |   ВТТаблицаОтражениеРезервовПоПроизводственнымСчетам.СубконтоКт3 КАК СубконтоКт3,
    |   ВТТаблицаОтражениеРезервовПоПроизводственнымСчетам.СчетКтНУ КАК СчетКтНУ,
    |   ВТТаблицаОтражениеРезервовПоПроизводственнымСчетам.СубконтоКтНУ1 КАК СубконтоКтНУ1,
    |   ВТТаблицаОтражениеРезервовПоПроизводственнымСчетам.СубконтоКтНУ2 КАК СубконтоКтНУ2,
    |   ВТТаблицаОтражениеРезервовПоПроизводственнымСчетам.СубконтоКтНУ3 КАК СубконтоКтНУ3,
    |   ВТТаблицаОтражениеРезервовПоПроизводственнымСчетам.ВидУчетаДт КАК ВидУчетаДт,
    |   ВТТаблицаОтражениеРезервовПоПроизводственнымСчетам.ВидУчетаКт КАК ВидУчетаКт,
    |   ВТТаблицаОтражениеРезервовПоПроизводственнымСчетам.ВидНалогаОтчисления КАК ВидНалогаОтчисления,
    |   ВТТаблицаОтражениеРезервовПоПроизводственнымСчетам.СтатьяЗатрат КАК СтатьяЗатрат,
    |   ВТТаблицаОтражениеРезервовПоПроизводственнымСчетам.ПодразделениеБУ КАК ПодразделениеБУ,
    |   ВТТаблицаОтражениеРезервовПоПроизводственнымСчетам.ПодразделениеНУ КАК ПодразделениеНУ,
    |   НЕОПРЕДЕЛЕНО КАК КонтрагентОтправитель,
    |   НЕОПРЕДЕЛЕНО КАК РаботникОрганизации
    |ПОМЕСТИТЬ ТаблицаОтражениеВУчете
    |ИЗ
    |   ВТТаблицаОтражениеРезервовПоПроизводственнымСчетам КАК ВТТаблицаОтражениеРезервовПоПроизводственнымСчетам
    |ГДЕ
    |   ВТТаблицаОтражениеРезервовПоПроизводственнымСчетам.Сумма <> 0
    |   И ВТТаблицаОтражениеРезервовПоПроизводственнымСчетам.СчетДт В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Типовой.ОсновноеПроизводство_), ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПолуфабрикатыСобственногоПроизводства_), ЗНАЧЕНИЕ(ПланСчетов.Типовой.ВспомогательныеПроизводства_), ЗНАЧЕНИЕ(ПланСчетов.Типовой.НакладныеРасходы_))
    |   И ВТТаблицаОтражениеРезервовПоПроизводственнымСчетам.СчетДтНУ В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ОсновноеПроизводство_), ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПолуфабрикатыСобственногоПроизводства), ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ВспомогательныеПроизводства), ЗНАЧЕНИЕ(ПланСчетов.Налоговый.НакладныеРасходы))
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |   ВТОтражениеВременнаяРазница.Ссылка,
    |   ВТОтражениеВременнаяРазница.НомерСтроки,
    |   ВТОтражениеВременнаяРазница.Подразделение,
    |   ВТОтражениеВременнаяРазница.ВидОперации,
    |   ВТОтражениеВременнаяРазница.ФизическоеЛицо,
    |   ВТОтражениеВременнаяРазница.СтруктурноеПодразделение,
    |   ВТОтражениеВременнаяРазница.Резерв,
    |   ВТОтражениеВременнаяРазница.Контрагент,
    |   ВТОтражениеВременнаяРазница.ВидПлатежа,
    |   ВТОтражениеВременнаяРазница.СчетДт,
    |   ВТОтражениеВременнаяРазница.СубконтоДт1,
    |   ВТОтражениеВременнаяРазница.СубконтоДт2,
    |   ВТОтражениеВременнаяРазница.СубконтоДт3,
    |   ВТОтражениеВременнаяРазница.СчетДтНУ,
    |   ВТОтражениеВременнаяРазница.СубконтоДтНУ1,
    |   ВТОтражениеВременнаяРазница.СубконтоДтНУ2,
    |   ВТОтражениеВременнаяРазница.СубконтоДтНУ3,
    |   ВТОтражениеВременнаяРазница.Сумма,
    |   ВТОтражениеВременнаяРазница.СчетКт,
    |   ВТОтражениеВременнаяРазница.СубконтоКт1,
    |   ВТОтражениеВременнаяРазница.СубконтоКт2,
    |   ВТОтражениеВременнаяРазница.СубконтоКт3,
    |   ВТОтражениеВременнаяРазница.СчетКтНУ,
    |   ВТОтражениеВременнаяРазница.СубконтоКтНУ1,
    |   ВТОтражениеВременнаяРазница.СубконтоКтНУ2,
    |   ВТОтражениеВременнаяРазница.СубконтоКтНУ3,
    |   ВТОтражениеВременнаяРазница.ВидУчетаДт,
    |   ВТОтражениеВременнаяРазница.ВидУчетаКт,
    |   ВТОтражениеВременнаяРазница.ВидНалогаОтчисления,
    |   ВТОтражениеВременнаяРазница.СтатьяЗатрат,
    |   ВТОтражениеВременнаяРазница.ПодразделениеБУ,
    |   ВТОтражениеВременнаяРазница.ПодразделениеНУ,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО
    |ИЗ
    |   ВТОтражениеВременнаяРазница КАК ВТОтражениеВременнаяРазница
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |   ВТОтражениеОценочныеОбязательства.Ссылка,
    |   ВТОтражениеОценочныеОбязательства.НомерСтроки,
    |   ВТОтражениеОценочныеОбязательства.Подразделение,
    |   ВТОтражениеОценочныеОбязательства.ВидОперации,
    |   ВТОтражениеОценочныеОбязательства.ФизическоеЛицо,
    |   ВТОтражениеОценочныеОбязательства.СтруктурноеПодразделение,
    |   ВТОтражениеОценочныеОбязательства.Резерв,
    |   ВТОтражениеОценочныеОбязательства.Контрагент,
    |   ВТОтражениеОценочныеОбязательства.ВидПлатежа,
    |   ВТОтражениеОценочныеОбязательства.СчетДт,
    |   ВТОтражениеОценочныеОбязательства.СубконтоДт1,
    |   ВТОтражениеОценочныеОбязательства.СубконтоДт2,
    |   ВТОтражениеОценочныеОбязательства.СубконтоДт3,
    |   ВТОтражениеОценочныеОбязательства.СчетДтНУ,
    |   ВТОтражениеОценочныеОбязательства.СубконтоДтНУ1,
    |   ВТОтражениеОценочныеОбязательства.СубконтоДтНУ2,
    |   ВТОтражениеОценочныеОбязательства.СубконтоДтНУ3,
    |   ВТОтражениеОценочныеОбязательства.Сумма,
    |   ВТОтражениеОценочныеОбязательства.СчетКт,
    |   ВТОтражениеОценочныеОбязательства.СубконтоКт1,
    |   ВТОтражениеОценочныеОбязательства.СубконтоКт2,
    |   ВТОтражениеОценочныеОбязательства.СубконтоКт3,
    |   ВТОтражениеОценочныеОбязательства.СчетКтНУ,
    |   ВТОтражениеОценочныеОбязательства.СубконтоКтНУ1,
    |   ВТОтражениеОценочныеОбязательства.СубконтоКтНУ2,
    |   ВТОтражениеОценочныеОбязательства.СубконтоКтНУ3,
    |   ВТОтражениеОценочныеОбязательства.ВидУчетаДт,
    |   ВТОтражениеОценочныеОбязательства.ВидУчетаКт,
    |   ВТОтражениеОценочныеОбязательства.ВидНалогаОтчисления,
    |   ВТОтражениеОценочныеОбязательства.СтатьяЗатрат,
    |   ВТОтражениеОценочныеОбязательства.ПодразделениеБУ,
    |   ВТОтражениеОценочныеОбязательства.ПодразделениеНУ,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО
    |ИЗ
    |   ВТОтражениеОценочныеОбязательства КАК ВТОтражениеОценочныеОбязательства
    |ГДЕ
    |   НЕ ВТОтражениеОценочныеОбязательства.СчетДт В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Типовой.ОсновноеПроизводство_), ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПолуфабрикатыСобственногоПроизводства_), ЗНАЧЕНИЕ(ПланСчетов.Типовой.ВспомогательныеПроизводства_), ЗНАЧЕНИЕ(ПланСчетов.Типовой.НакладныеРасходы_))
    |   И НЕ ВТОтражениеОценочныеОбязательства.СчетДтНУ В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ОсновноеПроизводство_), ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПолуфабрикатыСобственногоПроизводства), ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ВспомогательныеПроизводства), ЗНАЧЕНИЕ(ПланСчетов.Налоговый.НакладныеРасходы))
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |   ТаблицаОтражениеВУчете.Ссылка КАК Ссылка,
    |   ТаблицаОтражениеВУчете.НомерСтроки КАК НомерСтроки,
    |   ТаблицаОтражениеВУчете.Подразделение КАК Подразделение,
    |   ТаблицаОтражениеВУчете.ВидОперации КАК ВидОперации,
    |   ТаблицаОтражениеВУчете.ФизическоеЛицо КАК ФизическоеЛицо,
    |   ВЫБОР
    |       КОГДА &ПоддержкаРаботыСоСтруктурнымиПодразделениями
    |               И ТаблицаОтражениеВУчете.СтруктурноеПодразделение.ЯвляетсяСтруктурнымПодразделением
    |           ТОГДА ТаблицаОтражениеВУчете.СтруктурноеПодразделение
    |       ИНАЧЕ &ПустоеПодразделение
    |   КОНЕЦ КАК СтруктурноеПодразделение,
    |   ТаблицаОтражениеВУчете.Резерв КАК Резерв,
    |   ТаблицаОтражениеВУчете.Контрагент КАК Контрагент,
    |   ТаблицаОтражениеВУчете.ВидПлатежа КАК ВидПлатежа,
    |   ТаблицаОтражениеВУчете.СчетДт КАК СчетДт,
    |   ТаблицаОтражениеВУчете.СубконтоДт1 КАК СубконтоДт1,
    |   ТаблицаОтражениеВУчете.СубконтоДт2 КАК СубконтоДт2,
    |   ТаблицаОтражениеВУчете.СубконтоДт3 КАК СубконтоДт3,
    |   ТаблицаОтражениеВУчете.СчетДтНУ КАК СчетДтНУ,
    |   ТаблицаОтражениеВУчете.СубконтоДтНУ1 КАК СубконтоДтНУ1,
    |   ТаблицаОтражениеВУчете.СубконтоДтНУ2 КАК СубконтоДтНУ2,
    |   ТаблицаОтражениеВУчете.СубконтоДтНУ3 КАК СубконтоДтНУ3,
    |   ТаблицаОтражениеВУчете.Сумма КАК Сумма,
    |   ТаблицаОтражениеВУчете.СчетКт КАК СчетКт,
    |   ТаблицаОтражениеВУчете.СубконтоКт1 КАК СубконтоКт1,
    |   ТаблицаОтражениеВУчете.СубконтоКт2 КАК СубконтоКт2,
    |   ТаблицаОтражениеВУчете.СубконтоКт3 КАК СубконтоКт3,
    |   ТаблицаОтражениеВУчете.СчетКтНУ КАК СчетКтНУ,
    |   ТаблицаОтражениеВУчете.СубконтоКтНУ1 КАК СубконтоКтНУ1,
    |   ТаблицаОтражениеВУчете.СубконтоКтНУ2 КАК СубконтоКтНУ2,
    |   ТаблицаОтражениеВУчете.СубконтоКтНУ3 КАК СубконтоКтНУ3,
    |   ТаблицаОтражениеВУчете.ВидУчетаДт КАК ВидУчетаДт,
    |   ТаблицаОтражениеВУчете.ВидУчетаКт КАК ВидУчетаКт,
    |   ТаблицаОтражениеВУчете.ВидНалогаОтчисления КАК ВидНалогаОтчисления,
    |   ТаблицаОтражениеВУчете.СтатьяЗатрат КАК СтатьяЗатрат,
    |   ТаблицаОтражениеВУчете.ПодразделениеБУ КАК ПодразделениеБУ,
    |   ТаблицаОтражениеВУчете.ПодразделениеНУ КАК ПодразделениеНУ,
    |   ТаблицаОтражениеВУчете.КонтрагентОтправитель КАК КонтрагентОтправитель,
    |   ТаблицаОтражениеВУчете.РаботникОрганизации КАК РаботникОрганизации
    |ПОМЕСТИТЬ ИтогТаблицаОтраженияВУчете
    |ИЗ
    |   ТаблицаОтражениеВУчете КАК ТаблицаОтражениеВУчете" + ОбщегоНазначенияБКВызовСервера.ТекстРазделителяЗапросовПакета();
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВременныеТаблицыДокументаОтражениеРезервовОплатыТруда()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
    |   ДокументыКОтражению.Ссылка КАК Ссылка,
    |   ДокументыКОтражению.Организация КАК Организация,
    |   ОценочныеОбязательства.НомерСтроки КАК НомерСтроки,
    |   ОценочныеОбязательства.Подразделение КАК Подразделение,
    |   ОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете КАК СпособОтраженияЗарплатыВБухучете,
    |   ОценочныеОбязательства.ФизическоеЛицо КАК ФизическоеЛицо,
    |   СУММА(ОценочныеОбязательства.СуммаРезерва) КАК Сумма,
    |   СУММА(ОценочныеОбязательства.СуммаРезерваСН) КАК СН,
    |   СУММА(ОценочныеОбязательства.СуммаРезерваСО) КАК СО,
    |   СУММА(ОценочныеОбязательства.СуммаРезерваОППВ) КАК ОППВ,
    |   СУММА(ОценочныеОбязательства.СуммаРезерваОПВР) КАК ОПВР,
    |   СУММА(ОценочныеОбязательства.СуммаРезерваОтчисленияОСМС) КАК ООСМС,
//Кибернетика Сухомлинов++
	//|   ДокументыКОтражению.Резерв КАК Резерв,
	|	ВЫБОР
	|		КОГДА ОценочныеОбязательства.киб_Резерв = ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка)
	|			ТОГДА ДокументыКОтражению.Резерв
	|		ИНАЧЕ ОценочныеОбязательства.киб_Резерв
	|	КОНЕЦ КАК Резерв,
//Кибернетика Сухомлинов--
	|   ОценочныеОбязательства.СтруктурноеПодразделение КАК СтруктурноеПодразделение
    |ПОМЕСТИТЬ ВТТаблицаРезервыОплатыТруда
    |ИЗ
    |   Документ.ОтражениеЗарплатыВБухучете.ОценочныеОбязательства КАК ОценочныеОбязательства
    |       ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКОтражению КАК ДокументыКОтражению
    |       ПО ОценочныеОбязательства.Ссылка = ДокументыКОтражению.Ссылка
    |ГДЕ
    |   ДокументыКОтражению.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОтражениеЗарплатыВБухучете.ОтражениеРезервовОплатыТруда)
    |
    |СГРУППИРОВАТЬ ПО
    |   ОценочныеОбязательства.Подразделение,
    |   ОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете,
    |   ДокументыКОтражению.Ссылка,
    |   ДокументыКОтражению.Организация,
    |   ОценочныеОбязательства.НомерСтроки,
    |   ОценочныеОбязательства.ФизическоеЛицо,
//Кибернетика Сухомлинов++
	//|   ДокументыКОтражению.Резерв,
	|	ВЫБОР
	|		КОГДА ОценочныеОбязательства.киб_Резерв = ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка)
	|			ТОГДА ДокументыКОтражению.Резерв
	|		ИНАЧЕ ОценочныеОбязательства.киб_Резерв
	|	КОНЕЦ ,
//Кибернетика Сухомлинов--
    |   ОценочныеОбязательства.СтруктурноеПодразделение
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |   ВТТаблицаРезервыОплатыТруда.Ссылка КАК Ссылка,
    |   ВТТаблицаРезервыОплатыТруда.НомерСтроки КАК НомерСтроки,
    |   ВТТаблицаРезервыОплатыТруда.Подразделение КАК Подразделение,
    |   ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПустаяСсылка) КАК ВидОперации,
    |   ВТТаблицаРезервыОплатыТруда.ФизическоеЛицо КАК ФизическоеЛицо,
    |   ВТТаблицаРезервыОплатыТруда.СтруктурноеПодразделение КАК СтруктурноеПодразделение,
    |   ВТТаблицаРезервыОплатыТруда.Резерв КАК Резерв,
    |   ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Контрагент,
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.ПустаяСсылка) КАК ВидПлатежа,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |           ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1
    |       ИНАЧЕ ВТТаблицаРезервыОплатыТруда.Подразделение
    |   КОНЕЦ КАК ПодразделениеБУ,
    |   ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК ПодразделениеНУ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы)
    |   КОНЕЦ КАК СчетДт,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка)
    |   КОНЕЦ КАК СубконтоДт1,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
    |   КОНЕЦ КАК СубконтоДт2,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ КАК СубконтоДт3,
    |   НЕОПРЕДЕЛЕНО КАК СчетДтНУ,
    |   НЕОПРЕДЕЛЕНО КАК СубконтоДтНУ1,
    |   НЕОПРЕДЕЛЕНО КАК СубконтоДтНУ2,
    |   НЕОПРЕДЕЛЕНО КАК СубконтоДтНУ3,
    |   ВТТаблицаРезервыОплатыТруда.Сумма КАК Сумма,
    |   ЗНАЧЕНИЕ(ПланСчетов.Типовой.КраткосрочныеОценочныеОбязательстваПоВознаграждениямРаботникам) КАК СчетКт,
    |   ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка) КАК СубконтоКт1,
	// Дорофеева А. 10.01.2025 Кибернетика
	//|   ВЫБОР
	//|       КОГДА НЕ &ВедениеУчетаПоСотрудникам
	//|           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	//|       ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|   КОНЕЦ КАК СубконтоКт2,
    //|   НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка) КАК СубконтоКт2,
	|   ВЫБОР
    |       КОГДА НЕ &ВедениеУчетаПоСотрудникам
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ КАК СубконтоКт3,
	//*************
    |   НЕОПРЕДЕЛЕНО КАК СчетКтНУ,
    |   НЕОПРЕДЕЛЕНО КАК СубконтоКтНУ1,
    |   НЕОПРЕДЕЛЕНО КАК СубконтоКтНУ2,
	|   НЕОПРЕДЕЛЕНО КАК СубконтоКтНУ3,
	|   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка) КАК ВидУчетаДт,
	|   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка) КАК ВидУчетаКт,
	// Дорофеева А. 17.01.2025 Кибернетика 
	// Подставим сюда налог, что б потом взялась статья затрат
	//|   НЕОПРЕДЕЛЕНО КАК ВидНалогаОтчисления,
	|   ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.СоциальныйНалог) КАК ВидНалогаОтчисления,
	// Дорофеева А. 10.01.2025 Кибернетика
	//|   ВЫРАЗИТЬ(ВТТаблицаРезервыОплатыТруда.Резерв КАК Справочник.Резервы).СтатьяЗатрат КАК СтатьяЗатрат
	|   &ФОТ КАК СтатьяЗатрат
	//*****************
	|ПОМЕСТИТЬ ВТОтражениеРезервовОплатыТруда
	|ИЗ
	|   ВТТаблицаРезервыОплатыТруда КАК ВТТаблицаРезервыОплатыТруда
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |   ВТТаблицаРезервыОплатыТруда.Ссылка,
    |   ВТТаблицаРезервыОплатыТруда.НомерСтроки,
    |   ВТТаблицаРезервыОплатыТруда.Подразделение,
    |   ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПустаяСсылка),
    |   ВТТаблицаРезервыОплатыТруда.ФизическоеЛицо,
    |   ВТТаблицаРезервыОплатыТруда.СтруктурноеПодразделение,
    |   ВТТаблицаРезервыОплатыТруда.Резерв,
    |   ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.ПустаяСсылка),
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |           ТОГДА ВЫБОР
    |                   КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1
    |                   КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2
    |                   КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3
    |                   ИНАЧЕ ВТТаблицаРезервыОплатыТруда.Подразделение
    |               КОНЕЦ
    |       ИНАЧЕ ВТТаблицаРезервыОплатыТруда.Подразделение
    |   КОНЕЦ,
    |   ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ВТТаблицаРезервыОплатыТруда.СО,
    |   ЗНАЧЕНИЕ(ПланСчетов.Типовой.КраткосрочныеОценочныеОбязательстваПоВознаграждениямРаботникам),
    |   ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка),
	// Дорофеева А. 10.01.2025 Кибернетика
	//|   ВЫБОР
	//|       КОГДА НЕ &ВедениеУчетаПоСотрудникам
	//|           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	//|       ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|   КОНЕЦ,
	//|   НЕОПРЕДЕЛЕНО,
	|   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка),
	|   ВЫБОР
    |       КОГДА НЕ &ВедениеУчетаПоСотрудникам
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
	//***************
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка),
    |   НалогиСборыОтчисления.Ссылка,
    // Дорофеева А. 10.01.2025 Кибернетика
    //|   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.СоциальныеОтчисления)
	|   &СоциальныеОтчисления
	//****************
    |ИЗ
    |   ВТТаблицаРезервыОплатыТруда КАК ВТТаблицаРезервыОплатыТруда
    |       ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НалогиСборыОтчисления КАК НалогиСборыОтчисления
    |       ПО (НалогиСборыОтчисления.Ссылка = ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.ОбязательныеСоциальныеОтчисления))
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |   ВТТаблицаРезервыОплатыТруда.Ссылка,
    |   ВТТаблицаРезервыОплатыТруда.НомерСтроки,
    |   ВТТаблицаРезервыОплатыТруда.Подразделение,
    |   ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПустаяСсылка),
    |   ВТТаблицаРезервыОплатыТруда.ФизическоеЛицо,
    |   ВТТаблицаРезервыОплатыТруда.СтруктурноеПодразделение,
    |   ВТТаблицаРезервыОплатыТруда.Резерв,
    |   ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.ПустаяСсылка),
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |           ТОГДА ВЫБОР
    |                   КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1
    |                   КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2
    |                   КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3
    |                   ИНАЧЕ ВТТаблицаРезервыОплатыТруда.Подразделение
    |               КОНЕЦ
    |       ИНАЧЕ ВТТаблицаРезервыОплатыТруда.Подразделение
    |   КОНЕЦ,
    |   ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ВТТаблицаРезервыОплатыТруда.СН,
    |   ЗНАЧЕНИЕ(ПланСчетов.Типовой.КраткосрочныеОценочныеОбязательстваПоВознаграждениямРаботникам),
    |   ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка),
    // Дорофеева А. 10.01.2025 Кибернетика
	//|   ВЫБОР
	//|       КОГДА НЕ &ВедениеУчетаПоСотрудникам
	//|           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	//|       ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|   КОНЕЦ,
	//|   НЕОПРЕДЕЛЕНО,
	|   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка),
	|   ВЫБОР
    |       КОГДА НЕ &ВедениеУчетаПоСотрудникам
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
	//***************
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка),
    |   НалогиСборыОтчисления.Ссылка,
    // Дорофеева А. 10.01.2025 Кибернетика
    //|   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.СоциальныйНалог)
	|   &СоциальныйНалог
	//****************
    |ИЗ
    |   ВТТаблицаРезервыОплатыТруда КАК ВТТаблицаРезервыОплатыТруда
    |       ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НалогиСборыОтчисления КАК НалогиСборыОтчисления
    |       ПО (НалогиСборыОтчисления.Ссылка = ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.СоциальныйНалог))
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |   ВТТаблицаРезервыОплатыТруда.Ссылка,
    |   ВТТаблицаРезервыОплатыТруда.НомерСтроки,
    |   ВТТаблицаРезервыОплатыТруда.Подразделение,
    |   ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПустаяСсылка),
    |   ВТТаблицаРезервыОплатыТруда.ФизическоеЛицо,
    |   ВТТаблицаРезервыОплатыТруда.СтруктурноеПодразделение,
    |   ВТТаблицаРезервыОплатыТруда.Резерв,
    |   ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.ПустаяСсылка),
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |           ТОГДА ВЫБОР
    |                   КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1
    |                   КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2
    |                   КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3
    |                   ИНАЧЕ ВТТаблицаРезервыОплатыТруда.Подразделение
    |               КОНЕЦ
    |       ИНАЧЕ ВТТаблицаРезервыОплатыТруда.Подразделение
    |   КОНЕЦ,
    |   ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ВТТаблицаРезервыОплатыТруда.ОППВ,
    |   ЗНАЧЕНИЕ(ПланСчетов.Типовой.КраткосрочныеОценочныеОбязательстваПоВознаграждениямРаботникам),
    |   ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка),
    // Дорофеева А. 10.01.2025 Кибернетика
	//|   ВЫБОР
	//|       КОГДА НЕ &ВедениеУчетаПоСотрудникам
	//|           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	//|       ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|   КОНЕЦ,
	//|   НЕОПРЕДЕЛЕНО,
	|   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка),
	|   ВЫБОР
    |       КОГДА НЕ &ВедениеУчетаПоСотрудникам
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
	//***************
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка),
    |   НалогиСборыОтчисления.Ссылка,
    // Дорофеева А. 10.01.2025 Кибернетика
    //|   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ОбязательныеПрофессиональныеПенсионныеВзносы)
	|   &ОбязательныеПрофессиональныеПенсионныеВзносы
	//****************
    |ИЗ
    |   ВТТаблицаРезервыОплатыТруда КАК ВТТаблицаРезервыОплатыТруда
    |       ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НалогиСборыОтчисления КАК НалогиСборыОтчисления
    |       ПО (НалогиСборыОтчисления.Ссылка = ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.ОбязательныеПрофессиональныеПенсионныеВзносы))
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |   ВТТаблицаРезервыОплатыТруда.Ссылка,
    |   ВТТаблицаРезервыОплатыТруда.НомерСтроки,
    |   ВТТаблицаРезервыОплатыТруда.Подразделение,
    |   ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПустаяСсылка),
    |   ВТТаблицаРезервыОплатыТруда.ФизическоеЛицо,
    |   ВТТаблицаРезервыОплатыТруда.СтруктурноеПодразделение,
    |   ВТТаблицаРезервыОплатыТруда.Резерв,
    |   ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.ПустаяСсылка),
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |           ТОГДА ВЫБОР
    |                   КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1
    |                   КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2
    |                   КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3
    |                   ИНАЧЕ ВТТаблицаРезервыОплатыТруда.Подразделение
    |               КОНЕЦ
    |       ИНАЧЕ ВТТаблицаРезервыОплатыТруда.Подразделение
    |   КОНЕЦ,
    |   ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ВТТаблицаРезервыОплатыТруда.ОПВР,
    |   ЗНАЧЕНИЕ(ПланСчетов.Типовой.КраткосрочныеОценочныеОбязательстваПоВознаграждениямРаботникам),
    |   ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка),
    // Дорофеева А. 10.01.2025 Кибернетика
	//|   ВЫБОР
	//|       КОГДА НЕ &ВедениеУчетаПоСотрудникам
	//|           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	//|       ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|   КОНЕЦ,
	//|   НЕОПРЕДЕЛЕНО,
	|   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка),
	|   ВЫБОР
    |       КОГДА НЕ &ВедениеУчетаПоСотрудникам
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
	//***************
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка),
    |   НалогиСборыОтчисления.Ссылка,
	// Дорофеева А. 10.01.2025 Кибернетика
    //|   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ОбязательныеПенсионныеВзносыРаботодателя)
	|   &ОбязательныеПенсионныеВзносыРаботодателя
	//****************
    |ИЗ
	|   ВТТаблицаРезервыОплатыТруда КАК ВТТаблицаРезервыОплатыТруда
	// Дорофеева А. 10.01.2025 Кибернетика
	|       ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НалогиСборыОтчисления КАК НалогиСборыОтчисления
	|       ПО (НалогиСборыОтчисления.Ссылка = ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.ОбязательныеПенсионныеВзносыРаботодателя))
	//****************
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |   ВТТаблицаРезервыОплатыТруда.Ссылка,
    |   ВТТаблицаРезервыОплатыТруда.НомерСтроки,
    |   ВТТаблицаРезервыОплатыТруда.Подразделение,
    |   ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПустаяСсылка),
    |   ВТТаблицаРезервыОплатыТруда.ФизическоеЛицо,
    |   ВТТаблицаРезервыОплатыТруда.СтруктурноеПодразделение,
    |   ВТТаблицаРезервыОплатыТруда.Резерв,
    |   ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.ПустаяСсылка),
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |           ТОГДА ВЫБОР
    |                   КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1
    |                   КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2
    |                   КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3
    |                   ИНАЧЕ ВТТаблицаРезервыОплатыТруда.Подразделение
    |               КОНЕЦ
    |       ИНАЧЕ ВТТаблицаРезервыОплатыТруда.Подразделение
    |   КОНЕЦ,
    |   ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ВТТаблицаРезервыОплатыТруда.ООСМС,
    |   ЗНАЧЕНИЕ(ПланСчетов.Типовой.КраткосрочныеОценочныеОбязательстваПоВознаграждениямРаботникам),
    |   ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка),
    // Дорофеева А. 10.01.2025 Кибернетика
	//|   ВЫБОР
	//|       КОГДА НЕ &ВедениеУчетаПоСотрудникам
	//|           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	//|       ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|   КОНЕЦ,
	//|   НЕОПРЕДЕЛЕНО,
	|   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка),
	|   ВЫБОР
    |       КОГДА НЕ &ВедениеУчетаПоСотрудникам
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
	//***************
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка),
    |   НалогиСборыОтчисления.Ссылка,
	// Дорофеева А. 10.01.2025 Кибернетика
    //|   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ОтчисленияОСМС)
	|   &ОтчисленияОСМС
	//****************
    |ИЗ
    |   ВТТаблицаРезервыОплатыТруда КАК ВТТаблицаРезервыОплатыТруда
    |       ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НалогиСборыОтчисления КАК НалогиСборыОтчисления
    |       ПО (НалогиСборыОтчисления.Ссылка = ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.ОтчисленияОбязательноеСоциальноеМедицинскоеСтрахование))
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |   ВТТаблицаРезервыОплатыТруда.Ссылка КАК Ссылка,
    |   ВТТаблицаРезервыОплатыТруда.НомерСтроки КАК НомерСтроки,
    |   ВТТаблицаРезервыОплатыТруда.Подразделение КАК Подразделение,
    |   ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПустаяСсылка) КАК ВидОперации,
    |   ВТТаблицаРезервыОплатыТруда.ФизическоеЛицо КАК ФизическоеЛицо,
    |   ВТТаблицаРезервыОплатыТруда.СтруктурноеПодразделение КАК СтруктурноеПодразделение,
    |   ВТТаблицаРезервыОплатыТруда.Резерв КАК Резерв,
    |   ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Контрагент,
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.ПустаяСсылка) КАК ВидПлатежа,
    |   ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК ПодразделениеБУ,
    |   ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК ПодразделениеНУ,
    |   НЕОПРЕДЕЛЕНО КАК СчетДт,
    |   НЕОПРЕДЕЛЕНО КАК СубконтоДт1,
    |   НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
    |   НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
    |   ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПрочиеРасходы) КАК СчетДтНУ,
    |   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка) КАК СубконтоДтНУ1,
    |   НЕОПРЕДЕЛЕНО КАК СубконтоДтНУ2,
    |   НЕОПРЕДЕЛЕНО КАК СубконтоДтНУ3,
    |   ВТТаблицаРезервыОплатыТруда.Сумма КАК Сумма,
    |   НЕОПРЕДЕЛЕНО КАК СчетКт,
    |   НЕОПРЕДЕЛЕНО КАК СубконтоКт1,
    |   НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
    |   НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
    |   ЗНАЧЕНИЕ(ПланСчетов.Налоговый.КраткосрочныеОценочныеОбязательстваПоВознаграждениямРаботникам) КАК СчетКтНУ,
    |   ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка) КАК СубконтоКтНУ1,
    |   НЕОПРЕДЕЛЕНО КАК СубконтоКтНУ2,
    |   НЕОПРЕДЕЛЕНО КАК СубконтоКтНУ3,
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ВР) КАК ВидУчетаДт,
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ВР) КАК ВидУчетаКт,
	// Дорофеева А. 17.01.2025 Кибернетика 
	// Подставим сюда налог, что б потом взялась статья затрат
	//|   НЕОПРЕДЕЛЕНО КАК ВидНалогаОтчисления,
	|   ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.СоциальныйНалог) КАК ВидНалогаОтчисления,
	// Дорофеева А. 10.01.2025 Кибернетика
    //|   ВЫРАЗИТЬ(ВТТаблицаРезервыОплатыТруда.Резерв КАК Справочник.Резервы).СтатьяЗатрат КАК СтатьяЗатрат
	|   &ФОТ КАК СтатьяЗатрат
	//****************
    |ПОМЕСТИТЬ ВТОтражениеРезервовОплатыТрудаВременнаяРазница
    |ИЗ
    |   ВТТаблицаРезервыОплатыТруда КАК ВТТаблицаРезервыОплатыТруда
    |ГДЕ
    |   &ВедениеУчетаВременныхРазницБалансовымМетодом
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |   ВТТаблицаРезервыОплатыТруда.Ссылка,
    |   ВТТаблицаРезервыОплатыТруда.НомерСтроки,
    |   ВТТаблицаРезервыОплатыТруда.Подразделение,
    |   ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПустаяСсылка),
    |   ВТТаблицаРезервыОплатыТруда.ФизическоеЛицо,
    |   ВТТаблицаРезервыОплатыТруда.СтруктурноеПодразделение,
    |   ВТТаблицаРезервыОплатыТруда.Резерв,
    |   ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПрочиеРасходы),
    // Дорофеева А. 10.01.2025 Кибернетика
    //|   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.СоциальныеОтчисления),
	|   &СоциальныеОтчисления,
	//****************,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ВТТаблицаРезервыОплатыТруда.СО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(ПланСчетов.Налоговый.КраткосрочныеОценочныеОбязательстваПоВознаграждениямРаботникам),
    |   ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ВР),
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ВР),
    |   НалогиСборыОтчисления.Ссылка,
    // Дорофеева А. 10.01.2025 Кибернетика
    //|   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.СоциальныеОтчисления)
	|   &СоциальныеОтчисления
	//****************
    |ИЗ
    |   ВТТаблицаРезервыОплатыТруда КАК ВТТаблицаРезервыОплатыТруда
    |       ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НалогиСборыОтчисления КАК НалогиСборыОтчисления
    |       ПО (НалогиСборыОтчисления.Ссылка = ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.ОбязательныеСоциальныеОтчисления))
    |ГДЕ
    |   &ВедениеУчетаВременныхРазницБалансовымМетодом
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |   ВТТаблицаРезервыОплатыТруда.Ссылка,
    |   ВТТаблицаРезервыОплатыТруда.НомерСтроки,
    |   ВТТаблицаРезервыОплатыТруда.Подразделение,
    |   ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПустаяСсылка),
    |   ВТТаблицаРезервыОплатыТруда.ФизическоеЛицо,
    |   ВТТаблицаРезервыОплатыТруда.СтруктурноеПодразделение,
    |   ВТТаблицаРезервыОплатыТруда.Резерв,
    |   ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПрочиеРасходы),
    // Дорофеева А. 10.01.2025 Кибернетика
    //|   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.СоциальныйНалог),
	|   &СоциальныйНалог,
	//****************
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ВТТаблицаРезервыОплатыТруда.СН,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(ПланСчетов.Налоговый.КраткосрочныеОценочныеОбязательстваПоВознаграждениямРаботникам),
    |   ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ВР),
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ВР),
    |   НалогиСборыОтчисления.Ссылка,
    // Дорофеева А. 10.01.2025 Кибернетика
    //|   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.СоциальныйНалог)
	|   &СоциальныйНалог
	//****************
    |ИЗ
    |   ВТТаблицаРезервыОплатыТруда КАК ВТТаблицаРезервыОплатыТруда
    |       ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НалогиСборыОтчисления КАК НалогиСборыОтчисления
    |       ПО (НалогиСборыОтчисления.Ссылка = ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.СоциальныйНалог))
    |ГДЕ
    |   &ВедениеУчетаВременныхРазницБалансовымМетодом
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |   ВТТаблицаРезервыОплатыТруда.Ссылка,
    |   ВТТаблицаРезервыОплатыТруда.НомерСтроки,
    |   ВТТаблицаРезервыОплатыТруда.Подразделение,
    |   ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПустаяСсылка),
    |   ВТТаблицаРезервыОплатыТруда.ФизическоеЛицо,
    |   ВТТаблицаРезервыОплатыТруда.СтруктурноеПодразделение,
    |   ВТТаблицаРезервыОплатыТруда.Резерв,
    |   ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПрочиеРасходы),
    // Дорофеева А. 10.01.2025 Кибернетика
    //|   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ОбязательныеПрофессиональныеПенсионныеВзносы),
	|   &ОбязательныеПрофессиональныеПенсионныеВзносы,
	//****************,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ВТТаблицаРезервыОплатыТруда.ОППВ,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(ПланСчетов.Налоговый.КраткосрочныеОценочныеОбязательстваПоВознаграждениямРаботникам),
    |   ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ВР),
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ВР),
    |   НалогиСборыОтчисления.Ссылка,
    // Дорофеева А. 10.01.2025 Кибернетика
    //|   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ОбязательныеПрофессиональныеПенсионныеВзносы)
	|   &ОбязательныеПрофессиональныеПенсионныеВзносы
	//****************
    |ИЗ
    |   ВТТаблицаРезервыОплатыТруда КАК ВТТаблицаРезервыОплатыТруда
    |       ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НалогиСборыОтчисления КАК НалогиСборыОтчисления
    |       ПО (НалогиСборыОтчисления.Ссылка = ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.ОбязательныеПрофессиональныеПенсионныеВзносы))
    |ГДЕ
    |   &ВедениеУчетаВременныхРазницБалансовымМетодом
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |   ВТТаблицаРезервыОплатыТруда.Ссылка,
    |   ВТТаблицаРезервыОплатыТруда.НомерСтроки,
    |   ВТТаблицаРезервыОплатыТруда.Подразделение,
    |   ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПустаяСсылка),
    |   ВТТаблицаРезервыОплатыТруда.ФизическоеЛицо,
    |   ВТТаблицаРезервыОплатыТруда.СтруктурноеПодразделение,
    |   ВТТаблицаРезервыОплатыТруда.Резерв,
    |   ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПрочиеРасходы),
    // Дорофеева А. 10.01.2025 Кибернетика
    //|   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ОбязательныеПенсионныеВзносыРаботодателя),
	|   &ОбязательныеПенсионныеВзносыРаботодателя,
	//****************,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ВТТаблицаРезервыОплатыТруда.ОПВР,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(ПланСчетов.Налоговый.КраткосрочныеОценочныеОбязательстваПоВознаграждениямРаботникам),
    |   ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ВР),
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ВР),
    |   НалогиСборыОтчисления.Ссылка,
    // Дорофеева А. 10.01.2025 Кибернетика
    //|   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ОбязательныеПенсионныеВзносыРаботодателя)
	|   &ОбязательныеПенсионныеВзносыРаботодателя
	//****************
    |ИЗ
    |   ВТТаблицаРезервыОплатыТруда КАК ВТТаблицаРезервыОплатыТруда
	// Дорофеева А. 10.01.2025 Кибернетика
	|       ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НалогиСборыОтчисления КАК НалогиСборыОтчисления
	|       ПО (НалогиСборыОтчисления.Ссылка = ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.ОбязательныеПенсионныеВзносыРаботодателя))
	//****************
    |ГДЕ
    |   &ВедениеУчетаВременныхРазницБалансовымМетодом 
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |   ВТТаблицаРезервыОплатыТруда.Ссылка,
    |   ВТТаблицаРезервыОплатыТруда.НомерСтроки,
    |   ВТТаблицаРезервыОплатыТруда.Подразделение,
    |   ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПустаяСсылка),
    |   ВТТаблицаРезервыОплатыТруда.ФизическоеЛицо,
    |   ВТТаблицаРезервыОплатыТруда.СтруктурноеПодразделение,
    |   ВТТаблицаРезервыОплатыТруда.Резерв,
    |   ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПрочиеРасходы),
    // Дорофеева А. 10.01.2025 Кибернетика
    //|   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ОтчисленияОСМС),
	|   &ОтчисленияОСМС,
	//****************,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ВТТаблицаРезервыОплатыТруда.ООСМС,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ВЫБОР
    |       КОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.КраткосрочныеОценочныеОбязательстваПоВознаграждениямРаботникам) КАК ПланСчетов.Типовой).СчетНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяСсылка)
    |           ТОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.КраткосрочныеОценочныеОбязательстваПоВознаграждениямРаботникам) КАК ПланСчетов.Типовой).СчетНУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Налоговый.КраткосрочныеОценочныеОбязательстваПоВознаграждениямРаботникам)
    |   КОНЕЦ,
    |   ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка),
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ВР),
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ВР),
    |   НалогиСборыОтчисления.Ссылка,
    // Дорофеева А. 10.01.2025 Кибернетика
    //|   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ОтчисленияОСМС)
	|   &ОтчисленияОСМС
	//****************
    |ИЗ
    |   ВТТаблицаРезервыОплатыТруда КАК ВТТаблицаРезервыОплатыТруда
    |       ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НалогиСборыОтчисления КАК НалогиСборыОтчисления
    |       ПО (НалогиСборыОтчисления.Ссылка = ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.ОтчисленияОбязательноеСоциальноеМедицинскоеСтрахование))
    |ГДЕ
    |   &ВедениеУчетаВременныхРазницБалансовымМетодом
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |   ВТТаблицаРезервыОплатыТруда.Ссылка КАК Ссылка,
    |   ВТТаблицаРезервыОплатыТруда.НомерСтроки КАК НомерСтроки,
    |   ВТТаблицаРезервыОплатыТруда.Подразделение КАК Подразделение,
    |   ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПустаяСсылка) КАК ВидОперации,
    |   ВТТаблицаРезервыОплатыТруда.ФизическоеЛицо КАК ФизическоеЛицо,
    |   ВТТаблицаРезервыОплатыТруда.СтруктурноеПодразделение КАК СтруктурноеПодразделение,
    |   ВТТаблицаРезервыОплатыТруда.Резерв КАК Резерв,
    |   ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Контрагент,
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.ПустаяСсылка) КАК ВидПлатежа,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |           ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1
    |       ИНАЧЕ ВТТаблицаРезервыОплатыТруда.Подразделение
    |   КОНЕЦ КАК ПодразделениеБУ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |           ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоНУ1
    |       ИНАЧЕ ВТТаблицаРезервыОплатыТруда.Подразделение
    |   КОНЕЦ КАК ПодразделениеНУ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы)
    |   КОНЕЦ КАК СчетДт,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка)
    |   КОНЕЦ КАК СубконтоДт1,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
    |   КОНЕЦ КАК СубконтоДт2,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ КАК СубконтоДт3,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетНУ
    |       КОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы) КАК ПланСчетов.Типовой).СчетНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяСсылка)
    |           ТОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы) КАК ПланСчетов.Типовой).СчетНУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ОбщиеИАдминистративныеРасходы)
    |   КОНЕЦ КАК СчетДтНУ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоНУ1
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка)
    |   КОНЕЦ КАК СубконтоДтНУ1,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоНУ2
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
    |   КОНЕЦ КАК СубконтоДтНУ2,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоНУ3
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ КАК СубконтоДтНУ3,
    |   ВТТаблицаРезервыОплатыТруда.Сумма КАК Сумма,
    |   ЗНАЧЕНИЕ(ПланСчетов.Типовой.КраткосрочныеОценочныеОбязательстваПоВознаграждениямРаботникам) КАК СчетКт,
    |   ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка) КАК СубконтоКт1, 
	// Дорофеева А. 10.01.2025 Кибернетика
	//|   ВЫБОР
	//|       КОГДА НЕ &ВедениеУчетаПоСотрудникам
	//|           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	//|       ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|   КОНЕЦ КАК СубконтоКт2,
    //|   НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка) КАК СубконтоКт2,
	|   ВЫБОР
    |       КОГДА НЕ &ВедениеУчетаПоСотрудникам
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ КАК СубконтоКт3,
	//*************
    |   ВЫБОР
    |       КОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПрочиеРасходы) КАК ПланСчетов.Типовой).СчетНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяСсылка)
    |           ТОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПрочиеРасходы) КАК ПланСчетов.Типовой).СчетНУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПрочиеРасходы)
    |   КОНЕЦ КАК СчетКтНУ,
    |   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка) КАК СубконтоКтНУ1,
    |   НЕОПРЕДЕЛЕНО КАК СубконтоКтНУ2,
    |   НЕОПРЕДЕЛЕНО КАК СубконтоКтНУ3,
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка) КАК ВидУчетаДт,
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка) КАК ВидУчетаКт,
	// Дорофеева А. 17.01.2025 Кибернетика 
	// Подставим сюда налог, что б потом взялась статья затрат
	//|   НЕОПРЕДЕЛЕНО КАК ВидНалогаОтчисления,
	|   ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.СоциальныйНалог) КАК ВидНалогаОтчисления,
    // Дорофеева А. 10.01.2025 Кибернетика
	//|   ВЫРАЗИТЬ(ВТТаблицаРезервыОплатыТруда.Резерв КАК Справочник.Резервы).СтатьяЗатрат КАК СтатьяЗатрат
	|   &ФОТ КАК СтатьяЗатрат
	//*****************
    |ПОМЕСТИТЬ ВТТаблицаОтражениеРезервовОплатыТрудаПоПроизводственнымСчетам
    |ИЗ
    |   ВТТаблицаРезервыОплатыТруда КАК ВТТаблицаРезервыОплатыТруда
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |   ВТТаблицаРезервыОплатыТруда.Ссылка,
    |   ВТТаблицаРезервыОплатыТруда.НомерСтроки,
    |   ВТТаблицаРезервыОплатыТруда.Подразделение,
    |   ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПустаяСсылка),
    |   ВТТаблицаРезервыОплатыТруда.ФизическоеЛицо,
    |   ВТТаблицаРезервыОплатыТруда.СтруктурноеПодразделение,
    |   ВТТаблицаРезервыОплатыТруда.Резерв,
    |   ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.ПустаяСсылка),
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |           ТОГДА ВЫБОР
    |                   КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1
    |                   КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2
    |                   КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3
    |                   ИНАЧЕ ВТТаблицаРезервыОплатыТруда.Подразделение
    |               КОНЕЦ
    |       ИНАЧЕ ВТТаблицаРезервыОплатыТруда.Подразделение
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |           ТОГДА ВЫБОР
    |                   КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоНУ1 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоНУ1
    |                   КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоНУ2 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоНУ2
    |                   КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоНУ3 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоНУ3
    |                   ИНАЧЕ ВТТаблицаРезервыОплатыТруда.Подразделение
    |               КОНЕЦ
    |       ИНАЧЕ ВТТаблицаРезервыОплатыТруда.Подразделение
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетНУ
    |       КОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы) КАК ПланСчетов.Типовой).СчетНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяСсылка)
    |           ТОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы) КАК ПланСчетов.Типовой).СчетНУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ОбщиеИАдминистративныеРасходы)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоНУ1
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоНУ2
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоНУ3
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   ВТТаблицаРезервыОплатыТруда.СО,
    |   ЗНАЧЕНИЕ(ПланСчетов.Типовой.КраткосрочныеОценочныеОбязательстваПоВознаграждениямРаботникам),
    |   ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка), 
	// Дорофеева А. 10.01.2025 Кибернетика
	//|   ВЫБОР
	//|       КОГДА НЕ &ВедениеУчетаПоСотрудникам
	//|           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	//|       ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|   КОНЕЦ,
    //|   НЕОПРЕДЕЛЕНО,
	|   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка), 
	|   ВЫБОР
    |       КОГДА НЕ &ВедениеУчетаПоСотрудникам
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
	//*************
    |   ВЫБОР
    |       КОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПрочиеРасходы) КАК ПланСчетов.Типовой).СчетНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяСсылка)
    |           ТОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПрочиеРасходы) КАК ПланСчетов.Типовой).СчетНУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПрочиеРасходы)
    |   КОНЕЦ,
    // Дорофеева А. 10.01.2025 Кибернетика
    //|   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.СоциальныеОтчисления),
	|   &СоциальныеОтчисления,
	//****************
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка),
    |   НалогиСборыОтчисления.Ссылка,
    // Дорофеева А. 10.01.2025 Кибернетика
    //|   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.СоциальныеОтчисления)
	|   &СоциальныеОтчисления
	//****************
    |ИЗ
    |   ВТТаблицаРезервыОплатыТруда КАК ВТТаблицаРезервыОплатыТруда
    |       ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НалогиСборыОтчисления КАК НалогиСборыОтчисления
    |       ПО (НалогиСборыОтчисления.Ссылка = ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.ОбязательныеСоциальныеОтчисления))
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |   ВТТаблицаРезервыОплатыТруда.Ссылка,
    |   ВТТаблицаРезервыОплатыТруда.НомерСтроки,
    |   ВТТаблицаРезервыОплатыТруда.Подразделение,
    |   ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПустаяСсылка),
    |   ВТТаблицаРезервыОплатыТруда.ФизическоеЛицо,
    |   ВТТаблицаРезервыОплатыТруда.СтруктурноеПодразделение,
    |   ВТТаблицаРезервыОплатыТруда.Резерв,
    |   ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.ПустаяСсылка),
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |           ТОГДА ВЫБОР
    |                   КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1
    |                   КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2
    |                   КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3
    |                   ИНАЧЕ ВТТаблицаРезервыОплатыТруда.Подразделение
    |               КОНЕЦ
    |       ИНАЧЕ ВТТаблицаРезервыОплатыТруда.Подразделение
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |           ТОГДА ВЫБОР
    |                   КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоНУ1 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоНУ1
    |                   КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоНУ2 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоНУ2
    |                   КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоНУ3 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоНУ3
    |                   ИНАЧЕ ВТТаблицаРезервыОплатыТруда.Подразделение
    |               КОНЕЦ
    |       ИНАЧЕ ВТТаблицаРезервыОплатыТруда.Подразделение
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетНУ
    |       КОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы) КАК ПланСчетов.Типовой).СчетНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяСсылка)
    |           ТОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы) КАК ПланСчетов.Типовой).СчетНУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ОбщиеИАдминистративныеРасходы)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоНУ1
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоНУ2
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоНУ3
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   ВТТаблицаРезервыОплатыТруда.СН,
    |   ЗНАЧЕНИЕ(ПланСчетов.Типовой.КраткосрочныеОценочныеОбязательстваПоВознаграждениямРаботникам),
    |   ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка),
    // Дорофеева А. 10.01.2025 Кибернетика
	//|   ВЫБОР
	//|       КОГДА НЕ &ВедениеУчетаПоСотрудникам
	//|           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	//|       ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|   КОНЕЦ,
    //|   НЕОПРЕДЕЛЕНО,
	|   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка),
	|   ВЫБОР
    |       КОГДА НЕ &ВедениеУчетаПоСотрудникам
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
	//*************
    |   ВЫБОР
    |       КОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПрочиеРасходы) КАК ПланСчетов.Типовой).СчетНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяСсылка)
    |           ТОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПрочиеРасходы) КАК ПланСчетов.Типовой).СчетНУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПрочиеРасходы)
    |   КОНЕЦ,
    // Дорофеева А. 10.01.2025 Кибернетика
    //|   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.СоциальныйНалог),
	|   &СоциальныйНалог,
	//****************,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка),
    |   НалогиСборыОтчисления.Ссылка,
    // Дорофеева А. 10.01.2025 Кибернетика
    //|   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.СоциальныйНалог)
	|   &СоциальныйНалог
	//****************
    |ИЗ
    |   ВТТаблицаРезервыОплатыТруда КАК ВТТаблицаРезервыОплатыТруда
    |       ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НалогиСборыОтчисления КАК НалогиСборыОтчисления
    |       ПО (НалогиСборыОтчисления.Ссылка = ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.СоциальныйНалог))
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |   ВТТаблицаРезервыОплатыТруда.Ссылка,
    |   ВТТаблицаРезервыОплатыТруда.НомерСтроки,
    |   ВТТаблицаРезервыОплатыТруда.Подразделение,
    |   ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПустаяСсылка),
    |   ВТТаблицаРезервыОплатыТруда.ФизическоеЛицо,
    |   ВТТаблицаРезервыОплатыТруда.СтруктурноеПодразделение,
    |   ВТТаблицаРезервыОплатыТруда.Резерв,
    |   ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.ПустаяСсылка),
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |           ТОГДА ВЫБОР
    |                   КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1
    |                   КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2
    |                   КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3
    |                   ИНАЧЕ ВТТаблицаРезервыОплатыТруда.Подразделение
    |               КОНЕЦ
    |       ИНАЧЕ ВТТаблицаРезервыОплатыТруда.Подразделение
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |           ТОГДА ВЫБОР
    |                   КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоНУ1 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоНУ1
    |                   КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоНУ2 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоНУ2
    |                   КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоНУ3 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоНУ3
    |                   ИНАЧЕ ВТТаблицаРезервыОплатыТруда.Подразделение
    |               КОНЕЦ
    |       ИНАЧЕ ВТТаблицаРезервыОплатыТруда.Подразделение
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетНУ
    |       КОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы) КАК ПланСчетов.Типовой).СчетНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяСсылка)
    |           ТОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы) КАК ПланСчетов.Типовой).СчетНУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ОбщиеИАдминистративныеРасходы)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоНУ1
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоНУ2
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоНУ3
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   ВТТаблицаРезервыОплатыТруда.ОППВ,
    |   ЗНАЧЕНИЕ(ПланСчетов.Типовой.КраткосрочныеОценочныеОбязательстваПоВознаграждениямРаботникам),
    |   ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка),
    // Дорофеева А. 10.01.2025 Кибернетика
	//|   ВЫБОР
	//|       КОГДА НЕ &ВедениеУчетаПоСотрудникам
	//|           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	//|       ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|   КОНЕЦ,
    //|   НЕОПРЕДЕЛЕНО,
	|   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка),
	|   ВЫБОР
    |       КОГДА НЕ &ВедениеУчетаПоСотрудникам
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
	//*************
    |   ВЫБОР
    |       КОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПрочиеРасходы) КАК ПланСчетов.Типовой).СчетНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяСсылка)
    |           ТОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПрочиеРасходы) КАК ПланСчетов.Типовой).СчетНУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПрочиеРасходы)
    |   КОНЕЦ,
    // Дорофеева А. 10.01.2025 Кибернетика
    //|   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ОбязательныеПрофессиональныеПенсионныеВзносы),
	|   &ОбязательныеПрофессиональныеПенсионныеВзносы,
	//****************,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка),
    |   НалогиСборыОтчисления.Ссылка,
    // Дорофеева А. 10.01.2025 Кибернетика
    //|   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ОбязательныеПрофессиональныеПенсионныеВзносы)
	|   &ОбязательныеПрофессиональныеПенсионныеВзносы
	//****************
    |ИЗ
    |   ВТТаблицаРезервыОплатыТруда КАК ВТТаблицаРезервыОплатыТруда
    |       ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НалогиСборыОтчисления КАК НалогиСборыОтчисления
    |       ПО (НалогиСборыОтчисления.Ссылка = ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.ОбязательныеПрофессиональныеПенсионныеВзносы))
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |   ВТТаблицаРезервыОплатыТруда.Ссылка,
    |   ВТТаблицаРезервыОплатыТруда.НомерСтроки,
    |   ВТТаблицаРезервыОплатыТруда.Подразделение,
    |   ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПустаяСсылка),
    |   ВТТаблицаРезервыОплатыТруда.ФизическоеЛицо,
    |   ВТТаблицаРезервыОплатыТруда.СтруктурноеПодразделение,
    |   ВТТаблицаРезервыОплатыТруда.Резерв,
    |   ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.ПустаяСсылка),
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |           ТОГДА ВЫБОР
    |                   КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1
    |                   КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2
    |                   КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3
    |                   ИНАЧЕ ВТТаблицаРезервыОплатыТруда.Подразделение
    |               КОНЕЦ
    |       ИНАЧЕ ВТТаблицаРезервыОплатыТруда.Подразделение
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |           ТОГДА ВЫБОР
    |                   КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоНУ1 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоНУ1
    |                   КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоНУ2 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоНУ2
    |                   КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоНУ3 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоНУ3
    |                   ИНАЧЕ ВТТаблицаРезервыОплатыТруда.Подразделение
    |               КОНЕЦ
    |       ИНАЧЕ ВТТаблицаРезервыОплатыТруда.Подразделение
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетНУ
    |       КОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы) КАК ПланСчетов.Типовой).СчетНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяСсылка)
    |           ТОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы) КАК ПланСчетов.Типовой).СчетНУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ОбщиеИАдминистративныеРасходы)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоНУ1
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоНУ2
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоНУ3
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   ВТТаблицаРезервыОплатыТруда.ОПВР,
    |   ЗНАЧЕНИЕ(ПланСчетов.Типовой.КраткосрочныеОценочныеОбязательстваПоВознаграждениямРаботникам),
    |   ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка),
    // Дорофеева А. 10.01.2025 Кибернетика
	//|   ВЫБОР
	//|       КОГДА НЕ &ВедениеУчетаПоСотрудникам
	//|           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	//|       ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|   КОНЕЦ,
    //|   НЕОПРЕДЕЛЕНО,
	|   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка), 
	|   ВЫБОР
    |       КОГДА НЕ &ВедениеУчетаПоСотрудникам
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
	//*************
    |   ВЫБОР
    |       КОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПрочиеРасходы) КАК ПланСчетов.Типовой).СчетНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяСсылка)
    |           ТОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПрочиеРасходы) КАК ПланСчетов.Типовой).СчетНУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПрочиеРасходы)
    |   КОНЕЦ,
    // Дорофеева А. 10.01.2025 Кибернетика
    //|   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ОбязательныеПенсионныеВзносыРаботодателя),
	|   &ОбязательныеПенсионныеВзносыРаботодателя,
	//****************,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка),
    |   НалогиСборыОтчисления.Ссылка,
    // Дорофеева А. 10.01.2025 Кибернетика
    //|   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ОбязательныеПенсионныеВзносыРаботодателя)
	|   &ОбязательныеПенсионныеВзносыРаботодателя
	//****************
    |ИЗ
	|   ВТТаблицаРезервыОплатыТруда КАК ВТТаблицаРезервыОплатыТруда
	// Дорофеева А. 10.01.2025 Кибернетика
	|       ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НалогиСборыОтчисления КАК НалогиСборыОтчисления
	|       ПО (НалогиСборыОтчисления.Ссылка = ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.ОбязательныеПенсионныеВзносыРаботодателя))
	//****************
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |   ВТТаблицаРезервыОплатыТруда.Ссылка,
    |   ВТТаблицаРезервыОплатыТруда.НомерСтроки,
    |   ВТТаблицаРезервыОплатыТруда.Подразделение,
    |   ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПустаяСсылка),
    |   ВТТаблицаРезервыОплатыТруда.ФизическоеЛицо,
    |   ВТТаблицаРезервыОплатыТруда.СтруктурноеПодразделение,
    |   ВТТаблицаРезервыОплатыТруда.Резерв,
    |   ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.ПустаяСсылка),
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |           ТОГДА ВЫБОР
    |                   КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1
    |                   КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2
    |                   КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3
    |                   ИНАЧЕ ВТТаблицаРезервыОплатыТруда.Подразделение
    |               КОНЕЦ
    |       ИНАЧЕ ВТТаблицаРезервыОплатыТруда.Подразделение
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |           ТОГДА ВЫБОР
    |                   КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоНУ1 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоНУ1
    |                   КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоНУ2 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоНУ2
    |                   КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоНУ3 ССЫЛКА Справочник.ПодразделенияОрганизаций
    |                       ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоНУ3
    |                   ИНАЧЕ ВТТаблицаРезервыОплатыТруда.Подразделение
    |               КОНЕЦ
    |       ИНАЧЕ ВТТаблицаРезервыОплатыТруда.Подразделение
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ1
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ2
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоБУ3
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетНУ
    |       КОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы) КАК ПланСчетов.Типовой).СчетНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяСсылка)
    |           ТОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.АдминистративныеРасходы) КАК ПланСчетов.Типовой).СчетНУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ОбщиеИАдминистративныеРасходы)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоНУ1
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоНУ2
    |       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете <> &парамПустойСпособБУ
    |               И ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СчетБУ <> &парамПустойСчет
    |           ТОГДА ВТТаблицаРезервыОплатыТруда.СпособОтраженияЗарплатыВБухучете.СубконтоНУ3
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
    |   ВТТаблицаРезервыОплатыТруда.ООСМС,
    |   ЗНАЧЕНИЕ(ПланСчетов.Типовой.КраткосрочныеОценочныеОбязательстваПоВознаграждениямРаботникам),
    |   ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка),
    // Дорофеева А. 10.01.2025 Кибернетика
	//|   ВЫБОР
	//|       КОГДА НЕ &ВедениеУчетаПоСотрудникам
	//|           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	//|       ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|   КОНЕЦ,
    //|   НЕОПРЕДЕЛЕНО,
	|   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка),
	|   ВЫБОР
    |       КОГДА НЕ &ВедениеУчетаПоСотрудникам
    |           ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
    |       ИНАЧЕ НЕОПРЕДЕЛЕНО
    |   КОНЕЦ,
	//*************
    |   ВЫБОР
    |       КОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПрочиеРасходы) КАК ПланСчетов.Типовой).СчетНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяСсылка)
    |           ТОГДА ВЫРАЗИТЬ(ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПрочиеРасходы) КАК ПланСчетов.Типовой).СчетНУ
    |       ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПрочиеРасходы)
    |   КОНЕЦ,
    // Дорофеева А. 10.01.2025 Кибернетика
    //|   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ОтчисленияОСМС),
	|   &ОтчисленияОСМС,
	//****************,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО,
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка),
    |   ЗНАЧЕНИЕ(Справочник.ВидыУчетаНУ.ПустаяСсылка),
    |   НалогиСборыОтчисления.Ссылка,
    // Дорофеева А. 10.01.2025 Кибернетика
    //|   ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ОтчисленияОСМС)
	|   &ОтчисленияОСМС
	//****************
    |ИЗ
    |   ВТТаблицаРезервыОплатыТруда КАК ВТТаблицаРезервыОплатыТруда
    |       ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НалогиСборыОтчисления КАК НалогиСборыОтчисления
    |       ПО (НалогиСборыОтчисления.Ссылка = ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.ОтчисленияОбязательноеСоциальноеМедицинскоеСтрахование))
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |   ВТТаблицаОтражениеРезервовОплатыТрудаПоПроизводственнымСчетам.Ссылка КАК Ссылка,
    |   ВТТаблицаОтражениеРезервовОплатыТрудаПоПроизводственнымСчетам.НомерСтроки КАК НомерСтроки,
    |   ВТТаблицаОтражениеРезервовОплатыТрудаПоПроизводственнымСчетам.Подразделение КАК Подразделение,
    |   ВТТаблицаОтражениеРезервовОплатыТрудаПоПроизводственнымСчетам.ВидОперации КАК ВидОперации,
    |   ВТТаблицаОтражениеРезервовОплатыТрудаПоПроизводственнымСчетам.ФизическоеЛицо КАК ФизическоеЛицо,
    |   ВТТаблицаОтражениеРезервовОплатыТрудаПоПроизводственнымСчетам.СтруктурноеПодразделение КАК СтруктурноеПодразделение,
    |   ВТТаблицаОтражениеРезервовОплатыТрудаПоПроизводственнымСчетам.Резерв КАК Резерв,
    |   ВТТаблицаОтражениеРезервовОплатыТрудаПоПроизводственнымСчетам.Контрагент КАК Контрагент,
    |   ВТТаблицаОтражениеРезервовОплатыТрудаПоПроизводственнымСчетам.ВидПлатежа КАК ВидПлатежа,
    |   ВТТаблицаОтражениеРезервовОплатыТрудаПоПроизводственнымСчетам.СчетДт КАК СчетДт,
    |   ВТТаблицаОтражениеРезервовОплатыТрудаПоПроизводственнымСчетам.СубконтоДт1 КАК СубконтоДт1,
    |   ВТТаблицаОтражениеРезервовОплатыТрудаПоПроизводственнымСчетам.СубконтоДт2 КАК СубконтоДт2,
    |   ВТТаблицаОтражениеРезервовОплатыТрудаПоПроизводственнымСчетам.СубконтоДт3 КАК СубконтоДт3,
    |   ВТТаблицаОтражениеРезервовОплатыТрудаПоПроизводственнымСчетам.СчетДтНУ КАК СчетДтНУ,
    |   ВТТаблицаОтражениеРезервовОплатыТрудаПоПроизводственнымСчетам.СубконтоДтНУ1 КАК СубконтоДтНУ1,
    |   ВТТаблицаОтражениеРезервовОплатыТрудаПоПроизводственнымСчетам.СубконтоДтНУ2 КАК СубконтоДтНУ2,
    |   ВТТаблицаОтражениеРезервовОплатыТрудаПоПроизводственнымСчетам.СубконтоДтНУ3 КАК СубконтоДтНУ3,
    |   ВТТаблицаОтражениеРезервовОплатыТрудаПоПроизводственнымСчетам.Сумма КАК Сумма,
    |   ВТТаблицаОтражениеРезервовОплатыТрудаПоПроизводственнымСчетам.СчетКт КАК СчетКт,
    |   ВТТаблицаОтражениеРезервовОплатыТрудаПоПроизводственнымСчетам.СубконтоКт1 КАК СубконтоКт1,
    |   ВТТаблицаОтражениеРезервовОплатыТрудаПоПроизводственнымСчетам.СубконтоКт2 КАК СубконтоКт2,
    |   ВТТаблицаОтражениеРезервовОплатыТрудаПоПроизводственнымСчетам.СубконтоКт3 КАК СубконтоКт3,
    |   ВТТаблицаОтражениеРезервовОплатыТрудаПоПроизводственнымСчетам.СчетКтНУ КАК СчетКтНУ,
    |   ВТТаблицаОтражениеРезервовОплатыТрудаПоПроизводственнымСчетам.СубконтоКтНУ1 КАК СубконтоКтНУ1,
    |   ВТТаблицаОтражениеРезервовОплатыТрудаПоПроизводственнымСчетам.СубконтоКтНУ2 КАК СубконтоКтНУ2,
    |   ВТТаблицаОтражениеРезервовОплатыТрудаПоПроизводственнымСчетам.СубконтоКтНУ3 КАК СубконтоКтНУ3,
    |   ВТТаблицаОтражениеРезервовОплатыТрудаПоПроизводственнымСчетам.ВидУчетаДт КАК ВидУчетаДт,
    |   ВТТаблицаОтражениеРезервовОплатыТрудаПоПроизводственнымСчетам.ВидУчетаКт КАК ВидУчетаКт,
    |   ВТТаблицаОтражениеРезервовОплатыТрудаПоПроизводственнымСчетам.ВидНалогаОтчисления КАК ВидНалогаОтчисления,
    |   ВТТаблицаОтражениеРезервовОплатыТрудаПоПроизводственнымСчетам.СтатьяЗатрат КАК СтатьяЗатрат,
    |   ВТТаблицаОтражениеРезервовОплатыТрудаПоПроизводственнымСчетам.ПодразделениеБУ КАК ПодразделениеБУ,
    |   ВТТаблицаОтражениеРезервовОплатыТрудаПоПроизводственнымСчетам.ПодразделениеНУ КАК ПодразделениеНУ,
    |   НЕОПРЕДЕЛЕНО КАК КонтрагентОтправитель,
    |   НЕОПРЕДЕЛЕНО КАК РаботникОрганизации
    |ПОМЕСТИТЬ ТаблицаОтражениеВУчете
    |ИЗ
    |   ВТТаблицаОтражениеРезервовОплатыТрудаПоПроизводственнымСчетам КАК ВТТаблицаОтражениеРезервовОплатыТрудаПоПроизводственнымСчетам
    |ГДЕ
    |   ВТТаблицаОтражениеРезервовОплатыТрудаПоПроизводственнымСчетам.Сумма <> 0
    |   И ВТТаблицаОтражениеРезервовОплатыТрудаПоПроизводственнымСчетам.СчетДт В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Типовой.ОсновноеПроизводство_), ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПолуфабрикатыСобственногоПроизводства_), ЗНАЧЕНИЕ(ПланСчетов.Типовой.ВспомогательныеПроизводства_), ЗНАЧЕНИЕ(ПланСчетов.Типовой.НакладныеРасходы_))
    |   И ВТТаблицаОтражениеРезервовОплатыТрудаПоПроизводственнымСчетам.СчетДтНУ В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ОсновноеПроизводство_), ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПолуфабрикатыСобственногоПроизводства), ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ВспомогательныеПроизводства), ЗНАЧЕНИЕ(ПланСчетов.Налоговый.НакладныеРасходы))
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |   ВТОтражениеВременнаяРазница.Ссылка,
    |   ВТОтражениеВременнаяРазница.НомерСтроки,
    |   ВТОтражениеВременнаяРазница.Подразделение,
    |   ВТОтражениеВременнаяРазница.ВидОперации,
    |   ВТОтражениеВременнаяРазница.ФизическоеЛицо,
    |   ВТОтражениеВременнаяРазница.СтруктурноеПодразделение,
    |   ВТОтражениеВременнаяРазница.Резерв,
    |   ВТОтражениеВременнаяРазница.Контрагент,
    |   ВТОтражениеВременнаяРазница.ВидПлатежа,
    |   ВТОтражениеВременнаяРазница.СчетДт,
    |   ВТОтражениеВременнаяРазница.СубконтоДт1,
    |   ВТОтражениеВременнаяРазница.СубконтоДт2,
    |   ВТОтражениеВременнаяРазница.СубконтоДт3,
    |   ВТОтражениеВременнаяРазница.СчетДтНУ,
    |   ВТОтражениеВременнаяРазница.СубконтоДтНУ1,
    |   ВТОтражениеВременнаяРазница.СубконтоДтНУ2,
    |   ВТОтражениеВременнаяРазница.СубконтоДтНУ3,
    |   ВТОтражениеВременнаяРазница.Сумма,
    |   ВТОтражениеВременнаяРазница.СчетКт,
    |   ВТОтражениеВременнаяРазница.СубконтоКт1,
    |   ВТОтражениеВременнаяРазница.СубконтоКт2,
    |   ВТОтражениеВременнаяРазница.СубконтоКт3,
    |   ВТОтражениеВременнаяРазница.СчетКтНУ,
    |   ВТОтражениеВременнаяРазница.СубконтоКтНУ1,
    |   ВТОтражениеВременнаяРазница.СубконтоКтНУ2,
    |   ВТОтражениеВременнаяРазница.СубконтоКтНУ3,
    |   ВТОтражениеВременнаяРазница.ВидУчетаДт,
    |   ВТОтражениеВременнаяРазница.ВидУчетаКт,
    |   ВТОтражениеВременнаяРазница.ВидНалогаОтчисления,
    |   ВТОтражениеВременнаяРазница.СтатьяЗатрат,
    |   ВТОтражениеВременнаяРазница.ПодразделениеБУ,
    |   ВТОтражениеВременнаяРазница.ПодразделениеНУ,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО
    |ИЗ
    |   ВТОтражениеРезервовОплатыТрудаВременнаяРазница КАК ВТОтражениеВременнаяРазница
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |   ВТОтражениеОценочныеОбязательства.Ссылка,
    |   ВТОтражениеОценочныеОбязательства.НомерСтроки,
    |   ВТОтражениеОценочныеОбязательства.Подразделение,
    |   ВТОтражениеОценочныеОбязательства.ВидОперации,
    |   ВТОтражениеОценочныеОбязательства.ФизическоеЛицо,
    |   ВТОтражениеОценочныеОбязательства.СтруктурноеПодразделение,
    |   ВТОтражениеОценочныеОбязательства.Резерв,
    |   ВТОтражениеОценочныеОбязательства.Контрагент,
    |   ВТОтражениеОценочныеОбязательства.ВидПлатежа,
    |   ВТОтражениеОценочныеОбязательства.СчетДт,
    |   ВТОтражениеОценочныеОбязательства.СубконтоДт1,
    |   ВТОтражениеОценочныеОбязательства.СубконтоДт2,
    |   ВТОтражениеОценочныеОбязательства.СубконтоДт3,
    |   ВТОтражениеОценочныеОбязательства.СчетДтНУ,
    |   ВТОтражениеОценочныеОбязательства.СубконтоДтНУ1,
    |   ВТОтражениеОценочныеОбязательства.СубконтоДтНУ2,
    |   ВТОтражениеОценочныеОбязательства.СубконтоДтНУ3,
    |   ВТОтражениеОценочныеОбязательства.Сумма,
    |   ВТОтражениеОценочныеОбязательства.СчетКт,
    |   ВТОтражениеОценочныеОбязательства.СубконтоКт1,
    |   ВТОтражениеОценочныеОбязательства.СубконтоКт2,
    |   ВТОтражениеОценочныеОбязательства.СубконтоКт3,
    |   ВТОтражениеОценочныеОбязательства.СчетКтНУ,
    |   ВТОтражениеОценочныеОбязательства.СубконтоКтНУ1,
    |   ВТОтражениеОценочныеОбязательства.СубконтоКтНУ2,
    |   ВТОтражениеОценочныеОбязательства.СубконтоКтНУ3,
    |   ВТОтражениеОценочныеОбязательства.ВидУчетаДт,
    |   ВТОтражениеОценочныеОбязательства.ВидУчетаКт,
    |   ВТОтражениеОценочныеОбязательства.ВидНалогаОтчисления,
    |   ВТОтражениеОценочныеОбязательства.СтатьяЗатрат,
    |   ВТОтражениеОценочныеОбязательства.ПодразделениеБУ,
    |   ВТОтражениеОценочныеОбязательства.ПодразделениеНУ,
    |   НЕОПРЕДЕЛЕНО,
    |   НЕОПРЕДЕЛЕНО
    |ИЗ
    |   ВТОтражениеРезервовОплатыТруда КАК ВТОтражениеОценочныеОбязательства
    |ГДЕ
    |   НЕ ВТОтражениеОценочныеОбязательства.СчетДт В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Типовой.ОсновноеПроизводство_), ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПолуфабрикатыСобственногоПроизводства_), ЗНАЧЕНИЕ(ПланСчетов.Типовой.ВспомогательныеПроизводства_), ЗНАЧЕНИЕ(ПланСчетов.Типовой.НакладныеРасходы_))
    |   И НЕ ВТОтражениеОценочныеОбязательства.СчетДтНУ В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ОсновноеПроизводство_), ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПолуфабрикатыСобственногоПроизводства), ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ВспомогательныеПроизводства), ЗНАЧЕНИЕ(ПланСчетов.Налоговый.НакладныеРасходы))
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
	//Сухомлинов++  киб_Участок
	|   ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК киб_Участок,
	//Сухомлинов--  киб_Участок
	|   ТаблицаОтражениеВУчете.Ссылка КАК Ссылка,
    |   ТаблицаОтражениеВУчете.НомерСтроки КАК НомерСтроки,
    |   ТаблицаОтражениеВУчете.Подразделение КАК Подразделение,
    |   ТаблицаОтражениеВУчете.ВидОперации КАК ВидОперации,
    |   ТаблицаОтражениеВУчете.ФизическоеЛицо КАК ФизическоеЛицо,
    |   ВЫБОР
    |       КОГДА &ПоддержкаРаботыСоСтруктурнымиПодразделениями
    |               И ТаблицаОтражениеВУчете.СтруктурноеПодразделение.ЯвляетсяСтруктурнымПодразделением
    |           ТОГДА ТаблицаОтражениеВУчете.СтруктурноеПодразделение
    |       ИНАЧЕ &ПустоеПодразделение
    |   КОНЕЦ КАК СтруктурноеПодразделение,
    |   ТаблицаОтражениеВУчете.Резерв КАК Резерв,
    |   ТаблицаОтражениеВУчете.Контрагент КАК Контрагент,
    |   ТаблицаОтражениеВУчете.ВидПлатежа КАК ВидПлатежа,
    |   ТаблицаОтражениеВУчете.СчетДт КАК СчетДт,
    |   ТаблицаОтражениеВУчете.СубконтоДт1 КАК СубконтоДт1,
    |   ТаблицаОтражениеВУчете.СубконтоДт2 КАК СубконтоДт2,
    |   ТаблицаОтражениеВУчете.СубконтоДт3 КАК СубконтоДт3,
    |   ТаблицаОтражениеВУчете.СчетДтНУ КАК СчетДтНУ,
    |   ТаблицаОтражениеВУчете.СубконтоДтНУ1 КАК СубконтоДтНУ1,
    |   ТаблицаОтражениеВУчете.СубконтоДтНУ2 КАК СубконтоДтНУ2,
    |   ТаблицаОтражениеВУчете.СубконтоДтНУ3 КАК СубконтоДтНУ3,
    |   ТаблицаОтражениеВУчете.Сумма КАК Сумма,
    |   ТаблицаОтражениеВУчете.СчетКт КАК СчетКт,
    |   ТаблицаОтражениеВУчете.СубконтоКт1 КАК СубконтоКт1,
    |   ТаблицаОтражениеВУчете.СубконтоКт2 КАК СубконтоКт2,
    |   ТаблицаОтражениеВУчете.СубконтоКт3 КАК СубконтоКт3,
    |   ТаблицаОтражениеВУчете.СчетКтНУ КАК СчетКтНУ,
    |   ТаблицаОтражениеВУчете.СубконтоКтНУ1 КАК СубконтоКтНУ1,
    |   ТаблицаОтражениеВУчете.СубконтоКтНУ2 КАК СубконтоКтНУ2,
    |   ТаблицаОтражениеВУчете.СубконтоКтНУ3 КАК СубконтоКтНУ3,
    |   ТаблицаОтражениеВУчете.ВидУчетаДт КАК ВидУчетаДт,
    |   ТаблицаОтражениеВУчете.ВидУчетаКт КАК ВидУчетаКт,
    |   ТаблицаОтражениеВУчете.ВидНалогаОтчисления КАК ВидНалогаОтчисления,
    |   ТаблицаОтражениеВУчете.СтатьяЗатрат КАК СтатьяЗатрат,
    |   ТаблицаОтражениеВУчете.ПодразделениеБУ КАК ПодразделениеБУ,
    |   ТаблицаОтражениеВУчете.ПодразделениеНУ КАК ПодразделениеНУ,
    |   ТаблицаОтражениеВУчете.КонтрагентОтправитель КАК КонтрагентОтправитель,
    |   ТаблицаОтражениеВУчете.РаботникОрганизации КАК РаботникОрганизации
    |ПОМЕСТИТЬ ИтогТаблицаОтраженияВУчете
    |ИЗ
    |   ТаблицаОтражениеВУчете КАК ТаблицаОтражениеВУчете" + ОбщегоНазначенияБКВызовСервера.ТекстРазделителяЗапросовПакета();
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаПоОтражениюВУчете(НомераТаблиц)
	
	НомераТаблиц.Вставить("ТаблицаОтражениеВУчетеБУ", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ТаблицаОтражениеВУчетеНУ", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	//Сухомлинов++  киб_Участок
    |   ТаблицаОтражениеВУчете.киб_Участок КАК киб_Участок,
	//Сухомлинов--
	|	Реквизиты.Дата КАК Дата,
	|	Реквизиты.Период КАК Период,
	|	Реквизиты.Номер КАК Номер,
	|	Реквизиты.Регистратор КАК Регистратор,
	|	Реквизиты.Организация КАК Организация,
	|	ТаблицаОтражениеВУчете.Подразделение КАК Подразделение,
	|	ТаблицаОтражениеВУчете.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ТаблицаОтражениеВУчете.ФизическоеЛицо.Наименование КАК ФИОРаботника,
	|	ТаблицаОтражениеВУчете.ВидПлатежа КАК ВидПлатежа,
	|	ТаблицаОтражениеВУчете.Контрагент КАК Контрагент,
	|	ТаблицаОтражениеВУчете.КонтрагентОтправитель КАК КонтрагентОтправитель,
	|	ТаблицаОтражениеВУчете.РаботникОрганизации КАК РаботникОрганизации,
	|	ТаблицаОтражениеВУчете.СтруктурноеПодразделение КАК СтруктурноеПодразделение,
	|	ТаблицаОтражениеВУчете.НомерСтроки КАК НомерСтроки,
	|	ТаблицаОтражениеВУчете.ВидОперации КАК ВидОперации,
	|	ТаблицаОтражениеВУчете.ВидУчетаДт КАК ВидУчетаДт,
	|	ТаблицаОтражениеВУчете.ВидУчетаКт КАК ВидУчетаКт,
	|	ТаблицаОтражениеВУчете.ПодразделениеБУ КАК ПодразделениеБУ,
	|	ТаблицаОтражениеВУчете.СчетДт КАК СчетДт,
	|	ТаблицаОтражениеВУчете.СчетДт.Наименование КАК НаименованиеСчетДт,
	|	ВЫБОР
	|		КОГДА ДтВидСубконто1.ВидСубконто = &парамВидСубконтоСтатьиЗатрат
	|			ТОГДА ВЫБОР
	|					КОГДА НЕ ТаблицаОтражениеВУчете.СтатьяЗатрат = НЕОПРЕДЕЛЕНО
	|						ТОГДА ТаблицаОтражениеВУчете.СтатьяЗатрат
	|					ИНАЧЕ ТаблицаОтражениеВУчете.СубконтоДт1
	|				КОНЕЦ
	|		КОГДА ДтВидСубконто1.ВидСубконто = &ВидСубконтоРаботникиОрганизаций
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаОтражениеВУчете.СубконтоДт1 = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|						ТОГДА ТаблицаОтражениеВУчете.ФизическоеЛицо
	|					ИНАЧЕ ТаблицаОтражениеВУчете.СубконтоДт1
	|				КОНЕЦ
	|		КОГДА ДтВидСубконто1.ВидСубконто = &парамВидСубконтоРезервы
	|			ТОГДА ТаблицаОтражениеВУчете.Резерв
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НЕ &ВедениеУчетаПоСотрудникам
	|						И ДтВидСубконто1.ВидСубконто = &ВидСубконтоРаботникиОрганизаций
	|					ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|				ИНАЧЕ ТаблицаОтражениеВУчете.СубконтоДт1
	|			КОНЕЦ
	|	КОНЕЦ КАК СубконтоДт1,
	|	ДтВидСубконто1.ВидСубконто КАК ДтВидСубконто1,
	|	ВЫБОР
	//Сухомлинов++
	|		КОГДА ТаблицаОтражениеВУчете.СчетДт.Код = ""3350""
	|			ТОГДА ТаблицаОтражениеВУчете.киб_Участок
	//Сухомлинов--	
	|		КОГДА ДтВидСубконто2.ВидСубконто = &парамВидСубконтоСтатьиЗатрат
	|			ТОГДА ВЫБОР
	|					КОГДА НЕ ТаблицаОтражениеВУчете.СтатьяЗатрат = НЕОПРЕДЕЛЕНО
	|						ТОГДА ТаблицаОтражениеВУчете.СтатьяЗатрат
	|					ИНАЧЕ ТаблицаОтражениеВУчете.СубконтоДт2
	|				КОНЕЦ
	|		КОГДА ДтВидСубконто2.ВидСубконто = &ВидСубконтоРаботникиОрганизаций
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаОтражениеВУчете.СубконтоДт2 = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|						ТОГДА ТаблицаОтражениеВУчете.ФизическоеЛицо
	|					ИНАЧЕ ТаблицаОтражениеВУчете.СубконтоДт2
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НЕ &ВедениеУчетаПоСотрудникам
	|						И ДтВидСубконто2.ВидСубконто = &ВидСубконтоРаботникиОрганизаций
	|					ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|				ИНАЧЕ ТаблицаОтражениеВУчете.СубконтоДт2
	|			КОНЕЦ
	|	КОНЕЦ КАК СубконтоДт2,
	|	ДтВидСубконто2.ВидСубконто КАК ДтВидСубконто2,
	|	ВЫБОР
	|		КОГДА ДтВидСубконто3.ВидСубконто = &парамВидСубконтоСтатьиЗатрат
	|				ТОГДА ВЫБОР КОГДА ТаблицаОтражениеВУчете.ВидНалогаОтчисления = НЕОПРЕДЕЛЕНО
	|						ТОГДА ВЫБОР
	|							КОГДА НЕ ТаблицаОтражениеВУчете.СтатьяЗатрат = НЕОПРЕДЕЛЕНО
	|								ТОГДА ТаблицаОтражениеВУчете.СтатьяЗатрат
	|							ИНАЧЕ ТаблицаОтражениеВУчете.СубконтоДтНУ3
	|						КОНЕЦ
	|					ИНАЧЕ ТаблицаОтражениеВУчете.СтатьяЗатрат
	|				КОНЕЦ
	|		КОГДА ДтВидСубконто3.ВидСубконто = &ВидСубконтоРаботникиОрганизаций
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаОтражениеВУчете.СубконтоДт3 = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|						ТОГДА ТаблицаОтражениеВУчете.ФизическоеЛицо
	|					ИНАЧЕ ТаблицаОтражениеВУчете.СубконтоДт3
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НЕ &ВедениеУчетаПоСотрудникам
	|						И ДтВидСубконто3.ВидСубконто = &ВидСубконтоРаботникиОрганизаций
	|					ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|				ИНАЧЕ ТаблицаОтражениеВУчете.СубконтоДт3
	|			КОНЕЦ
	|	КОНЕЦ КАК СубконтоДт3,
	|	ДтВидСубконто3.ВидСубконто КАК ДтВидСубконто3,
	|	ТаблицаОтражениеВУчете.СчетКт КАК СчетКт,
	|	ВЫБОР
	|		КОГДА КтВидСубконто1.ВидСубконто = &ВидСубконтоРаботникиОрганизаций
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаОтражениеВУчете.СубконтоКт1 = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|						ТОГДА ТаблицаОтражениеВУчете.ФизическоеЛицо
	|					ИНАЧЕ ТаблицаОтражениеВУчете.СубконтоКт1
	|				КОНЕЦ
	|		КОГДА КтВидСубконто1.ВидСубконто = &парамВидСубконтоРезервы
	|			ТОГДА ТаблицаОтражениеВУчете.Резерв
	|		КОГДА КтВидСубконто1.ВидСубконто = &парамВидСубконтоСтатьиЗатрат
	|			ТОГДА ВЫБОР
	|					КОГДА НЕ ТаблицаОтражениеВУчете.СтатьяЗатрат = НЕОПРЕДЕЛЕНО
	|						ТОГДА ТаблицаОтражениеВУчете.СтатьяЗатрат
	|					ИНАЧЕ ТаблицаОтражениеВУчете.СубконтоКт1
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НЕ &ВедениеУчетаПоСотрудникам
	|						И КтВидСубконто1.ВидСубконто = &ВидСубконтоРаботникиОрганизаций
	|					ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|				ИНАЧЕ ТаблицаОтражениеВУчете.СубконтоКт1
	|			КОНЕЦ
	|	КОНЕЦ КАК СубконтоКт1,
	|	КтВидСубконто1.ВидСубконто КАК КтВидСубконто1,
	|	ВЫБОР
	//Сухомлинов++
	|		КОГДА ТаблицаОтражениеВУчете.СчетКт.Код = ""3350""
	|			ТОГДА ТаблицаОтражениеВУчете.киб_Участок
	//Сухомлинов--
	|		КОГДА КтВидСубконто2.ВидСубконто = &ВидСубконтоРаботникиОрганизаций
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаОтражениеВУчете.СубконтоКт2 = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|						ТОГДА ТаблицаОтражениеВУчете.ФизическоеЛицо
	|					ИНАЧЕ ТаблицаОтражениеВУчете.СубконтоКт2
	|				КОНЕЦ
	|		КОГДА КтВидСубконто2.ВидСубконто = &парамВидСубконтоПодразделения
	|			ТОГДА ТаблицаОтражениеВУчете.Подразделение
	// Дорофеева А. 10.01.2025 Кибернетика
	|		КОГДА КтВидСубконто2.ВидСубконто = &парамВидСубконтоСтатьиЗатрат
	//|				И ТаблицаОтражениеВУчете.ВидНалогаОтчисления <> НЕОПРЕДЕЛЕНО
	|			ТОГДА ТаблицаОтражениеВУчете.СтатьяЗатрат
	//******************
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НЕ &ВедениеУчетаПоСотрудникам
	|						И КтВидСубконто2.ВидСубконто = &ВидСубконтоРаботникиОрганизаций
	|					ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|				ИНАЧЕ ТаблицаОтражениеВУчете.СубконтоКт2
	|			КОНЕЦ
	|	КОНЕЦ КАК СубконтоКт2,
	|	КтВидСубконто2.ВидСубконто КАК КтВидСубконто2,
	|	ВЫБОР
	|		КОГДА КтВидСубконто3.ВидСубконто = &ВидСубконтоРаботникиОрганизаций
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаОтражениеВУчете.СубконтоКт3 = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|						ТОГДА ТаблицаОтражениеВУчете.ФизическоеЛицо
	|					ИНАЧЕ ТаблицаОтражениеВУчете.СубконтоКт3
	|				КОНЕЦ
	// Дорофеева А. 10.01.2025 Кибернетика
	|		КОГДА КтВидСубконто3.ВидСубконто = &парамВидСубконтоСтатьиЗатрат
	//|				И ТаблицаОтражениеВУчете.ВидНалогаОтчисления <> НЕОПРЕДЕЛЕНО
	|			ТОГДА ТаблицаОтражениеВУчете.СтатьяЗатрат
	//******************
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НЕ &ВедениеУчетаПоСотрудникам
	|						И КтВидСубконто3.ВидСубконто = &ВидСубконтоРаботникиОрганизаций
	|					ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|				ИНАЧЕ ТаблицаОтражениеВУчете.СубконтоКт3
	|			КОНЕЦ
	|	КОНЕЦ КАК СубконтоКт3,
	|	КтВидСубконто3.ВидСубконто КАК КтВидСубконто3,
	|	ТаблицаОтражениеВУчете.Сумма КАК Сумма,
	|	ЕСТЬNULL(ВидыСубконтоРаботникиОрганизацийДт.НомерСтроки, 0) КАК НомерСубконтоРаботникиОрганизацийДт,
	|	ЕСТЬNULL(ВидыСубконтоРаботникиОрганизацийКт.НомерСтроки, 0) КАК НомерСубконтоРаботникиОрганизацийКт,
	|	ЕСТЬNULL(ВидыСубконтоРезервыДт.НомерСтроки, 0) КАК НомерСубконтоРезервыДт,
	|	ЕСТЬNULL(ВидыСубконтоРезервыКт.НомерСтроки, 0) КАК НомерСубконтоРезервыКт,
	|	ЕСТЬNULL(ВидыСубконтоПодразделенияДт.НомерСтроки, 0) КАК НомерСубконтоПодразделенияДт,
	|	ЕСТЬNULL(ВидыСубконтоКонтрагентыКт.НомерСтроки, 0) КАК НомерСубконтоКонтрагентыКт,
	|	ЕСТЬNULL(ВидыСубконтоДоговорыКонтрагентовКт.НомерСтроки, 0) КАК НомерСубконтоДоговорыКонтрагентовКт,
	|	ЕСТЬNULL(ВидыСубконтоКонтрагентыДт.НомерСтроки, 0) КАК НомерСубконтоКонтрагентыДт,
	|	ЕСТЬNULL(ВидыСубконтоДоговорыКонтрагентовДт.НомерСтроки, 0) КАК НомерСубконтоДоговорыКонтрагентовДт,
	|	ЕСТЬNULL(ВидыСубконтоВидПлатежаДт.НомерСтроки, 0) КАК НомерСубконтоВидПлатежаДт,
	|	ЕСТЬNULL(ВидыСубконтоВидПлатежаКт.НомерСтроки, 0) КАК НомерСубконтоВидПлатежаКт,
	|	ЕСТЬNULL(ВидыСубконтоРаботникиОрганизацийДтНУ.НомерСтроки, 0) КАК НомерСубконтоРаботникиОрганизацийДтНУ,
	|	ЕСТЬNULL(ВидыСубконтоРаботникиОрганизацийКтНУ.НомерСтроки, 0) КАК НомерСубконтоРаботникиОрганизацийКтНУ,
	|	ЕСТЬNULL(ВидыСубконтоРезервыДтНУ.НомерСтроки, 0) КАК НомерСубконтоРезервыДтНУ,
	|	ЕСТЬNULL(ВидыСубконтоРезервыКтНУ.НомерСтроки, 0) КАК НомерСубконтоРезервыКтНУ,
	|	ЕСТЬNULL(ВидыСубконтоПодразделенияДтНУ.НомерСтроки, 0) КАК НомерСубконтоПодразделенияДтНУ,
	|	ЕСТЬNULL(ВидыСубконтоКонтрагентыКтНУ.НомерСтроки, 0) КАК НомерСубконтоКонтрагентыКтНУ,
	|	ЕСТЬNULL(ВидыСубконтоДоговорыКонтрагентовКтНУ.НомерСтроки, 0) КАК НомерСубконтоДоговорыКонтрагентовКтНУ,
	|	ЕСТЬNULL(ВидыСубконтоКонтрагентыДтНУ.НомерСтроки, 0) КАК НомерСубконтоКонтрагентыДтНУ,
	|	ЕСТЬNULL(ВидыСубконтоДоговорыКонтрагентовДтНУ.НомерСтроки, 0) КАК НомерСубконтоДоговорыКонтрагентовДтНУ,
	|	ЕСТЬNULL(ВидыСубконтоВидПлатежаДтНУ.НомерСтроки, 0) КАК НомерСубконтоВидПлатежаДтНУ,
	|	ЕСТЬNULL(ВидыСубконтоВидПлатежаКтНУ.НомерСтроки, 0) КАК НомерСубконтоВидПлатежаКтНУ
	|ИЗ
	|	Реквизиты КАК Реквизиты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИтогТаблицаОтраженияВУчете КАК ТаблицаОтражениеВУчете
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Типовой.ВидыСубконто КАК ДтВидСубконто1
	|		ПО (ДтВидСубконто1.Ссылка = ТаблицаОтражениеВУчете.СчетДт)
	|			И (ДтВидСубконто1.НомерСтроки = 1)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Типовой.ВидыСубконто КАК ДтВидСубконто2
	|		ПО (ДтВидСубконто2.Ссылка = ТаблицаОтражениеВУчете.СчетДт)
	|			И (ДтВидСубконто2.НомерСтроки = 2)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Типовой.ВидыСубконто КАК ДтВидСубконто3
	|		ПО (ДтВидСубконто3.Ссылка = ТаблицаОтражениеВУчете.СчетДт)
	|			И (ДтВидСубконто3.НомерСтроки = 3)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Типовой.ВидыСубконто КАК КтВидСубконто1
	|		ПО (КтВидСубконто1.Ссылка = ТаблицаОтражениеВУчете.СчетКт)
	|			И (КтВидСубконто1.НомерСтроки = 1)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Типовой.ВидыСубконто КАК КтВидСубконто2
	|		ПО (КтВидСубконто2.Ссылка = ТаблицаОтражениеВУчете.СчетКт)
	|			И (КтВидСубконто2.НомерСтроки = 2)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Типовой.ВидыСубконто КАК КтВидСубконто3
	|		ПО (КтВидСубконто3.Ссылка = ТаблицаОтражениеВУчете.СчетКт)
	|			И (КтВидСубконто3.НомерСтроки = 3)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Типовой.ВидыСубконто КАК ВидыСубконтоРаботникиОрганизацийДт
	|		ПО (ТаблицаОтражениеВУчете.СчетДт <> &парамПустойСчет)
	|			И (ТаблицаОтражениеВУчете.СчетДт = ВидыСубконтоРаботникиОрганизацийДт.Ссылка)
	|			И (ВидыСубконтоРаботникиОрганизацийДт.ВидСубконто = &парамВидСубконтоРаботникиОрганизаций)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Типовой.ВидыСубконто КАК ВидыСубконтоРаботникиОрганизацийКт
	|		ПО (ТаблицаОтражениеВУчете.СчетКт <> &парамПустойСчет)
	|			И (ТаблицаОтражениеВУчете.СчетКт = ВидыСубконтоРаботникиОрганизацийКт.Ссылка)
	|			И (ВидыСубконтоРаботникиОрганизацийКт.ВидСубконто = &парамВидСубконтоРаботникиОрганизаций)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Типовой.ВидыСубконто КАК ВидыСубконтоРезервыДт
	|		ПО (ТаблицаОтражениеВУчете.СчетДт <> &парамПустойСчет)
	|			И (ТаблицаОтражениеВУчете.СчетДт = ВидыСубконтоРезервыДт.Ссылка)
	|			И (ВидыСубконтоРезервыДт.ВидСубконто = &парамВидСубконтоРезервы)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Типовой.ВидыСубконто КАК ВидыСубконтоРезервыКт
	|		ПО (ТаблицаОтражениеВУчете.СчетКт <> &парамПустойСчет)
	|			И (ТаблицаОтражениеВУчете.СчетКт = ВидыСубконтоРезервыКт.Ссылка)
	|			И (ВидыСубконтоРезервыКт.ВидСубконто = &парамВидСубконтоРезервы)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Типовой.ВидыСубконто КАК ВидыСубконтоПодразделенияДт
	|		ПО (ТаблицаОтражениеВУчете.СчетДт <> &парамПустойСчет)
	|			И (ТаблицаОтражениеВУчете.СчетДт = ВидыСубконтоПодразделенияДт.Ссылка)
	|			И (ВидыСубконтоПодразделенияДт.ВидСубконто = &парамВидСубконтоПодразделения)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Типовой.ВидыСубконто КАК ВидСубконтоСчетаДт1
	|		ПО (ВидСубконтоСчетаДт1.НомерСтроки = 1)
	|			И (ТаблицаОтражениеВУчете.СчетДт = ВидСубконтоСчетаДт1.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Налоговый.ВидыСубконто КАК ВидыСубконтоРаботникиОрганизацийДтНУ
	|		ПО (ТаблицаОтражениеВУчете.СчетДтНУ <> &парамПустойСчетНУ)
	|			И (ТаблицаОтражениеВУчете.СчетДтНУ = ВидыСубконтоРаботникиОрганизацийДтНУ.Ссылка)
	|			И (ВидыСубконтоРаботникиОрганизацийДтНУ.ВидСубконто = &парамВидСубконтоРаботникиОрганизаций)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Налоговый.ВидыСубконто КАК ВидыСубконтоРаботникиОрганизацийКтНУ
	|		ПО (ТаблицаОтражениеВУчете.СчетКтНУ <> &парамПустойСчетНУ)
	|			И (ТаблицаОтражениеВУчете.СчетКтНУ = ВидыСубконтоРаботникиОрганизацийКтНУ.Ссылка)
	|			И (ВидыСубконтоРаботникиОрганизацийКтНУ.ВидСубконто = &парамВидСубконтоРаботникиОрганизаций)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Налоговый.ВидыСубконто КАК ВидыСубконтоРезервыДтНУ
	|		ПО (ТаблицаОтражениеВУчете.СчетДтНУ <> &парамПустойСчетНУ)
	|			И (ТаблицаОтражениеВУчете.СчетДтНУ = ВидыСубконтоРезервыДтНУ.Ссылка)
	|			И (ВидыСубконтоРезервыДтНУ.ВидСубконто = &парамВидСубконтоРезервы)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Налоговый.ВидыСубконто КАК ВидыСубконтоРезервыКтНУ
	|		ПО (ТаблицаОтражениеВУчете.СчетКтНУ <> &парамПустойСчетНУ)
	|			И (ТаблицаОтражениеВУчете.СчетКтНУ = ВидыСубконтоРезервыКтНУ.Ссылка)
	|			И (ВидыСубконтоРезервыКтНУ.ВидСубконто = &парамВидСубконтоРезервы)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Типовой.ВидыСубконто КАК ВидыСубконтоКонтрагентыДт
	|		ПО (ТаблицаОтражениеВУчете.СчетДт <> &парамПустойСчет)
	|			И (ТаблицаОтражениеВУчете.СчетДт = ВидыСубконтоКонтрагентыДт.Ссылка)
	|			И (ВидыСубконтоКонтрагентыДт.ВидСубконто = &парамВидСубконтоКонтрагенты)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Налоговый.ВидыСубконто КАК ВидыСубконтоКонтрагентыДтНУ
	|		ПО (ТаблицаОтражениеВУчете.СчетДтНУ <> &парамПустойСчет)
	|			И (ТаблицаОтражениеВУчете.СчетДтНУ = ВидыСубконтоКонтрагентыДтНУ.Ссылка)
	|			И (ВидыСубконтоКонтрагентыДтНУ.ВидСубконто = &парамВидСубконтоКонтрагенты)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Типовой.ВидыСубконто КАК ВидыСубконтоДоговорыКонтрагентовДт
	|		ПО (ТаблицаОтражениеВУчете.СчетДт <> &парамПустойСчет)
	|			И (ТаблицаОтражениеВУчете.СчетДт = ВидыСубконтоДоговорыКонтрагентовДт.Ссылка)
	|			И (ВидыСубконтоДоговорыКонтрагентовДт.ВидСубконто = &парамВидСубконтоДоговорыКонтрагентов)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Налоговый.ВидыСубконто КАК ВидыСубконтоДоговорыКонтрагентовДтНУ
	|		ПО (ТаблицаОтражениеВУчете.СчетДтНУ <> &парамПустойСчет)
	|			И (ТаблицаОтражениеВУчете.СчетДтНУ = ВидыСубконтоДоговорыКонтрагентовДтНУ.Ссылка)
	|			И (ВидыСубконтоДоговорыКонтрагентовДтНУ.ВидСубконто = &парамВидСубконтоДоговорыКонтрагентов)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Типовой.ВидыСубконто КАК ВидыСубконтоВидПлатежаДт
	|		ПО (ТаблицаОтражениеВУчете.СчетДт <> &парамПустойСчет)
	|			И (ТаблицаОтражениеВУчете.СчетДт = ВидыСубконтоВидПлатежаДт.Ссылка)
	|			И (ВидыСубконтоВидПлатежаДт.ВидСубконто = &парамВидСубконтоВидПлатежа)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Типовой.ВидыСубконто КАК ВидыСубконтоВидПлатежаКт
	|		ПО (ТаблицаОтражениеВУчете.СчетКт <> &парамПустойСчет)
	|			И (ТаблицаОтражениеВУчете.СчетКт = ВидыСубконтоВидПлатежаКт.Ссылка)
	|			И (ВидыСубконтоВидПлатежаКт.ВидСубконто = &парамВидСубконтоВидПлатежа)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Налоговый.ВидыСубконто КАК ВидыСубконтоПодразделенияДтНУ
	|		ПО (ТаблицаОтражениеВУчете.СчетДтНУ <> &парамПустойСчетНУ)
	|			И (ТаблицаОтражениеВУчете.СчетДтНУ = ВидыСубконтоПодразделенияДтНУ.Ссылка)
	|			И (ВидыСубконтоПодразделенияДтНУ.ВидСубконто = &парамВидСубконтоПодразделения)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Типовой.ВидыСубконто КАК ВидыСубконтоКонтрагентыКт
	|		ПО (ТаблицаОтражениеВУчете.СчетКт <> &парамПустойСчет)
	|			И (ТаблицаОтражениеВУчете.СчетКт = ВидыСубконтоКонтрагентыКт.Ссылка)
	|			И (ВидыСубконтоКонтрагентыКт.ВидСубконто = &парамВидСубконтоКонтрагенты)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Налоговый.ВидыСубконто КАК ВидыСубконтоКонтрагентыКтНУ
	|		ПО (ТаблицаОтражениеВУчете.СчетКтНУ <> &парамПустойСчет)
	|			И (ТаблицаОтражениеВУчете.СчетКтНУ = ВидыСубконтоКонтрагентыКтНУ.Ссылка)
	|			И (ВидыСубконтоКонтрагентыКтНУ.ВидСубконто = &парамВидСубконтоКонтрагенты)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Типовой.ВидыСубконто КАК ВидыСубконтоДоговорыКонтрагентовКт
	|		ПО (ТаблицаОтражениеВУчете.СчетКт <> &парамПустойСчет)
	|			И (ТаблицаОтражениеВУчете.СчетКт = ВидыСубконтоДоговорыКонтрагентовКт.Ссылка)
	|			И (ВидыСубконтоДоговорыКонтрагентовКт.ВидСубконто = &парамВидСубконтоДоговорыКонтрагентов)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Налоговый.ВидыСубконто КАК ВидыСубконтоДоговорыКонтрагентовКтНУ
	|		ПО (ТаблицаОтражениеВУчете.СчетКтНУ <> &парамПустойСчет)
	|			И (ТаблицаОтражениеВУчете.СчетКтНУ = ВидыСубконтоДоговорыКонтрагентовКтНУ.Ссылка)
	|			И (ВидыСубконтоДоговорыКонтрагентовКтНУ.ВидСубконто = &парамВидСубконтоДоговорыКонтрагентов)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Налоговый.ВидыСубконто КАК ВидыСубконтоВидПлатежаДтНУ
	|		ПО (ТаблицаОтражениеВУчете.СчетДтНУ <> &парамПустойСчет)
	|			И (ТаблицаОтражениеВУчете.СчетДтНУ = ВидыСубконтоВидПлатежаДтНУ.Ссылка)
	|			И (ВидыСубконтоВидПлатежаДтНУ.ВидСубконто = &парамВидСубконтоВидПлатежа)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Налоговый.ВидыСубконто КАК ВидыСубконтоВидПлатежаКтНУ
	|		ПО (ТаблицаОтражениеВУчете.СчетКтНУ <> &парамПустойСчет)
	|			И (ТаблицаОтражениеВУчете.СчетКтНУ = ВидыСубконтоВидПлатежаКтНУ.Ссылка)
	|			И (ВидыСубконтоВидПлатежаКтНУ.ВидСубконто = &парамВидСубконтоВидПлатежа)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТаблицаОтражениеВУчете.НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Реквизиты.Дата КАК Дата,
	|	Реквизиты.Период КАК Период,
	|	Реквизиты.Номер КАК Номер,
	|	Реквизиты.Регистратор КАК Регистратор,
	|	Реквизиты.Организация КАК Организация,
	|	ТаблицаОтражениеВУчете.Подразделение КАК Подразделение,
	|	ТаблицаОтражениеВУчете.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ТаблицаОтражениеВУчете.ФизическоеЛицо.Наименование КАК ФИОРаботника,
	|	ТаблицаОтражениеВУчете.СтруктурноеПодразделение КАК СтруктурноеПодразделение,
	|	ТаблицаОтражениеВУчете.ВидПлатежа КАК ВидПлатежа,
	|	ТаблицаОтражениеВУчете.ВидОперации КАК ВидОперации,
	|	ТаблицаОтражениеВУчете.КонтрагентОтправитель КАК КонтрагентОтправитель,
	|	ТаблицаОтражениеВУчете.РаботникОрганизации КАК РаботникОрганизации,
	|	ТаблицаОтражениеВУчете.ВидУчетаДт КАК ВидУчетаДт,
	|	ТаблицаОтражениеВУчете.ВидУчетаКт КАК ВидУчетаКт,
	|	ТаблицаОтражениеВУчете.ПодразделениеНУ КАК ПодразделениеНУ,
	|	ТаблицаОтражениеВУчете.НомерСтроки КАК НомерСтроки,
	|	ТаблицаОтражениеВУчете.СчетДтНУ КАК СчетДтНУ,
	|	ВЫБОР
	|		КОГДА ДтВидСубконтоНУ1.ВидСубконто = &парамВидСубконтоСтатьиЗатрат
	|			ТОГДА ВЫБОР
	|					КОГДА НЕ ТаблицаОтражениеВУчете.СтатьяЗатрат = НЕОПРЕДЕЛЕНО
	|						ТОГДА ТаблицаОтражениеВУчете.СтатьяЗатрат
	|					ИНАЧЕ ТаблицаОтражениеВУчете.СубконтоДтНУ1
	|				КОНЕЦ
	|		КОГДА ДтВидСубконтоНУ1.ВидСубконто = &ВидСубконтоРаботникиОрганизаций
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаОтражениеВУчете.СубконтоДтНУ1 = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|						ТОГДА ТаблицаОтражениеВУчете.ФизическоеЛицо
	|					ИНАЧЕ ТаблицаОтражениеВУчете.СубконтоДтНУ1
	|				КОНЕЦ
	|		КОГДА ДтВидСубконтоНУ1.ВидСубконто = &парамВидСубконтоРезервы
	|			ТОГДА ТаблицаОтражениеВУчете.Резерв
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НЕ &ВедениеУчетаПоСотрудникам
	|						И ДтВидСубконтоНУ1.ВидСубконто = &ВидСубконтоРаботникиОрганизаций
	|					ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|				ИНАЧЕ ТаблицаОтражениеВУчете.СубконтоДтНУ1
	|			КОНЕЦ
	|	КОНЕЦ КАК СубконтоДтНУ1,
	|	ДтВидСубконтоНУ1.ВидСубконто КАК ДтВидСубконтоНУ1,
	|	ВЫБОР
	|		КОГДА ДтВидСубконтоНУ2.ВидСубконто = &парамВидСубконтоСтатьиЗатрат
	|			ТОГДА ВЫБОР
	|					КОГДА НЕ ТаблицаОтражениеВУчете.СтатьяЗатрат = НЕОПРЕДЕЛЕНО
	|						ТОГДА ТаблицаОтражениеВУчете.СтатьяЗатрат
	|					ИНАЧЕ ТаблицаОтражениеВУчете.СубконтоДтНУ2
	|				КОНЕЦ
	|		КОГДА ДтВидСубконтоНУ2.ВидСубконто = &ВидСубконтоРаботникиОрганизаций
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаОтражениеВУчете.СубконтоДтНУ2 = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|						ТОГДА ТаблицаОтражениеВУчете.ФизическоеЛицо
	|					ИНАЧЕ ТаблицаОтражениеВУчете.СубконтоДтНУ2
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НЕ &ВедениеУчетаПоСотрудникам
	|						И ДтВидСубконтоНУ2.ВидСубконто = &ВидСубконтоРаботникиОрганизаций
	|					ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|				ИНАЧЕ ТаблицаОтражениеВУчете.СубконтоДтНУ2
	|			КОНЕЦ
	|	КОНЕЦ КАК СубконтоДтНУ2,
	|	ДтВидСубконтоНУ2.ВидСубконто КАК ДтВидСубконтоНУ2,
	|	ВЫБОР
	|		КОГДА ДтВидСубконтоНУ3.ВидСубконто = &парамВидСубконтоСтатьиЗатрат
	|				ТОГДА ВЫБОР КОГДА ТаблицаОтражениеВУчете.ВидНалогаОтчисления = НЕОПРЕДЕЛЕНО
	|						ТОГДА ВЫБОР
	|							КОГДА НЕ ТаблицаОтражениеВУчете.СтатьяЗатрат = НЕОПРЕДЕЛЕНО
	|								ТОГДА ТаблицаОтражениеВУчете.СтатьяЗатрат
	|							ИНАЧЕ ТаблицаОтражениеВУчете.СубконтоДт3
	|						КОНЕЦ
	|					ИНАЧЕ ТаблицаОтражениеВУчете.СтатьяЗатрат
	|				КОНЕЦ
	|		КОГДА ДтВидСубконтоНУ3.ВидСубконто = &ВидСубконтоРаботникиОрганизаций
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаОтражениеВУчете.СубконтоДтНУ3 = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|						ТОГДА ТаблицаОтражениеВУчете.ФизическоеЛицо
	|					ИНАЧЕ ТаблицаОтражениеВУчете.СубконтоДтНУ3
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НЕ &ВедениеУчетаПоСотрудникам
	|						И ДтВидСубконтоНУ3.ВидСубконто = &ВидСубконтоРаботникиОрганизаций
	|					ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|				ИНАЧЕ ТаблицаОтражениеВУчете.СубконтоДтНУ3
	|			КОНЕЦ
	|	КОНЕЦ КАК СубконтоДтНУ3,
	|	ДтВидСубконтоНУ3.ВидСубконто КАК ДтВидСубконтоНУ3,
	|	ТаблицаОтражениеВУчете.СчетКтНУ КАК СчетКтНУ,
	|	ВЫБОР
	|		КОГДА КтВидСубконтоНУ1.ВидСубконто = &ВидСубконтоРаботникиОрганизаций
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаОтражениеВУчете.СубконтоКтНУ1 = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|						ТОГДА ТаблицаОтражениеВУчете.ФизическоеЛицо
	|					ИНАЧЕ ТаблицаОтражениеВУчете.СубконтоКтНУ1
	|				КОНЕЦ
	|		КОГДА КтВидСубконтоНУ1.ВидСубконто = &парамВидСубконтоРезервы
	|			ТОГДА ТаблицаОтражениеВУчете.Резерв
	|		КОГДА КтВидСубконтоНУ1.ВидСубконто = &парамВидСубконтоСтатьиЗатрат
	|			ТОГДА ТаблицаОтражениеВУчете.СтатьяЗатрат
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НЕ &ВедениеУчетаПоСотрудникам
	|						И КтВидСубконтоНУ1.ВидСубконто = &ВидСубконтоРаботникиОрганизаций
	|					ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|				ИНАЧЕ ТаблицаОтражениеВУчете.СубконтоКтНУ1
	|			КОНЕЦ
	|	КОНЕЦ КАК СубконтоКтНУ1,
	|	КтВидСубконтоНУ1.ВидСубконто КАК КтВидСубконтоНУ1,
	|	ВЫБОР
	|		КОГДА КтВидСубконтоНУ2.ВидСубконто = &ВидСубконтоРаботникиОрганизаций
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаОтражениеВУчете.СубконтоКтНУ2 = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|						ТОГДА ТаблицаОтражениеВУчете.ФизическоеЛицо
	|					ИНАЧЕ ТаблицаОтражениеВУчете.СубконтоКтНУ2
	|				КОНЕЦ
	|		КОГДА КтВидСубконтоНУ2.ВидСубконто = &парамВидСубконтоПодразделения
	|			ТОГДА ТаблицаОтражениеВУчете.Подразделение
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НЕ &ВедениеУчетаПоСотрудникам
	|						И КтВидСубконтоНУ2.ВидСубконто = &ВидСубконтоРаботникиОрганизаций
	|					ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|				ИНАЧЕ ТаблицаОтражениеВУчете.СубконтоКтНУ2
	|			КОНЕЦ
	|	КОНЕЦ КАК СубконтоКтНУ2,
	|	КтВидСубконтоНУ2.ВидСубконто КАК КтВидСубконтоНУ2,
	|	ВЫБОР
	|		КОГДА КтВидСубконтоНУ3.ВидСубконто = &ВидСубконтоРаботникиОрганизаций
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаОтражениеВУчете.СубконтоКтНУ3 = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|						ТОГДА ТаблицаОтражениеВУчете.ФизическоеЛицо
	|					ИНАЧЕ ТаблицаОтражениеВУчете.СубконтоКтНУ3
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НЕ &ВедениеУчетаПоСотрудникам
	|						И КтВидСубконтоНУ3.ВидСубконто = &ВидСубконтоРаботникиОрганизаций
	|					ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|				ИНАЧЕ ТаблицаОтражениеВУчете.СубконтоКтНУ3
	|			КОНЕЦ
	|	КОНЕЦ КАК СубконтоКтНУ3,
	|	КтВидСубконтоНУ3.ВидСубконто КАК КтВидСубконтоНУ3,
	|	ТаблицаОтражениеВУчете.Сумма КАК Сумма,
	|	ЕСТЬNULL(ВидыСубконтоРаботникиОрганизацийДт.НомерСтроки, 0) КАК НомерСубконтоРаботникиОрганизацийДт,
	|	ЕСТЬNULL(ВидыСубконтоРаботникиОрганизацийКт.НомерСтроки, 0) КАК НомерСубконтоРаботникиОрганизацийКт,
	|	ЕСТЬNULL(ВидыСубконтоРезервыДт.НомерСтроки, 0) КАК НомерСубконтоРезервыДт,
	|	ЕСТЬNULL(ВидыСубконтоРезервыКт.НомерСтроки, 0) КАК НомерСубконтоРезервыКт,
	|	ЕСТЬNULL(ВидыСубконтоПодразделенияДт.НомерСтроки, 0) КАК НомерСубконтоПодразделенияДт,
	|	ЕСТЬNULL(ВидыСубконтоКонтрагентыДт.НомерСтроки, 0) КАК НомерСубконтоКонтрагентыДт,
	|	ЕСТЬNULL(ВидыСубконтоДоговорыКонтрагентовДт.НомерСтроки, 0) КАК НомерСубконтоДоговорыКонтрагентовДт,
	|	ЕСТЬNULL(ВидыСубконтоКонтрагентыКт.НомерСтроки, 0) КАК НомерСубконтоКонтрагентыКт,
	|	ЕСТЬNULL(ВидыСубконтоДоговорыКонтрагентовКт.НомерСтроки, 0) КАК НомерСубконтоДоговорыКонтрагентовКт,
	|	ЕСТЬNULL(ВидыСубконтоВидПлатежаДт.НомерСтроки, 0) КАК НомерСубконтоВидПлатежаДт,
	|	ЕСТЬNULL(ВидыСубконтоВидПлатежаКт.НомерСтроки, 0) КАК НомерСубконтоВидПлатежаКт,
	|	ЕСТЬNULL(ВидыСубконтоРаботникиОрганизацийДтНУ.НомерСтроки, 0) КАК НомерСубконтоРаботникиОрганизацийДтНУ,
	|	ЕСТЬNULL(ВидыСубконтоРаботникиОрганизацийКтНУ.НомерСтроки, 0) КАК НомерСубконтоРаботникиОрганизацийКтНУ,
	|	ЕСТЬNULL(ВидыСубконтоРезервыДтНУ.НомерСтроки, 0) КАК НомерСубконтоРезервыДтНУ,
	|	ЕСТЬNULL(ВидыСубконтоРезервыКтНУ.НомерСтроки, 0) КАК НомерСубконтоРезервыКтНУ,
	|	ЕСТЬNULL(ВидыСубконтоПодразделенияДтНУ.НомерСтроки, 0) КАК НомерСубконтоПодразделенияДтНУ,
	|	ЕСТЬNULL(ВидыСубконтоКонтрагентыКтНУ.НомерСтроки, 0) КАК НомерСубконтоКонтрагентыКтНУ,
	|	ЕСТЬNULL(ВидыСубконтоДоговорыКонтрагентовКтНУ.НомерСтроки, 0) КАК НомерСубконтоДоговорыКонтрагентовКтНУ,
	|	ЕСТЬNULL(ВидыСубконтоКонтрагентыДтНУ.НомерСтроки, 0) КАК НомерСубконтоКонтрагентыДтНУ,
	|	ЕСТЬNULL(ВидыСубконтоДоговорыКонтрагентовДтНУ.НомерСтроки, 0) КАК НомерСубконтоДоговорыКонтрагентовДтНУ,
	|	ЕСТЬNULL(ВидыСубконтоВидПлатежаДтНУ.НомерСтроки, 0) КАК НомерСубконтоВидПлатежаДтНУ,
	|	ЕСТЬNULL(ВидыСубконтоВидПлатежаКтНУ.НомерСтроки, 0) КАК НомерСубконтоВидПлатежаКтНУ,
	|	ТаблицаОтражениеВУчете.Контрагент КАК Контрагент
	|ИЗ
	|	Реквизиты КАК Реквизиты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИтогТаблицаОтраженияВУчете КАК ТаблицаОтражениеВУчете
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Налоговый.ВидыСубконто КАК ДтВидСубконтоНУ1
	|		ПО (ДтВидСубконтоНУ1.Ссылка = ТаблицаОтражениеВУчете.СчетДтНУ)
	|			И (ДтВидСубконтоНУ1.НомерСтроки = 1)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Налоговый.ВидыСубконто КАК ДтВидСубконтоНУ2
	|		ПО (ДтВидСубконтоНУ2.Ссылка = ТаблицаОтражениеВУчете.СчетДтНУ)
	|			И (ДтВидСубконтоНУ2.НомерСтроки = 2)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Налоговый.ВидыСубконто КАК ДтВидСубконтоНУ3
	|		ПО (ДтВидСубконтоНУ3.Ссылка = ТаблицаОтражениеВУчете.СчетДтНУ)
	|			И (ДтВидСубконтоНУ3.НомерСтроки = 3)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Налоговый.ВидыСубконто КАК КтВидСубконтоНУ1
	|		ПО (КтВидСубконтоНУ1.Ссылка = ТаблицаОтражениеВУчете.СчетКтНУ)
	|			И (КтВидСубконтоНУ1.НомерСтроки = 1)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Налоговый.ВидыСубконто КАК КтВидСубконтоНУ2
	|		ПО (КтВидСубконтоНУ2.Ссылка = ТаблицаОтражениеВУчете.СчетКтНУ)
	|			И (КтВидСубконтоНУ2.НомерСтроки = 2)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Налоговый.ВидыСубконто КАК КтВидСубконтоНУ3
	|		ПО (КтВидСубконтоНУ3.Ссылка = ТаблицаОтражениеВУчете.СчетКтНУ)
	|			И (КтВидСубконтоНУ3.НомерСтроки = 3)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Типовой.ВидыСубконто КАК ВидыСубконтоРаботникиОрганизацийДт
	|		ПО (ТаблицаОтражениеВУчете.СчетДт <> &парамПустойСчет)
	|			И (ТаблицаОтражениеВУчете.СчетДт = ВидыСубконтоРаботникиОрганизацийДт.Ссылка)
	|			И (ВидыСубконтоРаботникиОрганизацийДт.ВидСубконто = &парамВидСубконтоРаботникиОрганизаций)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Типовой.ВидыСубконто КАК ВидыСубконтоРаботникиОрганизацийКт
	|		ПО (ТаблицаОтражениеВУчете.СчетКт <> &парамПустойСчет)
	|			И (ТаблицаОтражениеВУчете.СчетКт = ВидыСубконтоРаботникиОрганизацийКт.Ссылка)
	|			И (ВидыСубконтоРаботникиОрганизацийКт.ВидСубконто = &парамВидСубконтоРаботникиОрганизаций)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Типовой.ВидыСубконто КАК ВидыСубконтоРезервыДт
	|		ПО (ТаблицаОтражениеВУчете.СчетДт <> &парамПустойСчет)
	|			И (ТаблицаОтражениеВУчете.СчетДт = ВидыСубконтоРезервыДт.Ссылка)
	|			И (ВидыСубконтоРезервыДт.ВидСубконто = &парамВидСубконтоРезервы)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Типовой.ВидыСубконто КАК ВидыСубконтоРезервыКт
	|		ПО (ТаблицаОтражениеВУчете.СчетКт <> &парамПустойСчет)
	|			И (ТаблицаОтражениеВУчете.СчетКт = ВидыСубконтоРезервыКт.Ссылка)
	|			И (ВидыСубконтоРезервыКт.ВидСубконто = &парамВидСубконтоРезервы)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Типовой.ВидыСубконто КАК ВидыСубконтоПодразделенияДт
	|		ПО (ТаблицаОтражениеВУчете.СчетДт <> &парамПустойСчет)
	|			И (ТаблицаОтражениеВУчете.СчетДт = ВидыСубконтоПодразделенияДт.Ссылка)
	|			И (ВидыСубконтоПодразделенияДт.ВидСубконто = &парамВидСубконтоПодразделения)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Типовой.ВидыСубконто КАК ВидыСубконтоВидПлатежаДт
	|		ПО (ТаблицаОтражениеВУчете.СчетДт <> &парамПустойСчет)
	|			И (ТаблицаОтражениеВУчете.СчетДт = ВидыСубконтоВидПлатежаДт.Ссылка)
	|			И (ВидыСубконтоВидПлатежаДт.ВидСубконто = &парамВидСубконтоВидПлатежа)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Типовой.ВидыСубконто КАК ВидыСубконтоВидПлатежаКт
	|		ПО (ТаблицаОтражениеВУчете.СчетКт <> &парамПустойСчет)
	|			И (ТаблицаОтражениеВУчете.СчетКт = ВидыСубконтоВидПлатежаКт.Ссылка)
	|			И (ВидыСубконтоВидПлатежаКт.ВидСубконто = &парамВидСубконтоВидПлатежа)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Типовой.ВидыСубконто КАК ВидСубконтоСчетаДт1
	|		ПО (ВидСубконтоСчетаДт1.НомерСтроки = 1)
	|			И (ТаблицаОтражениеВУчете.СчетДт = ВидСубконтоСчетаДт1.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Налоговый.ВидыСубконто КАК ВидыСубконтоРаботникиОрганизацийДтНУ
	|		ПО (ТаблицаОтражениеВУчете.СчетДтНУ <> &парамПустойСчетНУ)
	|			И (ТаблицаОтражениеВУчете.СчетДтНУ = ВидыСубконтоРаботникиОрганизацийДтНУ.Ссылка)
	|			И (ВидыСубконтоРаботникиОрганизацийДтНУ.ВидСубконто = &парамВидСубконтоРаботникиОрганизаций)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Налоговый.ВидыСубконто КАК ВидыСубконтоРаботникиОрганизацийКтНУ
	|		ПО (ТаблицаОтражениеВУчете.СчетКтНУ <> &парамПустойСчетНУ)
	|			И (ТаблицаОтражениеВУчете.СчетКтНУ = ВидыСубконтоРаботникиОрганизацийКтНУ.Ссылка)
	|			И (ВидыСубконтоРаботникиОрганизацийКтНУ.ВидСубконто = &парамВидСубконтоРаботникиОрганизаций)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Налоговый.ВидыСубконто КАК ВидыСубконтоРезервыДтНУ
	|		ПО (ТаблицаОтражениеВУчете.СчетДтНУ <> &парамПустойСчетНУ)
	|			И (ТаблицаОтражениеВУчете.СчетДтНУ = ВидыСубконтоРезервыДтНУ.Ссылка)
	|			И (ВидыСубконтоРезервыДтНУ.ВидСубконто = &парамВидСубконтоРезервы)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Налоговый.ВидыСубконто КАК ВидыСубконтоРезервыКтНУ
	|		ПО (ТаблицаОтражениеВУчете.СчетКтНУ <> &парамПустойСчетНУ)
	|			И (ТаблицаОтражениеВУчете.СчетКтНУ = ВидыСубконтоРезервыКтНУ.Ссылка)
	|			И (ВидыСубконтоРезервыКтНУ.ВидСубконто = &парамВидСубконтоРезервы)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Налоговый.ВидыСубконто КАК ВидыСубконтоПодразделенияДтНУ
	|		ПО (ТаблицаОтражениеВУчете.СчетДтНУ <> &парамПустойСчетНУ)
	|			И (ТаблицаОтражениеВУчете.СчетДтНУ = ВидыСубконтоПодразделенияДтНУ.Ссылка)
	|			И (ВидыСубконтоПодразделенияДтНУ.ВидСубконто = &парамВидСубконтоПодразделения)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Типовой.ВидыСубконто КАК ВидыСубконтоКонтрагентыДт
	|		ПО (ТаблицаОтражениеВУчете.СчетДт <> &парамПустойСчет)
	|			И (ТаблицаОтражениеВУчете.СчетДт = ВидыСубконтоКонтрагентыДт.Ссылка)
	|			И (ВидыСубконтоКонтрагентыДт.ВидСубконто = &парамВидСубконтоКонтрагенты)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Налоговый.ВидыСубконто КАК ВидыСубконтоКонтрагентыДтНУ
	|		ПО (ТаблицаОтражениеВУчете.СчетДтНУ <> &парамПустойСчет)
	|			И (ТаблицаОтражениеВУчете.СчетДтНУ = ВидыСубконтоКонтрагентыДтНУ.Ссылка)
	|			И (ВидыСубконтоКонтрагентыДтНУ.ВидСубконто = &парамВидСубконтоКонтрагенты)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Типовой.ВидыСубконто КАК ВидыСубконтоДоговорыКонтрагентовДт
	|		ПО (ТаблицаОтражениеВУчете.СчетДт <> &парамПустойСчет)
	|			И (ТаблицаОтражениеВУчете.СчетДт = ВидыСубконтоДоговорыКонтрагентовДт.Ссылка)
	|			И (ВидыСубконтоДоговорыКонтрагентовДт.ВидСубконто = &парамВидСубконтоДоговорыКонтрагентов)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Налоговый.ВидыСубконто КАК ВидыСубконтоДоговорыКонтрагентовДтНУ
	|		ПО (ТаблицаОтражениеВУчете.СчетДтНУ <> &парамПустойСчет)
	|			И (ТаблицаОтражениеВУчете.СчетДтНУ = ВидыСубконтоДоговорыКонтрагентовДтНУ.Ссылка)
	|			И (ВидыСубконтоДоговорыКонтрагентовДтНУ.ВидСубконто = &парамВидСубконтоДоговорыКонтрагентов)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Типовой.ВидыСубконто КАК ВидыСубконтоКонтрагентыКт
	|		ПО (ТаблицаОтражениеВУчете.СчетКт <> &парамПустойСчет)
	|			И (ТаблицаОтражениеВУчете.СчетКт = ВидыСубконтоКонтрагентыКт.Ссылка)
	|			И (ВидыСубконтоКонтрагентыКт.ВидСубконто = &парамВидСубконтоКонтрагенты)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Налоговый.ВидыСубконто КАК ВидыСубконтоКонтрагентыКтНУ
	|		ПО (ТаблицаОтражениеВУчете.СчетКтНУ <> &парамПустойСчет)
	|			И (ТаблицаОтражениеВУчете.СчетКтНУ = ВидыСубконтоКонтрагентыКтНУ.Ссылка)
	|			И (ВидыСубконтоКонтрагентыКтНУ.ВидСубконто = &парамВидСубконтоКонтрагенты)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Типовой.ВидыСубконто КАК ВидыСубконтоДоговорыКонтрагентовКт
	|		ПО (ТаблицаОтражениеВУчете.СчетКт <> &парамПустойСчет)
	|			И (ТаблицаОтражениеВУчете.СчетКт = ВидыСубконтоДоговорыКонтрагентовКт.Ссылка)
	|			И (ВидыСубконтоДоговорыКонтрагентовКт.ВидСубконто = &парамВидСубконтоДоговорыКонтрагентов)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Налоговый.ВидыСубконто КАК ВидыСубконтоДоговорыКонтрагентовКтНУ
	|		ПО (ТаблицаОтражениеВУчете.СчетКтНУ <> &парамПустойСчет)
	|			И (ТаблицаОтражениеВУчете.СчетКтНУ = ВидыСубконтоДоговорыКонтрагентовКтНУ.Ссылка)
	|			И (ВидыСубконтоДоговорыКонтрагентовКтНУ.ВидСубконто = &парамВидСубконтоДоговорыКонтрагентов)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Налоговый.ВидыСубконто КАК ВидыСубконтоВидПлатежаДтНУ
	|		ПО (ТаблицаОтражениеВУчете.СчетДтНУ <> &парамПустойСчет)
	|			И (ТаблицаОтражениеВУчете.СчетДтНУ = ВидыСубконтоВидПлатежаДтНУ.Ссылка)
	|			И (ВидыСубконтоВидПлатежаДтНУ.ВидСубконто = &парамВидСубконтоВидПлатежа)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Налоговый.ВидыСубконто КАК ВидыСубконтоВидПлатежаКтНУ
	|		ПО (ТаблицаОтражениеВУчете.СчетКтНУ <> &парамПустойСчет)
	|			И (ТаблицаОтражениеВУчете.СчетКтНУ = ВидыСубконтоВидПлатежаКтНУ.Ссылка)
	|			И (ВидыСубконтоВидПлатежаКтНУ.ВидСубконто = &парамВидСубконтоВидПлатежа)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТаблицаОтражениеВУчете.НомерСтроки";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБКВызовСервера.ТекстРазделителяЗапросовПакета();
		
КонецФункции

Функция ТекстЗапросаОборотПоПриобретеннымУслугамГПХВЦеляхНДС(НомераТаблиц)
	
	ТекстЗапроса = "";

	ТекстЗапроса = "ВЫБРАТЬ
	               |	Реквизиты.Дата КАК Дата,
	               |	Реквизиты.Период КАК Период,
	               |	Реквизиты.Номер КАК Номер,
	               |	Реквизиты.Регистратор КАК Регистратор,
	               |	Реквизиты.Организация КАК Организация,
	               |	&НалогоплательщикНДС КАК Налогоплательщик
	               |ИЗ
	               |	Реквизиты КАК Реквизиты
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОтражениеЗарплатыВБухучетеОборотПоПриобретеннымУслугамГПХВЦеляхНДС.Ссылка КАК Ссылка,
	               |	ОтражениеЗарплатыВБухучетеОборотПоПриобретеннымУслугамГПХВЦеляхНДС.НомерСтроки КАК НомерСтроки,
	               |	ОтражениеЗарплатыВБухучетеОборотПоПриобретеннымУслугамГПХВЦеляхНДС.Контрагент КАК Контрагент,
	               |	ОтражениеЗарплатыВБухучетеОборотПоПриобретеннымУслугамГПХВЦеляхНДС.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |	ОтражениеЗарплатыВБухучетеОборотПоПриобретеннымУслугамГПХВЦеляхНДС.НДСВидПоступления КАК ВидОперацииПоступления,
	               |	ОтражениеЗарплатыВБухучетеОборотПоПриобретеннымУслугамГПХВЦеляхНДС.НДСВидОборота КАК ВидОборота,
				   |	ЗНАЧЕНИЕ(Перечисление.ВидыНДС.НДС) КАК ВидНалогаНДС,
	               |	ОтражениеЗарплатыВБухучетеОборотПоПриобретеннымУслугамГПХВЦеляхНДС.СтавкаНДС КАК СтавкаНДС,
	               |	СУММА(ОтражениеЗарплатыВБухучетеОборотПоПриобретеннымУслугамГПХВЦеляхНДС.Сумма) КАК СуммаБезНДС
	               |ИЗ
	               |	Документ.ОтражениеЗарплатыВБухучете.ОборотПоПриобретеннымУслугамГПХВЦеляхНДС КАК ОтражениеЗарплатыВБухучетеОборотПоПриобретеннымУслугамГПХВЦеляхНДС
	               |ГДЕ
	               |	ОтражениеЗарплатыВБухучетеОборотПоПриобретеннымУслугамГПХВЦеляхНДС.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ОтражениеЗарплатыВБухучетеОборотПоПриобретеннымУслугамГПХВЦеляхНДС.Ссылка,
	               |	ОтражениеЗарплатыВБухучетеОборотПоПриобретеннымУслугамГПХВЦеляхНДС.НомерСтроки,
	               |	ОтражениеЗарплатыВБухучетеОборотПоПриобретеннымУслугамГПХВЦеляхНДС.Контрагент,
	               |	ОтражениеЗарплатыВБухучетеОборотПоПриобретеннымУслугамГПХВЦеляхНДС.ДоговорКонтрагента,
	               |	ОтражениеЗарплатыВБухучетеОборотПоПриобретеннымУслугамГПХВЦеляхНДС.НДСВидПоступления,
	               |	ОтражениеЗарплатыВБухучетеОборотПоПриобретеннымУслугамГПХВЦеляхНДС.НДСВидОборота,
	               |	ОтражениеЗарплатыВБухучетеОборотПоПриобретеннымУслугамГПХВЦеляхНДС.СтавкаНДС"

		+ ОбщегоНазначенияБКВызовСервера.ТекстРазделителяЗапросовПакета();
		
		НомераТаблиц.Вставить("РеквизитыОборотПоПриобретеннымУслугамГПХВЦеляхНДС", НомераТаблиц.Количество());
		НомераТаблиц.Вставить("ТаблицаОборотПоПриобретеннымУслугамГПХВЦеляхНДС", НомераТаблиц.Количество());
		
	         	
	Возврат ТекстЗапроса 
	
КонецФункции

Функция ТекстЗапросаВзаиморасчетыСПолучателямиИЛ(НомераТаблиц) 
    
	НомераТаблиц.Вставить("РеквизитыВзаиморасчетыСПолучателямиИЛ", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ВзаиморасчетыСПолучателямиИЛ", НомераТаблиц.Количество());
	
	ТекстЗапроса = "ВЫБРАТЬ
                   |    Реквизиты.Дата КАК Дата,
                   |    Реквизиты.Период КАК ПериодРегистрации,
                   |    Реквизиты.Номер КАК Номер,
                   |    Реквизиты.Регистратор КАК Регистратор,
                   |    Реквизиты.Организация КАК Организация,
                   |    &Налогоплательщик КАК Налогоплательщик,
                   |    ЕСТЬNULL(УчетнаяПолитикаНУ.РаспределятьНалогиПоПодразделениямОрганизаций, ЛОЖЬ) КАК РаспределятьНалогиПоПодразделениямОрганизаций
                   |ИЗ
                   |    Реквизиты КАК Реквизиты
                   |        ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаНалоговыйУчет.СрезПоследних(&ПериодРегистрации, ) КАК УчетнаяПолитикаНУ
                   |        ПО Реквизиты.Организация = УчетнаяПолитикаНУ.Организация
                   |;
                   |
                   |////////////////////////////////////////////////////////////////////////////////
                   |ВЫБРАТЬ
                   |    ВТ_ВзаиморасчетыСПолучателямиИЛ.Ссылка КАК Ссылка,
                   |    ВТ_ВзаиморасчетыСПолучателямиИЛ.Получатель КАК Получатель,
                   |    СУММА(ВТ_ВзаиморасчетыСПолучателямиИЛ.СуммаВзаиморасчетов) КАК СуммаВзаиморасчетов,
                   |    ВТ_ВзаиморасчетыСПолучателямиИЛ.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
                   |    СУММА(ВТ_ВзаиморасчетыСПолучателямиИЛ.СуммаСборов) КАК СуммаСборов,
                   |    ВТ_ВзаиморасчетыСПолучателямиИЛ.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
                   |    ВТ_ВзаиморасчетыСПолучателямиИЛ.ДокументОснование КАК ДокументОснование
                   |ИЗ
                   |    ВТ_ВзаиморасчетыСПолучателямиИЛ КАК ВТ_ВзаиморасчетыСПолучателямиИЛ
                   |ГДЕ
                   |    ВТ_ВзаиморасчетыСПолучателямиИЛ.ДокументОснование <> ЗНАЧЕНИЕ(Документ.ИсполнительныйЛист.ПустаяСсылка)
                   |
                   |СГРУППИРОВАТЬ ПО
                   |    ВТ_ВзаиморасчетыСПолучателямиИЛ.ПодразделениеОрганизации,
                   |    ВТ_ВзаиморасчетыСПолучателямиИЛ.СтруктурнаяЕдиница,
                   |    ВТ_ВзаиморасчетыСПолучателямиИЛ.Ссылка,
                   |    ВТ_ВзаиморасчетыСПолучателямиИЛ.Получатель,
                   |    ВТ_ВзаиморасчетыСПолучателямиИЛ.ДокументОснование"

		+ ОбщегоНазначенияБКВызовСервера.ТекстРазделителяЗапросовПакета();


	Возврат ТекстЗапроса;
	
КонецФункции

// Автозаполнерие субконто по данным строки.
//
Процедура АвтозаполнениеСубконто(СтрокаДанных, ПустойСчет, ПустойСчетНУ, БУ = Истина, ДанныеНалоговыйКомитет = Неопределено)
	
	Если СтрокаДанных.Владелец().Колонки.Найти("СчетДт") <> Неопределено Тогда
		// если не пустой счет - заполним "автозаполняемые" субконто
		Если СтрокаДанных.СчетДт <> ПустойСчет Тогда
			Если СтрокаДанных.НомерСубконтоРаботникиОрганизацийДт <> 0 Тогда
				Субконто = СтрокаДанных["СубконтоДт" + СтрокаДанных.НомерСубконтоРаботникиОрганизацийДт];
				Если НЕ ЗначениеЗаполнено(Субконто) Тогда
					СтрокаДанных["СубконтоДт" + СтрокаДанных.НомерСубконтоРаботникиОрганизацийДт] = СтрокаДанных.ФизическоеЛицо;
				КонецЕсли;
			КонецЕсли;
			Если СтрокаДанных.НомерСубконтоПодразделенияДт <> 0 Тогда
				Если ТипЗнч(СтрокаДанных["СубконтоДт" + СтрокаДанных.НомерСубконтоПодразделенияДт]) = Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда
					Субконто = СтрокаДанных["СубконтоДт" + СтрокаДанных.НомерСубконтоПодразделенияДт];																
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(Субконто) Тогда
					СтрокаДанных["СубконтоДт" + СтрокаДанных.НомерСубконтоПодразделенияДт] = СтрокаДанных.Подразделение;
				КонецЕсли;
			КонецЕсли;
			Если СтрокаДанных.НомерСубконтоКонтрагентыДт <> 0 Тогда
				Субконто = СтрокаДанных["СубконтоДт" + СтрокаДанных.НомерСубконтоКонтрагентыДт];
				Если НЕ ЗначениеЗаполнено(Субконто) Тогда
					Если СтрокаДанных.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоЗарплате.АлиментыПрочиеИсполнительныеЛистыКонтрагенты")
						ИЛИ СтрокаДанных.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоЗарплате.ВознаграждениеПлатежногоАгентаКонтрагенты") Тогда
						СтрокаДанных["СубконтоДт" + СтрокаДанных.НомерСубконтоКонтрагентыДт] = СтрокаДанных.КонтрагентОтправитель;
					Иначе
						СтрокаДанных["СубконтоДт" + СтрокаДанных.НомерСубконтоКонтрагентыДт] = СтрокаДанных.Контрагент;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			Если СтрокаДанных.НомерСубконтоДоговорыКонтрагентовДт <> 0 Тогда
				Субконто = СтрокаДанных["СубконтоДт" + СтрокаДанных.НомерСубконтоДоговорыКонтрагентовДт];
				Если НЕ ЗначениеЗаполнено(Субконто) Тогда
					Если СтрокаДанных.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоЗарплате.АлиментыПрочиеИсполнительныеЛистыКонтрагенты")
						ИЛИ СтрокаДанных.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоЗарплате.ВознаграждениеПлатежногоАгентаКонтрагенты") Тогда
						СтрокаДанных["СубконтоДт" + СтрокаДанных.НомерСубконтоДоговорыКонтрагентовДт] = ОбщегоНазначенияБК.ДоступныйДоговорКонтрагента(СтрокаДанных.КонтрагентОтправитель["ОсновнойДоговорКонтрагента"]);
					Иначе
						СтрокаДанных["СубконтоДт" + СтрокаДанных.НомерСубконтоДоговорыКонтрагентовДт] = ОбщегоНазначенияБК.ДоступныйДоговорКонтрагента(СтрокаДанных.Контрагент["ОсновнойДоговорКонтрагента"]);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			Если СтрокаДанных.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоЗарплате.ОППВПеня")
				ИЛИ СтрокаДанных.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоЗарплате.ОПВРПеня")
				ИЛИ СтрокаДанных.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоЗарплате.ОПВПеня")
				ИЛИ СтрокаДанных.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоЗарплате.СОПеня")
				ИЛИ СтрокаДанных.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоЗарплате.ВОСМСПеня")
				ИЛИ СтрокаДанных.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоЗарплате.ООСМСПеня")
				ИЛИ СтрокаДанных.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоЗарплате.ЕППеня") Тогда
				Если СтрокаДанных.НомерСубконтоВидПлатежаДт <> 0 Тогда
					Субконто = СтрокаДанных["СубконтоДт" + СтрокаДанных.НомерСубконтоВидПлатежаДт];
					Если НЕ ЗначениеЗаполнено(Субконто) Тогда
						СтрокаДанных["СубконтоДт" + СтрокаДанных.НомерСубконтоВидПлатежаДт] = СтрокаДанных.ВидПлатежа;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли; 
			
		КонецЕсли;
		Если СтрокаДанных.СчетКт <> ПустойСчет Тогда
			Если СтрокаДанных.НомерСубконтоРаботникиОрганизацийКт <> 0 Тогда
				Субконто = СтрокаДанных["СубконтоКт" + СтрокаДанных.НомерСубконтоРаботникиОрганизацийКт];
				Если НЕ ЗначениеЗаполнено(Субконто) Тогда
					Если СтрокаДанных.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоЗарплате.ВозмещениеУщерба")
						ИЛИ СтрокаДанных.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоЗарплате.УдержаниеПоПрочимОперациямСРаботниками") 
						ИЛИ СтрокаДанных.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоЗарплате.УдержаниеНеизрасходованныхПодотчетныхСумм") 
						ИЛИ СтрокаДанных.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоЗарплате.ВозвратИзлишнеВыплаченныхСуммВследствиеСчетныхОшибок") 
						ИЛИ СтрокаДанных.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоЗарплате.ПогашениеЗаймов") 
						ИЛИ СтрокаДанных.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоЗарплате.ПроцентыПоЗайму")
						ИЛИ СтрокаДанных.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоЗарплате.УдержаниеЗаОтпуск")
						ИЛИ СтрокаДанных.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоЗарплате.ПрочиеУдержания") Тогда
						СтрокаДанных["СубконтоКт" + СтрокаДанных.НомерСубконтоРаботникиОрганизацийКт] = СтрокаДанных.РаботникОрганизации;
					Иначе
						СтрокаДанных["СубконтоКт" + СтрокаДанных.НомерСубконтоРаботникиОрганизацийКт] = СтрокаДанных.ФизическоеЛицо;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			Если СтрокаДанных.НомерСубконтоКонтрагентыКт <> 0 Тогда
				Субконто = СтрокаДанных["СубконтоКт" + СтрокаДанных.НомерСубконтоКонтрагентыКт];
				Если НЕ ЗначениеЗаполнено(Субконто) Тогда
					СтрокаДанных["СубконтоКт" + СтрокаДанных.НомерСубконтоКонтрагентыКт] = СтрокаДанных.Контрагент;
				КонецЕсли;
			КонецЕсли;
			Если СтрокаДанных.НомерСубконтоДоговорыКонтрагентовКт <> 0 Тогда
				Субконто = СтрокаДанных["СубконтоКт" + СтрокаДанных.НомерСубконтоДоговорыКонтрагентовКт];
				Если НЕ ЗначениеЗаполнено(Субконто) Тогда
					СтрокаДанных["СубконтоКт" + СтрокаДанных.НомерСубконтоДоговорыКонтрагентовКт] = ОбщегоНазначенияБК.ДоступныйДоговорКонтрагента(СтрокаДанных.Контрагент["ОсновнойДоговорКонтрагента"]);
				КонецЕсли;
			КонецЕсли;
			Если СтрокаДанных.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоЗарплате.ОППВПеня")
				ИЛИ СтрокаДанных.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоЗарплате.ОПВРПеня")
				ИЛИ СтрокаДанных.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоЗарплате.ОПВПеня")
				ИЛИ СтрокаДанных.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоЗарплате.СОПеня")
				ИЛИ СтрокаДанных.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоЗарплате.ВОСМСПеня")
				ИЛИ СтрокаДанных.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоЗарплате.ООСМСПеня")
				ИЛИ СтрокаДанных.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоЗарплате.ЕППеня") Тогда
				Если СтрокаДанных.НомерСубконтоВидПлатежаКт <> 0 Тогда
					Субконто = СтрокаДанных["СубконтоКт" + СтрокаДанных.НомерСубконтоВидПлатежаКт];
					Если НЕ ЗначениеЗаполнено(Субконто) Тогда
						СтрокаДанных["СубконтоКт" + СтрокаДанных.НомерСубконтоВидПлатежаКт] = СтрокаДанных.ВидПлатежа;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли; 
			
			Если ДанныеНалоговыйКомитет <> Неопределено И 
				(СтрокаДанных.СчетКт = ПредопределенноеЗначение("ПланСчетов.Типовой.СоциальныйНалог") И ДанныеНалоговыйКомитет.ЗаполнятьНКпоСН) 
				ИЛИ (СтрокаДанных.СчетКт = ПредопределенноеЗначение("ПланСчетов.Типовой.ИндивидуальныйПодоходныйНалог") И ДанныеНалоговыйКомитет.ЗаполнятьНКпоИПН) Тогда
				
				НалоговыйКомитетВСтроке = ПроцедурыНалоговогоУчета.ПолучитьНалоговыйКомитетСтруктурнойЕдиницы(СтрокаДанных.СтруктурноеПодразделение, 
																							СтрокаДанных.Организация,
																							ДанныеНалоговыйКомитет.ИсчислениеНалоговСтруктурныхЕдиниц,
																							Перечисления.РазделыНалоговогоУчета.НалогиСЗаработнойПлаты);

				СтрокаДанных.СубконтоКт3 = НалоговыйКомитетВСтроке;
				
			КонецЕсли;
				
		КонецЕсли;
	Иначе
		// тоже самое для налогового учета
		Если СтрокаДанных.Владелец().Колонки.Найти("СчетДтНУ") <> Неопределено Тогда
			Если СтрокаДанных.СчетДтНУ <> ПустойСчетНУ Тогда
				Если СтрокаДанных.НомерСубконтоРаботникиОрганизацийДтНУ <> 0 Тогда
					Субконто = СтрокаДанных["СубконтоДтНУ" + СтрокаДанных.НомерСубконтоРаботникиОрганизацийДтНУ];
					Если НЕ ЗначениеЗаполнено(Субконто) Тогда
						СтрокаДанных["СубконтоДтНУ" + СтрокаДанных.НомерСубконтоРаботникиОрганизацийДтНУ] = СтрокаДанных.ФизическоеЛицо;
					КонецЕсли;
				КонецЕсли;
				Если СтрокаДанных.НомерСубконтоПодразделенияДтНУ <> 0 Тогда
					Если ТипЗнч(СтрокаДанных["СубконтоДтНУ" + СтрокаДанных.НомерСубконтоПодразделенияДтНУ]) = Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда
						Субконто = СтрокаДанных["СубконтоДтНУ" + СтрокаДанных.НомерСубконтоПодразделенияДтНУ];
					КонецЕсли;
					Если НЕ ЗначениеЗаполнено(Субконто) Тогда
						СтрокаДанных["СубконтоДтНУ" + СтрокаДанных.НомерСубконтоПодразделенияДтНУ] = СтрокаДанных.Подразделение;
					КонецЕсли;
				КонецЕсли;
				Если СтрокаДанных.НомерСубконтоКонтрагентыДтНУ <> 0 Тогда
					Субконто = СтрокаДанных["СубконтоДтНУ" + СтрокаДанных.НомерСубконтоКонтрагентыДтНУ];
					Если НЕ ЗначениеЗаполнено(Субконто) Тогда
						Если СтрокаДанных.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоЗарплате.АлиментыПрочиеИсполнительныеЛистыКонтрагенты")
							ИЛИ СтрокаДанных.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоЗарплате.ВознаграждениеПлатежногоАгентаКонтрагенты") Тогда
							СтрокаДанных["СубконтоДтНУ" + СтрокаДанных.НомерСубконтоКонтрагентыДтНУ] = СтрокаДанных.КонтрагентОтправитель;
						Иначе
							СтрокаДанных["СубконтоДтНУ" + СтрокаДанных.НомерСубконтоКонтрагентыДтНУ] = СтрокаДанных.Контрагент;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				Если СтрокаДанных.НомерСубконтоДоговорыКонтрагентовДтНУ <> 0 Тогда
					Субконто = СтрокаДанных["СубконтоДтНУ" + СтрокаДанных.НомерСубконтоДоговорыКонтрагентовДтНУ];
					Если НЕ ЗначениеЗаполнено(Субконто) Тогда
						Если СтрокаДанных.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоЗарплате.АлиментыПрочиеИсполнительныеЛистыКонтрагенты")
							ИЛИ СтрокаДанных.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоЗарплате.ВознаграждениеПлатежногоАгентаКонтрагенты") Тогда
							СтрокаДанных["СубконтоДтНУ" + СтрокаДанных.НомерСубконтоДоговорыКонтрагентовДтНУ] = ОбщегоНазначенияБК.ДоступныйДоговорКонтрагента(СтрокаДанных.КонтрагентОтправитель["ОсновнойДоговорКонтрагента"]);
						Иначе
							СтрокаДанных["СубконтоДтНУ" + СтрокаДанных.НомерСубконтоДоговорыКонтрагентовДтНУ] = ОбщегоНазначенияБК.ДоступныйДоговорКонтрагента(СтрокаДанных.Контрагент["ОсновнойДоговорКонтрагента"]);
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				Если СтрокаДанных.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоЗарплате.ОППВПеня")
					ИЛИ СтрокаДанных.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоЗарплате.ОПВРПеня")
					ИЛИ СтрокаДанных.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоЗарплате.ОПВПеня")
					ИЛИ СтрокаДанных.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоЗарплате.СОПеня")
					ИЛИ СтрокаДанных.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоЗарплате.ВОСМСПеня")
					ИЛИ СтрокаДанных.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоЗарплате.ООСМСПеня")
					ИЛИ СтрокаДанных.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоЗарплате.ЕППеня") Тогда
					Если СтрокаДанных.НомерСубконтоВидПлатежаДтНУ <> 0 Тогда
						Субконто = СтрокаДанных["СубконтоДтНУ" + СтрокаДанных.НомерСубконтоВидПлатежаДтНУ];
						Если НЕ ЗначениеЗаполнено(Субконто) Тогда
							СтрокаДанных["СубконтоДтНУ" + СтрокаДанных.НомерСубконтоВидПлатежаДтНУ] = СтрокаДанных.ВидПлатежа;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли; 
			КонецЕсли;
			
		КонецЕсли;
		Если СтрокаДанных.СчетКтНУ <> ПустойСчетНУ Тогда
			Если СтрокаДанных.НомерСубконтоРаботникиОрганизацийКтНУ <> 0 Тогда
				Субконто = СтрокаДанных["СубконтоКтНУ" + СтрокаДанных.НомерСубконтоРаботникиОрганизацийКтНУ];
				Если НЕ ЗначениеЗаполнено(Субконто) Тогда
					Если СтрокаДанных.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоЗарплате.ВозмещениеУщерба")
						ИЛИ СтрокаДанных.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоЗарплате.УдержаниеПоПрочимОперациямСРаботниками") 
						ИЛИ СтрокаДанных.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоЗарплате.УдержаниеНеизрасходованныхПодотчетныхСумм") 
						ИЛИ СтрокаДанных.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоЗарплате.ВозвратИзлишнеВыплаченныхСуммВследствиеСчетныхОшибок") 
						ИЛИ СтрокаДанных.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоЗарплате.ПогашениеЗаймов") 
						ИЛИ СтрокаДанных.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоЗарплате.ПроцентыПоЗайму")
						ИЛИ СтрокаДанных.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоЗарплате.УдержаниеЗаОтпуск")
						ИЛИ СтрокаДанных.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоЗарплате.ПрочиеУдержания") Тогда
						СтрокаДанных["СубконтоКтНУ" + СтрокаДанных.НомерСубконтоРаботникиОрганизацийКтНУ] = СтрокаДанных.РаботникОрганизации;
					Иначе
						СтрокаДанных["СубконтоКтНУ" + СтрокаДанных.НомерСубконтоРаботникиОрганизацийКтНУ] = СтрокаДанных.ФизическоеЛицо;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			Если СтрокаДанных.НомерСубконтоКонтрагентыКтНУ <> 0 Тогда
				Субконто = СтрокаДанных["СубконтоКтНУ" + СтрокаДанных.НомерСубконтоКонтрагентыКтНУ];
				Если НЕ ЗначениеЗаполнено(Субконто) Тогда
					СтрокаДанных["СубконтоКтНУ" + СтрокаДанных.НомерСубконтоКонтрагентыКтНУ] = СтрокаДанных.Контрагент;
				КонецЕсли;
			КонецЕсли;
			Если СтрокаДанных.НомерСубконтоДоговорыКонтрагентовКтНУ <> 0 Тогда
				Субконто = СтрокаДанных["СубконтоКтНУ" + СтрокаДанных.НомерСубконтоДоговорыКонтрагентовКтНУ];
				Если НЕ ЗначениеЗаполнено(Субконто) Тогда
					СтрокаДанных["СубконтоКтНУ" + СтрокаДанных.НомерСубконтоДоговорыКонтрагентовКтНУ] = ОбщегоНазначенияБК.ДоступныйДоговорКонтрагента(СтрокаДанных.Контрагент["ОсновнойДоговорКонтрагента"]);
				КонецЕсли;
			КонецЕсли;
			Если СтрокаДанных.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоЗарплате.ОППВПеня")
				ИЛИ СтрокаДанных.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоЗарплате.ОПВРПеня")
				ИЛИ СтрокаДанных.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоЗарплате.ОПВПеня")
				ИЛИ СтрокаДанных.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоЗарплате.СОПеня")
				ИЛИ СтрокаДанных.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоЗарплате.ВОСМСПеня")
				ИЛИ СтрокаДанных.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоЗарплате.ООСМСПеня")
				ИЛИ СтрокаДанных.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоЗарплате.ЕППеня") Тогда
				Если СтрокаДанных.НомерСубконтоВидПлатежаКтНУ <> 0 Тогда
					Субконто = СтрокаДанных["СубконтоКтНУ" + СтрокаДанных.НомерСубконтоВидПлатежаКтНУ];
					Если НЕ ЗначениеЗаполнено(Субконто) Тогда
						СтрокаДанных["СубконтоКтНУ" + СтрокаДанных.НомерСубконтоВидПлатежаКтНУ] = СтрокаДанных.ВидПлатежа;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
				
			Если ДанныеНалоговыйКомитет <> Неопределено И 
				(СтрокаДанных.СчетКтНУ = ПредопределенноеЗначение("ПланСчетов.Налоговый.ПрочиеНалоги") И ДанныеНалоговыйКомитет.ЗаполнятьНКпоСНВНУ) 
				ИЛИ (СтрокаДанных.СчетКтНУ = ПредопределенноеЗначение("ПланСчетов.Налоговый.ИндивидуальныйПодоходныйНалог") И ДанныеНалоговыйКомитет.ЗаполнятьНКпоИПНВНУ) Тогда
				
				НалоговыйКомитетВСтроке = ПроцедурыНалоговогоУчета.ПолучитьНалоговыйКомитетСтруктурнойЕдиницы(СтрокаДанных.СтруктурноеПодразделение, 
																							СтрокаДанных.Организация,
																							ДанныеНалоговыйКомитет.ИсчислениеНалоговСтруктурныхЕдиниц,
																							Перечисления.РазделыНалоговогоУчета.НалогиСЗаработнойПлаты);
				СтрокаДанных.СубконтоКтНУ3 = НалоговыйКомитетВСтроке;
				
			КонецЕсли;

		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры 

#КонецОбласти

&НаСервере
Процедура ЗаполнитьОборотПоПриобретеннымУслугамГПХВЦеляхНДС(СтруктураПараметров, АдресХранилища = Неопределено, Объект = Неопределено) Экспорт
	
	//УстановитьПривилегированныйРежим(Истина);

	Организация = СтруктураПараметров.Организация;
	ПериодРегистрации = СтруктураПараметров.ПериодРегистрации;
	ПлательщикНДС = ПроцедурыНалоговогоУчета.ПолучитьПризнакПлательщикаНДС(Организация, ПериодРегистрации);

	Если НЕ ПлательщикНДС Тогда
		Возврат;
	КонецЕсли;
	
	Если УчетнаяПолитикаСервер.ПолучитьМетодОтнесенияНДСВЗачет(Организация, ПериодРегистрации) = Перечисления.МетодыОтнесенияНДСВЗачет.Пропорциональный Тогда
		НДСВидОборота = Перечисления.ВидыОборотовПоРеализации.Общий;
	Иначе
		НДСВидОборота = Перечисления.ВидыОборотовПоРеализации.Облагаемый;
	КонецЕсли;

	ТаблицаОборотПоПриобретеннымУслугамГПХВЦеляхНДС = Новый ТаблицаЗначений;
	
	Запрос = Новый Запрос;
		
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СтавкаБезНДС", Справочники.СтавкиНДС.ПолучитьСтавкуБезНДС(Ложь));
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	ОтражениеЗарплатыВБухучетеНачисленнаяЗарплатаИВзносы.Сумма КАК Сумма,
		|	ОтражениеЗарплатыВБухучетеНачисленнаяЗарплатаИВзносы.Контрагент КАК Контрагент,
		|	ОтражениеЗарплатыВБухучетеНачисленнаяЗарплатаИВзносы.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	&СтавкаБезНДС КАК СтавкаНДС,
		|	ЗНАЧЕНИЕ(Справочник.ВидыПоступления.ПриобретениеТМЗБезНДС) КАК НДСВидПоступления,
		|	&НДСВидОборота КАК НДСВидОборота
		|ИЗ
		|	Документ.ОтражениеЗарплатыВБухучете.НачисленнаяЗарплатаИВзносы КАК ОтражениеЗарплатыВБухучетеНачисленнаяЗарплатаИВзносы
		|ГДЕ
		|	ОтражениеЗарплатыВБухучетеНачисленнаяЗарплатаИВзносы.Ссылка = &Ссылка
		|	И ОтражениеЗарплатыВБухучетеНачисленнаяЗарплатаИВзносы.ВидОперации = &ВидОперацииДоходыКонтрагентов
		|	И ОтражениеЗарплатыВБухучетеНачисленнаяЗарплатаИВзносы.Контрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)";
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылка", СтруктураПараметров.Ссылка);
	Запрос.УстановитьПараметр("НДСВидОборота", НДСВидОборота);
	Запрос.УстановитьПараметр("ВидОперацииДоходыКонтрагентов", Перечисления.ВидыОперацийПоЗарплате.ДоходыКонтрагентов);
	ТаблицаОборотПоПриобретеннымУслугамГПХВЦеляхНДС = Запрос.Выполнить().Выгрузить();
	
	Если СтруктураПараметров.Загрузка Тогда
		//Объект = СтруктураПараметров.Ссылка.ПолучитьОбъект();
		Объект.ОборотПоПриобретеннымУслугамГПХВЦеляхНДС.Загрузить(ТаблицаОборотПоПриобретеннымУслугамГПХВЦеляхНДС);
	Иначе

		СтруктураДанныхЗаполнения = Новый Структура;
		//УстановитьПривилегированныйРежим(Ложь);
		СтруктураДанныхЗаполнения.Вставить("ТаблицаОборотПоПриобретеннымУслугамГПХВЦеляхНДС", ТаблицаОборотПоПриобретеннымУслугамГПХВЦеляхНДС);
		ПоместитьВоВременноеХранилище(СтруктураДанныхЗаполнения, АдресХранилища);
 	КонецЕсли;
				
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики обновления ИБ

Процедура ЗаполнитьВидОперацииПриОбновлении(Параметры) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	ОтражениеЗарплатыВБухучете.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ОтражениеЗарплатыВБухучете КАК ОтражениеЗарплатыВБухучете
		|ГДЕ
		|	ОтражениеЗарплатыВБухучете.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОтражениеЗарплатыВБухучете.ПустаяСсылка)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОтражениеЗарплатыВБухучете.Дата УБЫВ";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Параметры.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;	
	Параметры.ОбработкаЗавершена = Ложь;
	
	Выборка = Результат.Выбрать();
	
	ВОПоУмолчанию = Перечисления.ВидыОперацийОтражениеЗарплатыВБухучете.ОтражениеЗарплатыВзносовУдержаний;
	Пока Выборка.Следующий() Цикл
		НачатьТранзакцию();
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Если ДокументОбъект = Неопределено Тогда
			ОтменитьТранзакцию();
			Продолжить;
		КонецЕсли;
		
		Блокировка = Новый БлокировкаДанных;
    	ЭлементБлокировки = Блокировка.Добавить("Документ.ОтражениеЗарплатыВБухучете");
    	ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.Ссылка);
		
		Попытка
			Блокировка.Заблокировать();
			ДокументОбъект.ВидОперации = ВОПоУмолчанию;

			ДокументОбъект.ОбменДанными.Загрузка = Истина;
			ДокументОбъект.Записать();
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ТекстСообщения = НСтр("ru='Операция не выполнена'", ОбщегоНазначения.КодОсновногоЯзыка());
			ЗаписьЖурналаРегистрации(ТекстСообщения, УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
	КонецЦикла;

КонецПроцедуры

	
#КонецЕсли