#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьОбновление(Команда)
	ВыполнитьОбновлениеНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВыполнитьОбновлениеНаСервере()
	Результат = Новый Структура;
	Результат.Вставить("ВыполненоУспешно",Ложь);
	Результат.Вставить("ОписаниеЗавершения","");
	
	Обработки.си_ОбновлениеИнформационнойБазы.ПервыйЗапуск(,,Результат);
	ОбщегоНазначенияБККлиентСервер.СообщитьОбОшибке(Результат.ОписаниеЗавершения);
КонецПроцедуры

#КонецОбласти
