#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура НайтиПлатежныйДокументИЗаполнитьСсылку(ВедомостьСсылка, ЭлементСсылкаНаПлатежноеПоручение, СписокПлатежныхДокументов) Экспорт
	
	СписокПлатежныхДокументов.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВедомостьСсылка", ВедомостьСсылка);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПлатежноеПоручениеИсходящее.Ссылка КАК Ссылка,
	|	ПлатежноеПоручениеИсходящее.ВидОперации КАК ВидОперации,
	|	ПлатежноеПоручениеИсходящее.Проведен КАК Проведен
	|ПОМЕСТИТЬ ВТ_ПлатежныйДокумент
	|ИЗ
	|	Документ.ПлатежноеПоручениеИсходящее КАК ПлатежноеПоручениеИсходящее
	|ГДЕ
	|	ПлатежноеПоручениеИсходящее.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийППИсходящее.ПеречислениеПрочихДоходов)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	РасходныйКассовыйОрдер.Ссылка КАК Ссылка,
	|	РасходныйКассовыйОрдер.ВидОперации КАК ВидОперации,
	|	РасходныйКассовыйОрдер.Проведен КАК Проведен
	|ИЗ
	|	Документ.РасходныйКассовыйОрдер КАК РасходныйКассовыйОрдер
	|ГДЕ
	|	РасходныйКассовыйОрдер.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРКО.РасчетыПоДоходуОтРазовыхВыплатСКонтрагентами)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ПлатежныйДокумент.Ссылка КАК ПлатежноеПоручение,
	|	ВТ_ПлатежныйДокумент.Проведен КАК Проведен,
	|	ПлатежноеПоручениеИсходящееПеречислениеПрочихДоходов.Документ КАК Ведомость
	|ПОМЕСТИТЬ ВТ_ПлатежныйДокумент_Ведомости
	|ИЗ
	|	Документ.ПлатежноеПоручениеИсходящее.ПеречислениеПрочихДоходов КАК ПлатежноеПоручениеИсходящееПеречислениеПрочихДоходов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПлатежныйДокумент КАК ВТ_ПлатежныйДокумент
	|		ПО ПлатежноеПоручениеИсходящееПеречислениеПрочихДоходов.Ссылка = ВТ_ПлатежныйДокумент.Ссылка
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_ПлатежныйДокумент.Ссылка КАК ПлатежноеПоручение,
	|	ВТ_ПлатежныйДокумент.Проведен КАК Проведен,
	|	РасходныйКассовыйОрдер.ПлатежнаяВедомость КАК Ведомость
	|ИЗ
	|	Документ.РасходныйКассовыйОрдер КАК РасходныйКассовыйОрдер
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПлатежныйДокумент КАК ВТ_ПлатежныйДокумент
	|		ПО РасходныйКассовыйОрдер.Ссылка = ВТ_ПлатежныйДокумент.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВедомостьПрочихДоходов.Ссылка КАК Ведомость,
	|	ВТ_ПлатежныйДокумент_Ведомости.ПлатежноеПоручение КАК ПлатежноеПоручение,
	|	ПРЕДСТАВЛЕНИЕ(ВТ_ПлатежныйДокумент_Ведомости.ПлатежноеПоручение) КАК ПлатежноеПоручениеПредставление,
	|	ВТ_ПлатежныйДокумент_Ведомости.Проведен КАК Проведен
	|ИЗ
	|	Документ.ВедомостьПрочихДоходов КАК ВедомостьПрочихДоходов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПлатежныйДокумент_Ведомости КАК ВТ_ПлатежныйДокумент_Ведомости
	|		ПО ВедомостьПрочихДоходов.Ссылка = ВТ_ПлатежныйДокумент_Ведомости.Ведомость
	|ГДЕ
	|	ВедомостьПрочихДоходов.Ссылка = &ВедомостьСсылка";
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Пока РезультатЗапроса.Следующий() Цикл
		СтрокаСпискаППИ = СписокПлатежныхДокументов.Добавить();
		СтрокаСпискаППИ.Значение = РезультатЗапроса.ПлатежноеПоручение; 
		СтрокаСпискаППИ.Представление = РезультатЗапроса.ПлатежноеПоручениеПредставление;
	КонецЦикла;
	
	Если СписокПлатежныхДокументов.Количество() = 0 Тогда
		ЭлементСсылкаНаПлатежноеПоручение.Заголовок = НСтр("ru = 'Создать документ'");
		Возврат;
	ИначеЕсли СписокПлатежныхДокументов.Количество() > 1 Тогда 
			
		НадписьКоличествоПлатежныхПорученийИсходящих = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Всего платежных документов: (%1)'"),
																												СписокПлатежныхДокументов.Количество());
		
		ЭлементСсылкаНаПлатежноеПоручение.Заголовок = НадписьКоличествоПлатежныхПорученийИсходящих;
	Иначе
		ЭлементСсылкаНаПлатежноеПоручение.Заголовок = СписокПлатежныхДокументов[0].Представление;
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Интерфейс для работы с подсистемой Печать.

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
		
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
		
КонецПроцедуры

#КонецЕсли