
#Область ПрограммныйИнтерфейс

// Определяет ведется учет ли временных разниц балансовым методом
//
// Параметры:
//  Организация	 - СправочникСсылка.Организации	 
//  Период		 - Дата	 
// 
// Возвращаемое значение:
//  Булево - Истина - если учет временных разниц ведется балансовым методом, Ложь - в противном случае
//
Функция ВедетсяУчетВременныхРазницБалансовымМетодом(Организация, Период) Экспорт
	
	Возврат УчетнаяПолитикаСервер.ВедетсяУчетВременныхРазницБалансовымМетодом(Организация,Период);
	
КонецФункции

// Функция СтрокаТаблицыЗначенийВСтруктуру создает
// структуру со свойствами, как колонки таблицы
// значений передаваемой строки
// и устанавливает этим свойствам значения
// из строки таблицы значений.
// 
// Параметры:
//  СтрокаТаблицыЗначений - СтрокаТаблицыЗначений
//
// ВозвращаемоеЗначение:
//  Структура
//
Функция СтрокаТаблицыЗначенийВСтруктуру(СтрокаТаблицыЗначений) Экспорт
	
	Возврат ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(СтрокаТаблицыЗначений);
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ТекстРазделителяЗапросовПакета() Экспорт
	
	ТекстРазделителя =
	"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	Возврат ТекстРазделителя;
	
КонецФункции

Функция Существует(Организация, Период, РазделУчета = "БУ", ВыводитьСообщениеОбОтсутствииУчетнойПолитики = Ложь, ДокументСсылка = Неопределено) Экспорт
	
	
	Возврат УчетнаяПолитикаСервер.Существует(Организация, Период, РазделУчета , ВыводитьСообщениеОбОтсутствииУчетнойПолитики, ДокументСсылка );
	
КонецФункции

// Функция возвращает налогоплательщика для переданной структурной единицы
//
// Параметры:
//	СтруктурнаяЕдиница - Организация/Подразделение организации
//	Организация - организация из шапки документа
//	РазделНУ - значение перечисления РазделыНалоговогоУчета
//
Функция ПолучитьНалогоплательщикаСтруктурнойЕдиницы(СтруктурнаяЕдиница, Организация, РазделНУ) Экспорт
	
	ЗаписьОСтруктурнойЕдинице = Неопределено;
	Возврат ПроцедурыНалоговогоУчетаВызовСервераПовтИсп.ПолучитьНалогоплательщикаСтруктурнойЕдиницы(СтруктурнаяЕдиница, 
	Организация,
	РазделНУ)
КонецФункции // ПолучитьНалогоплательщикаСтруктурнойЕдиницы()

#КонецОбласти
