
#Область СлужебныйПрограммныйИнтерфейс

#Область  ПроцедурыИФункцииДляОбеспеченияПроведенияДокументов

// Значение переменной
//
Функция ЗначениеПеременной(ИмяПараметра) Экспорт
	Если Метаданные.Константы.Найти(ИмяПараметра)<>Неопределено Тогда
		Возврат Константы[ИмяПараметра].Получить();
	ИначеЕсли Врег(ИмяПараметра) = ВРег("глТекущийПользователь") Тогда
		Возврат  ПользователиКлиентСервер.АвторизованныйПользователь();
	ИначеЕсли Врег(ИмяПараметра) = ВРег("ТекущийПользователь") Тогда
		Возврат  ПользователиКлиентСервер.АвторизованныйПользователь();
	Иначе
		ВызватьИсключение "Неверное имя параметра "+Строка(ИмяПараметра);
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

Функция ДоступноИзменениеТабличныхЧастей() Экспорт
	Возврат НРег(Строка(Метаданные.Обработки.ОбработкаТабличнойЧастиТовары.ОсновнаяФорма.ТипФормы))="управляемая";
КонецФункции

Функция ИмяСправочникаДолжностей() Экспорт
	Возврат ?(Метаданные.Справочники.Найти("ДолжностиОрганизаций")<>Неопределено,"ДолжностиОрганизаций","Должности");	
КонецФункции

Функция ИмяСправочникаСотрудников() Экспорт
	Возврат ?(Метаданные.Справочники.Найти("СотрудникиОрганизаций")<>Неопределено,"СотрудникиОрганизаций","Сотрудники");	
КонецФункции

#КонецОбласти

#КонецОбласти

