
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Контейнер = ЭСФКлиентСервер.КонтейнерМетодов();	
	Контейнер.ПриОткрытииФормы(ЭтаФорма, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьИПродолжить(Команда)	
	
	УникальныйИдентификаторФормыКлиента = ЭтаФорма.УникальныйИдентификатор;	
	Контейнер = ЭСФКлиентСервер.КонтейнерМетодов();
	СсылкаНаМодуль = Контейнер.АдресБиблиотекиКриптографии(УникальныйИдентификаторФормыКлиента);	
	ОписаниеОповещения = Новый ОписаниеОповещения("УстановкаКомпонентыЗавершение", ЭтаФорма);		
	НачатьУстановкуВнешнейКомпоненты(ОписаниеОповещения, СсылкаНаМодуль);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановкаКомпонентыЗавершение(ДополнительныеПараметры)Экспорт
	
	УникальныйИдентификаторФормыКлиента = ЭтаФорма.УникальныйИдентификатор;
	Контейнер = ЭСФКлиентСервер.КонтейнерМетодов();
	СсылкаНаМодуль = Контейнер.АдресБиблиотекиКриптографииНЦА(УникальныйИдентификаторФормыКлиента);
	ОписаниеОповещения = Новый ОписаниеОповещения("УстановкаКомпонентыНЦАЗавершение", ЭтаФорма);
	НачатьУстановкуВнешнейКомпоненты(ОписаниеОповещения, СсылкаНаМодуль);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановкаКомпонентыНЦАЗавершение(ДополнительныеПараметры)Экспорт
	ОбновитьПовторноИспользуемыеЗначения();
	Закрыть(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть(КодВозвратаДиалога.Отмена);
КонецПроцедуры
