
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	роНеПоказыватьИнформациюДляПользователей = ХранилищеНастроекДанныхФорм.Загрузить("Обработка.ОбщиеОбъектыРегламентированнойОтчетности.Форма.ИнформацияДляПользователей", "роНеПоказыватьИнформациюДляПользователей");
	БольшеНеПоказыватьЭтоОкно = ЗначениеЗаполнено(роНеПоказыватьИнформациюДляПользователей);
	
	ИмяМакета = "ИнформацияДляПользователей" + РегламентированнаяОтчетность.ИДКонфигурации();
	МакетМетаданные = Метаданные.Обработки.ОбщиеОбъектыРегламентированнойОтчетности.Макеты.Найти(ИмяМакета);
	Если МакетМетаданные <> Неопределено Тогда
		Макет = Обработки.ОбщиеОбъектыРегламентированнойОтчетности.ПолучитьМакет(ИмяМакета);
		Если Макет.ВысотаТаблицы > 1 Тогда
			ОписаниеОбновлений.Очистить();
			ОписаниеОбновлений.Вывести(Макет);
		Иначе
			Если НЕ Параметры.Свойство("АвтоматическийПоказ") ИЛИ НЕ Параметры.АвтоматическийПоказ Тогда
				ОбщегоНазначения.СообщитьПользователю(
					НСтр("ru = 'Описание особенностей для текущей версии подсистемы отсутствует'"));
			КонецЕсли;
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	Иначе
		Если НЕ Параметры.Свойство("АвтоматическийПоказ") ИЛИ НЕ Параметры.АвтоматическийПоказ Тогда
			ОбщегоНазначения.СообщитьПользователю(
				НСтр("ru = 'Описание особенностей для текущей версии подсистемы недоступно'"));
		КонецЕсли;
		Отказ = Истина;
		Возврат;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;	
	ПриЗакрытииНаСервере();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ПриЗакрытииНаСервере()
	
	ХранилищеНастроекДанныхФорм.Сохранить("Обработка.ОбщиеОбъектыРегламентированнойОтчетности.Форма.ИнформацияДляПользователей", "роНеПоказыватьИнформациюДляПользователей", ?(БольшеНеПоказыватьЭтоОкно, Метаданные.Версия, Неопределено));
	
КонецПроцедуры
