////////////////////////////////////////////////////////////////////////////////
// КонтактнаяИнформация: содержит алгоритмы работы с контактной информацией, 
//   исполняемые на сервере, выполняется передача управления на сервер
//  
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

Функция МассивТиповКонтактнойИнформации() Экспорт
	
	Возврат КонтактнаяИнформация.МассивТиповКонтактнойИнформации();
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция ШаблоныТелефонныхНомеров() Экспорт
	
	Возврат КонтактнаяИнформация.ШаблоныТелефонныхНомеров();
	
КонецФункции

Функция ПроверитьИПолучитьОбъектКИОрганизации(ОбъектКИ) Экспорт
	Возврат КонтактнаяИнформация.ПроверитьИПолучитьОбъектКИОрганизации(ОбъектКИ);
КонецФункции

Функция ПолучитьАдресныеСокращенияПоУровню(Уровень) Экспорт
	
	Возврат АдресныйКлассификатор.ПолучитьАдресныеСокращенияПоУровню(Уровень);
	
КонецФункции