
#Область ПрикладныеКлассификаторы

// Открывает форму списка видов номенклатуры.
//
Процедура ОткрытьФормуСпискаВидыНоменклатуры(ВладелецФормы) Экспорт
	
	ОткрытьФорму("Справочник.ВидыНоменклатуры.ФормаСписка", , ВладелецФормы);
	Возврат;
	
КонецПроцедуры

// Открывает форму списка номенклатуры.
//
Процедура ОткрытьФормуСпискаНоменклатуры(ВладелецФормы) Экспорт
	
	ОткрытьФорму("Справочник.Номенклатура.ФормаСписка", , ВладелецФормы);
	Возврат;
	
КонецПроцедуры

#КонецОбласти

Функция УдалосьПодключитьКриптопровайдерНаКлиенте(Версия = "", РежимТишины = Ложь, ТолькоПодключение = Ложь) Экспорт
	
	Криптопровайдер = ИнтеграцияИСМПТККлиентСерверПереопределяемый.НовыйКриптопровайдерWSSocket(, РежимТишины, ТолькоПодключение);
		
	Если Криптопровайдер = Неопределено Тогда
		ОбновитьПовторноИспользуемыеЗначения();
		Подключается = Ложь;
		Версия = "";
	Иначе
		Подключается = Истина;
		Версия = Криптопровайдер.Версия;
	КонецЕсли;
		
		
	Возврат Подключается;
	
КонецФункции

Функция ПолучитьСписокДляОтбораМаркируемойПродукции() Экспорт
	
	ОсобенностьУчетаСписок = Новый Массив();
	ОсобенностьУчетаСписок.Добавить(ПредопределенноеЗначение("Перечисление.ОсобенностиУчетаНоменклатуры.ТабачнаяПродукция"));
	ОсобенностьУчетаСписок.Добавить(ПредопределенноеЗначение("Перечисление.ОсобенностиУчетаНоменклатуры.ОбувнаяПродукция"));
	ОсобенностьУчетаСписок.Добавить(ПредопределенноеЗначение("Перечисление.ОсобенностиУчетаНоменклатуры.МолочнаяПродукция"));
	ОсобенностьУчетаСписок.Добавить(ПредопределенноеЗначение("Перечисление.ОсобенностиУчетаНоменклатуры.ЛекарственныеПрепараты"));
	
	Возврат ОсобенностьУчетаСписок;
	
КонецФункции

Функция ПолучитьПараметрыОжиданияФоновогоЗадачния(ФормаВладелец) Экспорт
	
	Возврат ДлительныеОперацииКлиент.ПараметрыОжидания(ФормаВладелец);

КонецФункции

Процедура ОжидатьЗавершениеФоновогоЗадания(ДлительнаяОперация, ОповещениеОЗавершении = Неопределено, ПараметрыОжидания = Неопределено) Экспорт
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры