
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Источник = ПараметрыВыполненияКоманды.Источник;
	
	Если ТипЗнч(Источник) = Тип("ФормаКлиентскогоПриложения") Тогда
			
		Если Источник.ИмяФормы = "Документ.УведомлениеОбЭкспортеЕАЭСИСМПТК.Форма.ФормаДокумента" Тогда
			
			ИнтеграцияИСМПТККлиент.ОбновитьДокументыИзИСМПТ(ПараметрКоманды, Новый Структура("ЗапускатьФоновоеЗадание, ТолькоОбновитьСтатус", Ложь, Истина));
			
		Иначе
			
			ИспользоватьФоновуюОтправкуДокументИСМПТ = ОбщегоНазначенияИСМПТККлиентСерверПереопределяемый.ИспользоватьФоновуюОтправкуДокументовИСМПТ();
			
			ДополнительныеПараметры = Новый Структура("ЗапускатьФоновоеЗадание, КлючФормы, ТолькоОбновитьСтатус", ИспользоватьФоновуюОтправкуДокументИСМПТ, Источник.КлючУникальности, Истина);
			
			ИнтеграцияИСМПТККлиент.ОбновитьДокументыИзИСМПТ(ПараметрКоманды, ДополнительныеПараметры);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
