
#Область ПрограммныйИнтерфейс

// Процедура - Форма объекта при открытии
//
// Параметры:
//  Форма	 - 	УправляемаяФорма 
//  Отказ	 - 	Булево 
//
Процедура ФормаОбъекта_ПриОткрытии(Форма,Отказ) Экспорт
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(Форма);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

// Процедура - Изменить выделенные
//
// Параметры:
//  Форма	 - 	УправляемаяФорма 
//  Команда	 - 	выполняемая команда формы 
//
Процедура ИзменитьВыделенные(Форма,Команда) Экспорт
	
	ГрупповоеИзменениеОбъектовКлиент.ИзменитьВыделенные(Форма.Элементы.Список);
		
КонецПроцедуры

// Процедура - Обработка оповещения
//
// Параметры:
//  Форма		 - 	УправляемаяФорма 
//  ИмяСобытия	 - 	Строка 
//  Параметр	 - 	параметр сообщения. Могут быть переданы любые необходимые данные. 
//  Источник	 - 	источник  события 
//
Процедура ОбработкаОповещения(Форма,ИмяСобытия, Параметр, Источник)  Экспорт
	
	ОбщегоНазначенияБККлиент.ОбработкаОповещенияФормыДокумента(Форма, Форма.Объект.Ссылка, ИмяСобытия, Параметр, Источник);

КонецПроцедуры

// Обработчик команды формы.
//
// Параметры:
//   Форма - УправляемаяФорма - Форма, из которой выполняется команда.
//   Команда - КомандаФормы - Выполняемая команда.
//   Источник - ТаблицаФормы, ДанныеФормыСтруктура - Объект или список формы с полем "Ссылка".
//
Процедура ВыполнитьКоманду(Форма, Команда, Источник) Экспорт
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(Форма, Команда, Источник);	
КонецПроцедуры

#КонецОбласти

Процедура ФормаСписка_СписокПриАктивизацииСтроки(Форма,Элемент) Экспорт
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(Форма);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	
КонецПроцедуры

