
#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработкаТабличныхЧастейКлиентСервер

// При изменении единицы таб части
//
Процедура ПриИзмененииЕдиницыТабЧасти(СтрокаТабличнойЧасти) Экспорт
	
	// Установить коэффициент
	СтрокаТабличнойЧасти.Коэффициент = 1; 
	мКоэффициент = СтрокаТабличнойЧасти.Коэффициент;
	СтрокаТабличнойЧасти.Коэффициент = си_УчетСпецодеждыСервер.КоэффициентПересчетаВБазовую(СтрокаТабличнойЧасти.ЕдиницаИзмерения,СтрокаТабличнойЧасти.Номенклатура);
	Если мКоэффициент<>СтрокаТабличнойЧасти.Коэффициент Тогда
		СтрокаТабличнойЧасти.Количество = СтрокаТабличнойЧасти.Количество / (СтрокаТабличнойЧасти.Коэффициент/?(мКоэффициент=0,1,мКоэффициент));
	КонецЕсли;
	
КонецПроцедуры // ПриИзмененииЕдиницыТабЧасти

#КонецОбласти

#КонецОбласти
