////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ОтборСчет") Тогда 
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Счет", Параметры.ОтборСчет,,,Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
		
	КонецЕсли;
		
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ПерейтиКДокументу(Команда)
		
	СтрокаТЧ = Элементы.Список.ТекущиеДанные;
	
	Если СтрокаТЧ = Неопределено Тогда
		Возврат;
	КонецЕсли;

	НаименованиеДокумента = НаименованиеДокументаНаСервер(СтрокаТЧ.Регистратор);
	
	Отбор = Новый Структура("Ссылка", СтрокаТЧ.Регистратор);
	
	ОткрытьФорму("Документ." + НаименованиеДокумента + ".ФормаСписка", Новый Структура("Отбор", Отбор)); 
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервереБезКонтекста
Функция НаименованиеДокументаНаСервер(Документ)
	
	Возврат Документ.Метаданные().Имя;
	
КонецФункции

