
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Источник = ПараметрыВыполненияКоманды.Источник;
	
	Если ТипЗнч(Источник) = ЭСФКлиентПереопределяемый.ПолучитьТипФормаКлиентскогоПриложения() Тогда
		
		Если Источник.ИмяФормы = "Справочник.ВиртуальныеСклады.Форма.ФормаЭлемента" Тогда
			
			ВСКлиент.ОбновитьСтатусВСПоИдентификатору(ПараметрКоманды, Ложь);
			
		Иначе
			
			ИспользоватьФоновуюОтправкуЭСФ = ЭСФКлиентСерверПереопределяемый.ИспользоватьФоновуюОтправкуЭСФ();
			
			ВСКлиент.ОбновитьСтатусВСПоИдентификатору(ПараметрКоманды, ИспользоватьФоновуюОтправкуЭСФ);
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры
